const DEFAULT_QURAN_INDOPAK = {"baqarah":{"id":"baqarah","surahNum":2,"nameAr":"سُورَةُ ٱلْبَقَرَةِ","nameTa":"அல்-பகரா","nameEn":"Al-Baqarah","ayat":[{"ar":"الٓمّٓۚ"},{"ar":"ذٰلِكَ الۡڪِتٰبُ لَا رَيۡبَۛۚۖ فِيۡهِۛۚ هُدًى لِّلۡمُتَّقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَۙ"},{"ar":"وَالَّذِيۡنَ يُؤۡمِنُوۡنَ بِمَۤا اُنۡزِلَ اِلَيۡكَ وَمَاۤ اُنۡزِلَ مِنۡ قَبۡلِكَۚ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلٰى هُدًى مِّنۡ رَّبِّهِمۡ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا سَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"خَتَمَ اللّٰهُ عَلَىٰ قُلُوۡبِهِمۡ وَعَلٰى سَمۡعِهِمۡ​ؕ وَعَلٰىٓ اَبۡصَارِهِمۡ غِشَاوَةٌ  وَّلَهُمۡ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ اٰمَنَّا بِاللّٰهِ وَبِالۡيَوۡمِ الۡاٰخِرِ وَمَا هُمۡ بِمُؤۡمِنِيۡنَ​ۘ"},{"ar":"يُخٰدِعُوۡنَ اللّٰهَ وَالَّذِيۡنَ اٰمَنُوۡا ​ۚ وَمَا يَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَؕ"},{"ar":"فِىۡ قُلُوۡبِهِمۡ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًا ​ۚ وَّلَهُمۡ عَذَابٌ اَلِيۡمٌۙۢبِمَا كَانُوۡا يَكۡذِبُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ لَا تُفۡسِدُوۡا فِىۡ الۡاَرۡضِۙ قَالُوۡاۤ اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ"},{"ar":"اَلَا ۤ اِنَّهُمۡ هُمُ الۡمُفۡسِدُوۡنَ وَلٰـكِنۡ لَّا يَشۡعُرُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا كَمَاۤ اٰمَنَ النَّاسُ قَالُوۡاۤ اَنُؤۡمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُ​ ؕ اَلَاۤ اِنَّهُمۡ هُمُ السُّفَهَآءُ وَلٰـكِنۡ لَّا يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡاۤ اٰمَنَّا ۖۚ وَاِذَا خَلَوۡا اِلٰى شَيٰطِيۡنِهِمۡۙ قَالُوۡاۤ اِنَّا مَعَكُمۡۙ اِنَّمَا نَحۡنُ مُسۡتَهۡزِءُوۡنَ"},{"ar":"اَللّٰهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِىۡ طُغۡيَانِهِمۡ يَعۡمَهُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى فَمَا رَبِحَتۡ تِّجَارَتُهُمۡ وَمَا كَانُوۡا مُهۡتَدِيۡنَ"},{"ar":"مَثَلُهُمۡ كَمَثَلِ الَّذِى اسۡتَوۡقَدَ نَارًا ​ۚ فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَهٗ ذَهَبَ اللّٰهُ بِنُوۡرِهِمۡ وَتَرَكَهُمۡ فِىۡ ظُلُمٰتٍ لَّا يُبۡصِرُوۡنَ"},{"ar":"صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَرۡجِعُوۡنَ ۙ"},{"ar":"اَوۡ كَصَيِّبٍ مِّنَ السَّمَآءِ فِيۡهِ ظُلُمٰتٌ وَّرَعۡدٌ وَّبَرۡقٌ​ ۚ يَجۡعَلُوۡنَ اَصَابِعَهُمۡ فِىۡۤ اٰذَانِهِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ​ؕ وَاللّٰهُ مُحِيۡطٌ​ۢ بِالۡكٰفِرِيۡنَ"},{"ar":"يَكَادُ الۡبَرۡقُ يَخۡطَفُ اَبۡصَارَهُمۡ​ؕ كُلَّمَاۤ اَضَآءَ لَهُمۡ مَّشَوۡا فِيۡهِۙ وَاِذَاۤ اَظۡلَمَ عَلَيۡهِمۡ قَامُوۡا​ؕ وَلَوۡ شَآءَ اللّٰهُ لَذَهَبَ بِسَمۡعِهِمۡ وَاَبۡصَارِهِمۡ​ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"يٰۤاَيُّهَا النَّاسُ اعۡبُدُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ وَالَّذِيۡنَ مِنۡ قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَ ۙ"},{"ar":"الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّـكُمۡ​ۚ فَلَا تَجۡعَلُوۡا لِلّٰهِ اَنۡدَادًا وَّاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاِنۡ کُنۡتُمۡ فِىۡ رَيۡبٍ مِّمَّا نَزَّلۡنَا عَلٰى عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَةٍ مِّنۡ مِّثۡلِهٖ وَادۡعُوۡا شُهَدَآءَكُمۡ مِّنۡ دُوۡنِ اللّٰهِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَلَنۡ تَفۡعَلُوۡا فَاتَّقُوۡا النَّارَ الَّتِىۡ وَقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُ  ۖۚ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ"},{"ar":"وَبَشِّرِ الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ؕ ڪُلَّمَا رُزِقُوۡا مِنۡهَا مِنۡ ثَمَرَةٍ رِّزۡقًا ​ۙ قَالُوۡا هٰذَا الَّذِىۡ رُزِقۡنَا مِنۡ قَبۡلُ وَاُتُوۡا بِهٖ مُتَشَابِهًا ​ؕ وَلَهُمۡ فِيۡهَآ اَزۡوَاجٌ مُّطَهَّرَةٌ ​ۙ وَّهُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ اللّٰهَ لَا يَسۡتَحۡـىٖۤ اَنۡ يَّضۡرِبَ مَثَلًا مَّا ​بَعُوۡضَةً فَمَا فَوۡقَهَا ​ؕ فَاَمَّا ​الَّذِيۡنَ اٰمَنُوۡا فَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ۚ وَاَمَّا الَّذِيۡنَ ڪَفَرُوۡا فَيَقُوۡلُوۡنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۘ يُضِلُّ بِهٖ ڪَثِيۡرًا وَّيَهۡدِىۡ بِهٖ كَثِيۡرًا ​ؕ وَمَا يُضِلُّ بِهٖۤ اِلَّا الۡفٰسِقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَنۡقُضُوۡنَ عَهۡدَ اللّٰهِ مِنۡۢ بَعۡدِ مِيۡثَاقِهٖ وَيَقۡطَعُوۡنَ مَآ اَمَرَ اللّٰهُ بِهٖۤ اَنۡ يُّوۡصَلَ وَيُفۡسِدُوۡنَ فِى الۡاَرۡضِ​ؕ اُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"كَيۡفَ تَكۡفُرُوۡنَ بِاللّٰهِ وَڪُنۡتُمۡ اَمۡوَاتًا فَاَحۡيَاکُمۡ​ۚ ثُمَّ يُمِيۡتُكُمۡ ثُمَّ يُحۡيِيۡكُمۡ ثُمَّ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"هُوَ الَّذِىۡ خَلَقَ لَـكُمۡ مَّا فِى الۡاَرۡضِ جَمِيۡعًا ثُمَّ اسۡتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰٮهُنَّ سَبۡعَ سَمٰوٰتٍ​ؕ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذۡ قَالَ رَبُّكَ لِلۡمَلٰٓٮِٕكَةِ اِنِّىۡ جَاعِلٌ فِى الۡاَرۡضِ خَلِيۡفَةً ؕ قَالُوۡٓا اَتَجۡعَلُ فِيۡهَا مَنۡ يُّفۡسِدُ فِيۡهَا وَيَسۡفِكُ الدِّمَآءَۚ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَـكَ​ؕ قَالَ اِنِّىۡٓ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَعَلَّمَ اٰدَمَ الۡاَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى الۡمَلٰٓٮِٕكَةِ فَقَالَ اَنۡۢبِــُٔوۡنِىۡ بِاَسۡمَآءِ هٰٓؤُلَآءِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"قَالُوۡا سُبۡحٰنَكَ لَا عِلۡمَ لَنَآ اِلَّا مَا عَلَّمۡتَنَا ؕ اِنَّكَ اَنۡتَ الۡعَلِيۡمُ الۡحَكِيۡمُ"},{"ar":"قَالَ يٰٓـاٰدَمُ اَنۡۢبِئۡهُمۡ بِاَسۡمَآٮِٕهِمۡ​ۚ فَلَمَّآ اَنۡۢبَاَهُمۡ بِاَسۡمَآٮِٕهِمۡۙ قَالَ اَلَمۡ اَقُل لَّـكُمۡ اِنِّىۡٓ اَعۡلَمُ غَيۡبَ السَّمٰوٰتِ وَالۡاَرۡضِۙ وَاَعۡلَمُ مَا تُبۡدُوۡنَ وَمَا كُنۡتُمۡ تَكۡتُمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا لِلۡمَلٰٓٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡٓا اِلَّاۤ اِبۡلِيۡسَؕ اَبٰى وَاسۡتَكۡبَرَ  وَكَانَ مِنَ الۡكٰفِرِيۡنَ"},{"ar":"وَقُلۡنَا يٰٓـاٰدَمُ اسۡكُنۡ اَنۡتَ وَزَوۡجُكَ الۡجَـنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوۡنَا مِنَ الظّٰلِمِيۡنَ"},{"ar":"فَاَزَلَّهُمَا الشَّيۡطٰنُ عَنۡهَا فَاَخۡرَجَهُمَا مِمَّا كَانَا فِيۡهِ​ وَقُلۡنَا اهۡبِطُوۡا بَعۡضُكُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَلَـكُمۡ فِى الۡاَرۡضِ مُسۡتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيۡنٍ"},{"ar":"فَتَلَقّٰٓى اٰدَمُ مِنۡ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيۡهِ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"قُلۡنَا اهۡبِطُوۡا مِنۡهَا جَمِيۡعًا ​​ۚ فَاِمَّا يَاۡتِيَنَّكُمۡ مِّنِّىۡ هُدًى فَمَنۡ تَبِعَ هُدَاىَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِـاٰيٰتِنَآ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَوۡفُوۡا بِعَهۡدِىۡٓ اُوۡفِ بِعَهۡدِكُمۡۚ وَاِيَّاىَ فَارۡهَبُوۡنِ"},{"ar":"وَاٰمِنُوۡا بِمَآ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَكُمۡ وَلَا تَكُوۡنُوۡآ اَوَّلَ كَافِرٍۢ بِهٖ​ وَلَا تَشۡتَرُوۡا بِاٰيٰتِىۡ ثَمَنًا قَلِيۡلًا وَّاِيَّاىَ فَاتَّقُوۡنِ"},{"ar":"وَلَا تَلۡبِسُوا الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوا الۡحَـقَّ وَاَنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارۡكَعُوۡا مَعَ الرّٰكِعِيۡنَ"},{"ar":"اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"وَاسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ​ؕ وَاِنَّهَا لَكَبِيۡرَةٌ اِلَّا عَلَى الۡخٰشِعِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا رَبِّهِمۡ وَاَنَّهُمۡ اِلَيۡهِ رٰجِعُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا شَفَاعَةٌ وَّلَا يُؤۡخَذُ مِنۡهَا عَدۡلٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذۡ نَجَّيۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ يَسُوۡمُوۡنَكُمۡ سُوۡٓءَ الۡعَذَابِ يُذَبِّحُوۡنَ اَبۡنَآءَكُمۡ وَيَسۡتَحۡيُوۡنَ نِسَآءَكُمۡ​ؕ وَفِىۡ ذٰلِكُمۡ بَلَاۤءٌ مِّنۡ رَّبِّكُمۡ عَظِيۡمٌ"},{"ar":"وَاِذۡ فَرَقۡنَا بِكُمُ الۡبَحۡرَ فَاَنۡجَيۡنٰکُمۡ وَاَغۡرَقۡنَآ اٰلَ فِرۡعَوۡنَ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"وَاِذۡ وٰعَدۡنَا مُوۡسٰٓى اَرۡبَعِيۡنَ لَيۡلَةً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"ثُمَّ عَفَوۡنَا عَنۡكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَالۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُوۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ اِنَّكُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِكُمُ الۡعِجۡلَ فَتُوۡبُوۡآ اِلٰى بَارِٮِٕكُمۡ فَاقۡتُلُوۡٓا اَنۡفُسَكُمۡؕ ذٰ لِكُمۡ خَيۡرٌ لَّـكُمۡ عِنۡدَ بَارِٮِٕكُمۡؕ فَتَابَ عَلَيۡكُمۡ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نُّؤۡمِنَ لَـكَ حَتّٰى نَرَى اللّٰهَ جَهۡرَةً فَاَخَذَتۡكُمُ الصّٰعِقَةُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"ثُمَّ بَعَثۡنٰكُمۡ مِّنۡۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَظَلَّلۡنَا عَلَيۡکُمُ الۡغَمَامَ وَاَنۡزَلۡنَا عَلَيۡكُمُ الۡمَنَّ وَالسَّلۡوٰى​ؕ كُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ​ؕ وَمَا ظَلَمُوۡنَا وَلٰـكِنۡ كَانُوۡآ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا ادۡخُلُوۡا هٰذِهِ الۡقَرۡيَةَ فَکُلُوۡا مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدًا وَّادۡخُلُوا الۡبَابَ سُجَّدًا وَّقُوۡلُوۡا حِطَّةٌ نَّغۡفِرۡ لَـكُمۡ خَطٰيٰكُمۡ​ؕ وَسَنَزِيۡدُ الۡمُحۡسِنِيۡنَ"},{"ar":"فَبَدَّلَ الَّذِيۡنَ ظَلَمُوۡا قَوۡلاً غَيۡرَ الَّذِىۡ قِيۡلَ لَهُمۡ فَاَنۡزَلۡنَا عَلَى الَّذِيۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا كَانُوۡا يَفۡسُقُوۡنَ"},{"ar":"وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ​ؕ فَانۡفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا​ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ​ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نَّصۡبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِهَا وَقِثَّـآٮِٕهَا وَفُوۡمِهَا وَعَدَسِهَا وَ بَصَلِهَا​ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِىۡ هُوَ اَدۡنٰى بِالَّذِىۡ هُوَ خَيۡرٌ​ؕ اِهۡبِطُوۡا مِصۡرًا فَاِنَّ لَـکُمۡ مَّا سَاَلۡتُمۡ​ؕ وَضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ وَالۡمَسۡکَنَةُ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ​ؕ ذٰلِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ الۡحَـقِّ​ؕ ذٰلِكَ بِمَا عَصَوا وَّڪَانُوۡا يَعۡتَدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَادُوۡا وَالنَّصٰرٰى وَالصّٰبِـِٕـيۡنَ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَعَمِلَ صَالِحًـا فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰكُمۡ بِقُوَّةٍ وَّ اذۡكُرُوۡا مَا فِيۡهِ لَعَلَّكُمۡ تَتَّقُوۡنَ"},{"ar":"ثُمَّ تَوَلَّيۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ​​ۚ فَلَوۡلَا فَضۡلُ اللّٰهِ عَلَيۡكُمۡ وَرَحۡمَتُهٗ لَـكُنۡتُمۡ مِّنَ الۡخٰسِرِيۡنَ"},{"ar":"وَلَقَدۡ عَلِمۡتُمُ الَّذِيۡنَ اعۡتَدَوۡا مِنۡكُمۡ فِىۡ السَّبۡتِ فَقُلۡنَا لَهُمۡ كُوۡنُوۡا قِرَدَةً خَاسِـِٔـيۡنَ ​ۚ"},{"ar":"فَجَعَلۡنٰهَا نَكٰلاً لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةً لِّلۡمُتَّقِيۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖۤ اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَةً ​ ؕ قَالُوۡآ اَتَتَّخِذُنَا هُزُوًۡا ​ؕ قَالَ اَعُوۡذُ بِاللّٰهِ اَنۡ اَكُوۡنَ مِنَ الۡجٰـهِلِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكۡرٌؕ عَوَانٌۢ بَيۡنَ ذٰلِكَ​ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا لَوۡنُهَا ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ صَفۡرَآءُۙ فَاقِعٌ لَّوۡنُهَا تَسُرُّ النّٰظِرِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَۙ اِنَّ الۡبَقَرَ تَشٰبَهَ عَلَيۡنَا ؕ وَاِنَّـآ اِنۡ شَآءَ اللّٰهُ لَمُهۡتَدُوۡنَ"},{"ar":"قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوۡلٌ تُثِيۡرُ الۡاَرۡضَ وَلَا تَسۡقِى الۡحَـرۡثَ ​ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيۡهَا ​ؕ قَالُوا الۡـٰٔـنَ جِئۡتَ بِالۡحَـقِّ​ؕ فَذَبَحُوۡهَا وَمَا كَادُوۡا يَفۡعَلُوۡنَ"},{"ar":"وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِيۡهَا ​ؕ وَاللّٰهُ مُخۡرِجٌ مَّا كُنۡتُمۡ تَكۡتُمُوۡنَۚ"},{"ar":"فَقُلۡنَا اضۡرِبُوۡهُ بِبَعۡضِهَا ​ؕ كَذٰلِكَ يُحۡىِ اللّٰهُ الۡمَوۡتٰى ۙ وَيُرِيۡکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"ثُمَّ قَسَتۡ قُلُوۡبُكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ فَهِىَ كَالۡحِجَارَةِ اَوۡ اَشَدُّ قَسۡوَةً ​ ؕ وَاِنَّ مِنَ الۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ الۡاَنۡهٰرُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ الۡمَآءُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اَفَتَطۡمَعُوۡنَ اَنۡ يُّؤۡمِنُوۡا لَـكُمۡ وَقَدۡ كَانَ فَرِيۡقٌ مِّنۡهُمۡ يَسۡمَعُوۡنَ کَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوۡنَهٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡهُ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَـقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّا  ۖۚ وَاِذَا خَلَا بَعۡضُهُمۡ اِلٰى بَعۡضٍ قَالُوۡآ اَ تُحَدِّثُوۡنَهُمۡ بِمَا فَتَحَ اللّٰهُ عَلَيۡكُمۡ لِيُحَآجُّوۡكُمۡ بِهٖ عِنۡدَ رَبِّكُمۡ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"اَوَلَا يَعۡلَمُوۡنَ اَنَّ اللّٰهَ يَعۡلَمُ مَا يُسِرُّوۡنَ وَمَا يُعۡلِنُوۡنَ"},{"ar":"وَ مِنۡهُمۡ اُمِّيُّوۡنَ لَا يَعۡلَمُوۡنَ الۡكِتٰبَ اِلَّاۤ اَمَانِىَّ وَاِنۡ هُمۡ اِلَّا يَظُنُّوۡنَ"},{"ar":"فَوَيۡلٌ لِّلَّذِيۡنَ يَكۡتُبُوۡنَ الۡكِتٰبَ بِاَيۡدِيۡهِمۡ ثُمَّ يَقُوۡلُوۡنَ هٰذَا مِنۡ عِنۡدِ اللّٰهِ لِيَشۡتَرُوۡا بِهٖ ثَمَنًا قَلِيۡلًا ؕ فَوَيۡلٌ لَّهُمۡ مِّمَّا کَتَبَتۡ اَيۡدِيۡهِمۡ وَوَيۡلٌ لَّهُمۡ مِّمَّا يَكۡسِبُوۡنَ"},{"ar":"وَقَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدَةً ​ ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰهِ عَهۡدًا فَلَنۡ يُّخۡلِفَ اللّٰهُ عَهۡدَهٗۤ​ اَمۡ تَقُوۡلُوۡنَ عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"بَلٰى مَنۡ كَسَبَ سَيِّئَةً وَّاَحَاطَتۡ بِهٖ خَطِيْۤـــَٔتُهٗ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَالَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓٮِٕكَ اَصۡحٰبُ الۡجَـنَّةِ ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَ بَنِىۡٓ اِسۡرَآءِيۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰهَ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا وَّذِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰکِيۡنِ وَقُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ ؕ ثُمَّ تَوَلَّيۡتُمۡ اِلَّا قَلِيۡلًا مِّنۡکُمۡ وَاَنۡـتُمۡ مُّعۡرِضُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ لَا تَسۡفِكُوۡنَ دِمَآءَكُمۡ وَلَا تُخۡرِجُوۡنَ اَنۡفُسَكُمۡ مِّنۡ دِيَارِكُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَاَنۡـتُمۡ تَشۡهَدُوۡنَ"},{"ar":"ثُمَّ اَنۡـتُمۡ هٰٓؤُلَاۤءِ تَقۡتُلُوۡنَ اَنۡفُسَكُمۡ وَتُخۡرِجُوۡنَ فَرِيۡقًا مِّنۡكُمۡ مِّنۡ دِيَارِهِمۡ تَظٰهَرُوۡنَ عَلَيۡهِمۡ بِالۡاِثۡمِ وَالۡعُدۡوَانِؕ وَاِنۡ يَّاۡتُوۡكُمۡ اُسٰرٰى تُفٰدُوۡهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡڪُمۡ اِخۡرَاجُهُمۡ​​ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡكِتٰبِ وَتَكۡفُرُوۡنَ بِبَعۡضٍ​ۚ فَمَا جَزَآءُ مَنۡ يَّفۡعَلُ ذٰلِكَ مِنۡکُمۡ اِلَّا خِزۡىٌ فِى الۡحَيٰوةِ الدُّنۡيَا ​ۚ وَيَوۡمَ الۡقِيٰمَةِ يُرَدُّوۡنَ اِلٰٓى اَشَدِّ الۡعَذَابِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الۡحَيٰوةَ الدُّنۡيَا بِالۡاٰخِرَةِ​ فَلَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَ لَقَدۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَقَفَّيۡنَا مِنۡۢ بَعۡدِهٖ بِالرُّسُلِ​ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ اَفَكُلَّمَا جَآءَكُمۡ رَسُوۡلٌۢ بِمَا لَا تَهۡوٰٓى اَنۡفُسُكُمُ اسۡتَكۡبَرۡتُمۡ​ۚ فَفَرِيۡقًا كَذَّبۡتُمۡ وَفَرِيۡقًا تَقۡتُلُوۡنَ"},{"ar":"وَقَالُوۡا قُلُوۡبُنَا غُلۡفٌ​ؕ بَل لَّعَنَهُمُ اللّٰهُ بِكُفۡرِهِمۡ فَقَلِيۡلًا مَّا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ كِتٰبٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡۙ وَكَانُوۡا مِنۡ قَبۡلُ يَسۡتَفۡتِحُوۡنَ عَلَى الَّذِيۡنَ كَفَرُوۡا  ​ۖۚ فَلَمَّا جَآءَهُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِهٖ​ فَلَعۡنَةُ اللّٰهِ عَلَى الۡكٰفِرِيۡنَ"},{"ar":"بِئۡسَمَا اشۡتَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ اَنۡ يَّڪۡفُرُوۡا بِمَآ اَنۡزَلَ اللّٰهُ بَغۡيًا اَنۡ يُّنَزِّلَ اللّٰهُ مِنۡ فَضۡلِهٖ عَلٰى مَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ​ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰى غَضَبٍ​ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا بِمَآ اَنۡزَلَ اللّٰهُ قَالُوۡا نُؤۡمِنُ بِمَآ اُنۡزِلَ عَلَيۡنَا وَيَكۡفُرُوۡنَ بِمَا وَرَآءَهٗ وَهُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا مَعَهُمۡ​ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡـــۢبِيَآءَ اللّٰهِ مِنۡ قَبۡلُ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"وَلَقَدۡ جَآءَکُمۡ مُّوۡسٰى بِالۡبَيِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَآ اٰتَيۡنٰکُمۡ بِقُوَّةٍ وَّاسۡمَعُوۡا ​ ؕ قَالُوۡا سَمِعۡنَا وَعَصَيۡنَا  وَاُشۡرِبُوۡا فِىۡ قُلُوۡبِهِمُ الۡعِجۡلَ بِکُفۡرِهِمۡ ​ؕ قُلۡ بِئۡسَمَا يَاۡمُرُکُمۡ بِهٖۤ اِيۡمَانُكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"قُلۡ اِنۡ كَانَتۡ لَـکُمُ الدَّارُ الۡاٰخِرَةُ عِنۡدَ اللّٰهِ خَالِصَةً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"وَ لَنۡ يَّتَمَنَّوۡهُ اَبَدًاۢ بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَلَتَجِدَنَّهُمۡ اَحۡرَصَ النَّاسِ عَلٰى حَيٰوةٍ  ۛۚ وَ مِنَ الَّذِيۡنَ اَشۡرَكُوۡا​​  ۛۚ يَوَدُّ اَحَدُهُمۡ لَوۡ يُعَمَّرُ اَ لۡفَ سَنَةٍ ۚ وَمَا هُوَ بِمُزَحۡزِحِهٖ مِنَ الۡعَذَابِ اَنۡ يُّعَمَّرَ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ "},{"ar":"قُلۡ مَنۡ كَانَ عَدُوًّا لِّجِبۡرِيۡلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلۡبِكَ بِاِذۡنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدًى وَّبُشۡرٰى لِلۡمُؤۡمِنِيۡنَ"},{"ar":"مَنۡ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰٓٮِٕکَتِهٖ وَ رُسُلِهٖ وَجِبۡرِيۡلَ وَمِيۡكٰٮلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلۡكٰفِرِيۡنَ"},{"ar":"وَلَقَدۡ اَنۡزَلۡنَآ اِلَيۡكَ اٰيٰتٍۢ بَيِّنٰتٍ​​ۚ وَمَا يَكۡفُرُ بِهَآ اِلَّا الۡفٰسِقُوۡنَ"},{"ar":"اَوَکُلَّمَا عٰهَدُوۡا عَهۡدًا نَّبَذَهٗ فَرِيۡقٌ مِّنۡهُمۡ​ؕ بَلۡ اَكۡثَرُهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡ نَبَذَ فَرِيۡقٌ مِّنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَۙ کِتٰبَ اللّٰهِ وَرَآءَ ظُهُوۡرِهِمۡ كَاَنَّهُمۡ لَا يَعۡلَمُوۡنَ"},{"ar":"وَاتَّبَعُوۡا مَا تَتۡلُوا الشَّيٰطِيۡنُ عَلٰى مُلۡكِ سُلَيۡمٰنَ​​ۚ وَمَا کَفَرَ سُلَيۡمٰنُ وَلٰـكِنَّ الشَّيٰـطِيۡنَ كَفَرُوۡا يُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ وَمَآ اُنۡزِلَ عَلَى الۡمَلَـکَيۡنِ بِبَابِلَ هَارُوۡتَ وَمَارُوۡتَ​ؕ وَمَا يُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰى يَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَةٌ فَلَا تَكۡفُرۡؕ​ فَيَتَعَلَّمُوۡنَ مِنۡهُمَا مَا يُفَرِّقُوۡنَ بِهٖ بَيۡنَ الۡمَرۡءِ وَ زَوۡجِهٖ​ؕ وَمَا هُمۡ بِضَآرِّيۡنَ بِهٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَيَتَعَلَّمُوۡنَ مَا يَضُرُّهُمۡ وَلَا يَنۡفَعُهُمۡ​ؕ وَلَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮهُ مَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ​ؕ وَلَبِئۡسَ مَا شَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ​ؕ لَوۡ کَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"وَلَوۡ اَنَّهُمۡ اٰمَنُوۡا وَاتَّقَوۡا لَمَثُوۡبَةٌ مِّنۡ عِنۡدِ اللّٰهِ خَيۡرٌ ؕ​ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَاسۡمَعُوۡا ​ؕ وَلِلۡڪٰفِرِيۡنَ عَذَابٌ اَلِيۡمٌ"},{"ar":"مَا يَوَدُّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَلَا الۡمُشۡرِكِيۡنَ اَنۡ يُّنَزَّلَ عَلَيۡڪُمۡ مِّنۡ خَيۡرٍ مِّنۡ رَّبِّکُمۡ​ؕ وَاللّٰهُ يَخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ"},{"ar":"مَا نَنۡسَخۡ مِنۡ اٰيَةٍ اَوۡ نُنۡسِهَا نَاۡتِ بِخَيۡرٍ مِّنۡهَآ اَوۡ مِثۡلِهَا ​ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَمَا لَـکُمۡ مِّنۡ دُوۡنِ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَمۡ تُرِيۡدُوۡنَ اَنۡ تَسۡـَٔـلُوۡا رَسُوۡلَـكُمۡ كَمَا سُٮِٕلَ مُوۡسٰى مِنۡ قَبۡلُ​ؕ وَمَنۡ يَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِيۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ"},{"ar":"وَدَّ کَثِيۡرٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يَرُدُّوۡنَكُمۡ مِّنۡۢ بَعۡدِ اِيۡمَانِكُمۡ كُفَّارًا ۖۚ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِهِمۡ مِّنۡۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ الۡحَـقُّ​ ۚ فَاعۡفُوۡا وَاصۡفَحُوۡا حَتّٰى يَاۡتِىَ اللّٰهُ بِاَمۡرِهٖ ​ؕ اِنَّ اللّٰهَ عَلٰى کُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ  ​ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَقَالُوۡا لَنۡ يَّدۡخُلَ الۡجَـنَّةَ اِلَّا مَنۡ كَانَ هُوۡدًا اَوۡ نَصٰرٰى​ؕ تِلۡكَ اَمَانِيُّهُمۡ​ؕ قُلۡ هَاتُوۡا بُرۡهَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"بَلٰى مَنۡ اَسۡلَمَ وَجۡهَهٗ لِلّٰهِ وَهُوَ مُحۡسِنٌ فَلَهٗۤ اَجۡرُهٗ عِنۡدَ رَبِّهٖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَقَالَتِ الۡيَهُوۡدُ لَـيۡسَتِ النَّصٰرٰى عَلٰى شَىۡءٍ وَّقَالَتِ النَّصٰرٰى لَـيۡسَتِ الۡيَهُوۡدُ عَلٰى شَىۡءٍۙ وَّهُمۡ يَتۡلُوۡنَ الۡكِتٰبَؕ كَذٰلِكَ قَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ مِثۡلَ قَوۡلِهِمۡ​ۚ فَاللّٰهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ الۡقِيٰمَةِ فِيۡمَا كَانُوۡا فِيۡهِ يَخۡتَلِفُوۡنَ"},{"ar":"وَمَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنۡ يُّذۡكَرَ فِيۡهَا اسۡمُهٗ وَسَعٰـى فِىۡ خَرَابِهَا ​ؕ اُولٰٓٮِٕكَ مَا كَانَ لَهُمۡ اَنۡ يَّدۡخُلُوۡهَآ اِلَّا خَآٮِٕفِيۡنَ ؕ لَهُمۡ فِى الدُّنۡيَا خِزۡىٌ وَّلَهُمۡ فِى الۡاٰخِرَةِ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَلِلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ​ فَاَيۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡهُ اللّٰهِ​ؕ اِنَّ اللّٰهَ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۙ​ سُبۡحٰنَهٗ ​ؕ بَل لَّهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ كُلٌّ لَّهٗ قَانِتُوۡنَ"},{"ar":"بَدِيۡعُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ"},{"ar":"وَقَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ لَوۡلَا يُكَلِّمُنَا اللّٰهُ اَوۡ تَاۡتِيۡنَآ اٰيَةٌ ​ ؕ كَذٰلِكَ قَالَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّثۡلَ قَوۡلِهِمۡؕ​ تَشَابَهَتۡ قُلُوۡبُهُمۡ​ؕ قَدۡ بَيَّنَّا الۡاٰيٰتِ لِقَوۡمٍ يُّوۡقِنُوۡنَ"},{"ar":"اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًا ۙ​ وَّلَا تُسۡـَٔـلُ عَنۡ اَصۡحٰبِ الۡجَحِيۡمِ"},{"ar":"وَلَنۡ تَرۡضٰى عَنۡكَ الۡيَهُوۡدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَهُمۡ​ؕ قُلۡ اِنَّ هُدَى اللّٰهِ هُوَ الۡهُدٰى​ؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ بَعۡدَ الَّذِىۡ جَآءَكَ مِنَ الۡعِلۡمِ​ۙ مَا لَـكَ مِنَ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَتۡلُوۡنَهٗ حَقَّ تِلَاوَتِهٖؕ اُولٰٓٮِٕكَ يُؤۡمِنُوۡنَ بِهٖ​ ؕ وَمَنۡ يَّكۡفُرۡ بِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا عَدۡلٌ وَّلَا تَنۡفَعُهَا شَفَاعَةٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذِ ابۡتَلٰٓى اِبۡرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ ​ؕ قَالَ اِنِّىۡ جَاعِلُكَ لِلنَّاسِ اِمَامًا ​ؕ قَالَ وَمِنۡ ذُرِّيَّتِىۡ ​ؕ قَالَ لَا يَنَالُ عَهۡدِى الظّٰلِمِيۡنَ"},{"ar":"وَاِذۡ جَعَلۡنَا الۡبَيۡتَ مَثَابَةً لِّلنَّاسِ وَاَمۡنًا ؕ وَاتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰهٖمَ مُصَلًّى​ ؕ وَعَهِدۡنَآ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ اَنۡ طَهِّرَا بَيۡتِىَ لِلطَّآٮِٕفِيۡنَ وَالۡعٰكِفِيۡنَ وَالرُّکَّعِ السُّجُوۡدِ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اجۡعَلۡ هٰذَا بَلَدًا اٰمِنًا وَّارۡزُقۡ اَهۡلَهٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ قَالَ وَمَنۡ كَفَرَ فَاُمَتِّعُهٗ قَلِيۡلًا ثُمَّ اَضۡطَرُّهٗۤ اِلٰى عَذَابِ النَّارِ​ؕ وَبِئۡسَ الۡمَصِيۡرُ"},{"ar":"وَاِذۡ يَرۡفَعُ اِبۡرٰهٖمُ الۡقَوَاعِدَ مِنَ الۡبَيۡتِ وَاِسۡمٰعِيۡلُؕ رَبَّنَا تَقَبَّلۡ مِنَّا ​ؕ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ"},{"ar":"رَبَّنَا وَاجۡعَلۡنَا مُسۡلِمَيۡنِ لَـكَ وَ مِنۡ ذُرِّيَّتِنَآ اُمَّةً مُّسۡلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَا ۚ اِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"رَبَّنَا وَابۡعَثۡ فِيۡهِمۡ رَسُوۡلًا مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِكَ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَ يُزَكِّيۡهِمۡ​ؕ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ"},{"ar":"وَمَنۡ يَّرۡغَبُ عَنۡ مِّلَّةِ اِبۡرٰهٖمَ اِلَّا مَنۡ سَفِهَ نَفۡسَهٗ ​ؕ وَلَقَدِ اصۡطَفَيۡنٰهُ فِى الدُّنۡيَا ​ۚ وَاِنَّهٗ فِى الۡاٰخِرَةِ لَمِنَ الصّٰلِحِيۡنَ"},{"ar":"اِذۡ قَالَ لَهٗ رَبُّهٗۤ اَسۡلِمۡ​ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِيۡنَ"},{"ar":"وَوَصّٰى بِهَآ اِبۡرٰهٖمُ بَنِيۡهِ وَ يَعۡقُوۡبُؕ يٰبَنِىَّ اِنَّ اللّٰهَ اصۡطَفٰى لَـكُمُ الدِّيۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡـتُمۡ مُّسۡلِمُوۡنَؕ"},{"ar":"اَمۡ كُنۡتُمۡ شُهَدَآءَ اِذۡ حَضَرَ يَعۡقُوۡبَ الۡمَوۡتُۙ اِذۡ قَالَ لِبَنِيۡهِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِىۡؕ قَالُوۡا نَعۡبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآٮِٕكَ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ اِلٰهًا وَّاحِدًا ۖۚ وَّنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"وَقَالُوۡا کُوۡنُوۡا هُوۡدًا اَوۡ نَصٰرٰى تَهۡتَدُوۡا ​ؕ قُلۡ بَلۡ مِلَّةَ اِبۡرٰهٖمَ حَنِيۡفًا ​ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ"},{"ar":"قُوۡلُوۡٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنۡزِلَ اِلَيۡنَا وَمَآ اُنۡزِلَ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَمَآ اُوۡتِىَ مُوۡسٰى وَعِيۡسٰى وَمَآ اُوۡتِىَ النَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ​ۚ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَآ اٰمَنۡتُمۡ بِهٖ فَقَدِ اهۡتَدَوْا ​ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا هُمۡ فِىۡ شِقَاقٍ​ ۚ فَسَيَكۡفِيۡکَهُمُ اللّٰهُ ​ۚ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُؕ"},{"ar":"صِبۡغَةَ اللّٰهِ ​ۚ وَمَنۡ اَحۡسَنُ مِنَ اللّٰهِ صِبۡغَةً  وَّنَحۡنُ لَهٗ عٰبِدُوۡنَ"},{"ar":"قُلۡ اَ تُحَآجُّوۡنَـنَا فِى اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّکُمۡۚ وَلَنَآ اَعۡمَالُـنَا وَلَـكُمۡ اَعۡمَالُكُمۡۚ وَنَحۡنُ لَهٗ مُخۡلِصُوۡنَۙ"},{"ar":"اَمۡ تَقُوۡلُوۡنَ اِنَّ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطَ كَانُوۡا هُوۡدًا اَوۡ نَصٰرٰى​ؕ قُلۡ ءَاَنۡـتُمۡ اَعۡلَمُ اَمِ اللّٰهُ​ ؕ وَمَنۡ اَظۡلَمُ مِمَّنۡ كَتَمَ شَهَادَةً عِنۡدَهٗ مِنَ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"سَيَقُوۡلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰٮهُمۡ عَنۡ قِبۡلَتِهِمُ الَّتِىۡ كَانُوۡا عَلَيۡهَا ​ؕ قُل لِّلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ ؕ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِراطٍ مُّسۡتَقِيۡمٍ"},{"ar":"وَكَذٰلِكَ جَعَلۡنٰكُمۡ اُمَّةً وَّسَطًا لِّتَکُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ وَيَكُوۡنَ الرَّسُوۡلُ عَلَيۡكُمۡ شَهِيۡدًا ؕ وَمَا جَعَلۡنَا الۡقِبۡلَةَ الَّتِىۡ كُنۡتَ عَلَيۡهَآ اِلَّا لِنَعۡلَمَ مَنۡ يَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ يَّنۡقَلِبُ عَلٰى عَقِبَيۡهِ ​ؕ وَاِنۡ كَانَتۡ لَكَبِيۡرَةً اِلَّا عَلَى الَّذِيۡنَ هَدَى اللّٰهُ ؕ وَمَا كَانَ اللّٰهُ لِيُضِيْعَ اِيۡمَانَكُمۡ​ ؕ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِيۡمٌ"},{"ar":"قَدۡ نَرٰى تَقَلُّبَ وَجۡهِكَ فِى السَّمَآءِ​​ۚ فَلَـنُوَلِّيَنَّكَ قِبۡلَةً تَرۡضٰٮهَا​ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَكُمۡ شَطۡرَهٗ ​ؕ وَاِنَّ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ لَيَـعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعۡمَلُوۡنَ"},{"ar":"وَلَٮِٕنۡ اَ تَيۡتَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوۡا قِبۡلَتَكَ​ۚ وَمَآ اَنۡتَ بِتَابِعٍ قِبۡلَتَهُمۡ​ۚ وَمَا بَعۡضُهُمۡ بِتَابِعٍ قِبۡلَةَ بَعۡضٍؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ​ۙ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيۡنَ​ۘ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَعۡرِفُوۡنَهٗ كَمَا يَعۡرِفُوۡنَ اَبۡنَآءَهُمۡؕ وَاِنَّ فَرِيۡقًا مِّنۡهُمۡ لَيَكۡتُمُوۡنَ الۡحَـقَّ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُوۡنَنَّ مِنَ الۡمُمۡتَرِيۡنَ"},{"ar":"وَلِكُلٍّ وِّجۡهَةٌ هُوَ مُوَلِّيۡهَا ​ۚ فَاسۡتَبِقُوا الۡخَيۡرٰتِؕ اَيۡنَ مَا تَكُوۡنُوۡا يَاۡتِ بِكُمُ اللّٰهُ جَمِيۡعًا ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَاِنَّهٗ لَـلۡحَقُّ مِنۡ رَّبِّكَؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَڪُمۡ شَطۡرَهٗ ۙ لِئَلَّا يَكُوۡنَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ اِلَّا الَّذِيۡنَ ظَلَمُوۡا مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَاخۡشَوۡنِىۡ وَلِاُتِمَّ نِعۡمَتِىۡ عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُوۡنَ ۙ​ۛ"},{"ar":"كَمَآ اَرۡسَلۡنَا فِيۡکُمۡ رَسُوۡلًا مِّنۡکُمۡ يَتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِنَا وَيُزَكِّيۡکُمۡ وَيُعَلِّمُکُمُ الۡكِتٰبَ وَالۡحِکۡمَةَ وَيُعَلِّمُكُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ ؕ​ۛ"},{"ar":"فَاذۡكُرُوۡنِىۡٓ اَذۡكُرۡكُمۡ وَاشۡکُرُوۡا لِىۡ وَلَا تَكۡفُرُوۡنِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا اسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ؕ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَا تَقُوۡلُوۡا لِمَنۡ يُّقۡتَلُ فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوَاتٌ ؕ بَلۡ اَحۡيَآءٌ وَّلٰـكِنۡ لَّا تَشۡعُرُوۡنَ"},{"ar":"وَلَـنَبۡلُوَنَّكُمۡ بِشَىۡءٍ مِّنَ الۡخَـوۡفِ وَالۡجُـوۡعِ وَنَقۡصٍ مِّنَ الۡاَمۡوَالِ وَالۡاَنۡفُسِ وَالثَّمَرٰتِؕ وَبَشِّرِ الصّٰبِرِيۡنَۙ"},{"ar":"الَّذِيۡنَ اِذَآ اَصَابَتۡهُمۡ مُّصِيۡبَةٌ  ۙ قَالُوۡٓا اِنَّا لِلّٰهِ وَاِنَّـآ اِلَيۡهِ رٰجِعُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلَيۡهِمۡ صَلَوٰتٌ مِّنۡ رَّبِّهِمۡ وَرَحۡمَةٌ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُهۡتَدُوۡنَ"},{"ar":"اِنَّ الصَّفَا وَالۡمَرۡوَةَ مِنۡ شَعَآٮِٕرِ اللّٰهِۚ فَمَنۡ حَجَّ الۡبَيۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ اَنۡ يَّطَّوَّفَ بِهِمَا ؕ وَمَنۡ تَطَوَّعَ خَيۡرًا ۙ فَاِنَّ اللّٰهَ شَاكِرٌ عَلِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلۡنَا مِنَ الۡبَيِّنٰتِ وَالۡهُدٰى مِنۡۢ بَعۡدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِى الۡكِتٰبِۙ اُولٰٓٮِٕكَ يَلۡعَنُهُمُ اللّٰهُ وَ يَلۡعَنُهُمُ اللّٰعِنُوۡنَۙ"},{"ar":"اِلَّا الَّذِيۡنَ تَابُوۡا وَاَصۡلَحُوۡا وَبَيَّـنُوۡا فَاُولٰٓٮِٕكَ اَ تُوۡبُ عَلَيۡهِمۡۚ وَاَنَا التَّوَّابُ الرَّحِيۡمُ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ اُولٰٓٮِٕكَ عَلَيۡهِمۡ لَعۡنَةُ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ"},{"ar":"خٰلِدِيۡنَ فِيۡهَا ۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَ"},{"ar":"وَاِلٰهُكُمۡ اِلٰهٌ وَّاحِدٌ  ۚ لَآ اِلٰهَ اِلَّا هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ"},{"ar":"اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ وَالۡفُلۡكِ الَّتِىۡ تَجۡرِىۡ فِى الۡبَحۡرِ بِمَا يَنۡفَعُ النَّاسَ وَمَآ اَنۡزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡيَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيۡهَا مِنۡ کُلِّ دَآ بَّةٍ وَّتَصۡرِيۡفِ الرِّيٰحِ وَالسَّحَابِ الۡمُسَخَّرِ بَيۡنَ السَّمَآءِ وَالۡاَرۡضِ لَاٰيٰتٍ لِّقَوۡمٍ يَّعۡقِلُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّتَّخِذُ مِنۡ دُوۡنِ اللّٰهِ اَنۡدَادًا يُّحِبُّوۡنَهُمۡ كَحُبِّ اللّٰهِؕ وَالَّذِيۡنَ اٰمَنُوۡٓا اَشَدُّ حُبًّا لِّلّٰهِ ؕ وَلَوۡ يَرَى الَّذِيۡنَ ظَلَمُوۡٓا اِذۡ يَرَوۡنَ الۡعَذَابَۙ اَنَّ الۡقُوَّةَ لِلّٰهِ جَمِيۡعًا ۙ وَّاَنَّ اللّٰهَ شَدِيۡدُ الۡعَذَابِ"},{"ar":"اِذۡ تَبَرَّاَ الَّذِيۡنَ اتُّبِعُوۡا مِنَ الَّذِيۡنَ اتَّبَعُوۡا وَرَاَوُا الۡعَذَابَ وَ تَقَطَّعَتۡ بِهِمُ الۡاَسۡبَابُ"},{"ar":"وَقَالَ الَّذِيۡنَ اتَّبَعُوۡا لَوۡ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنۡهُمۡ كَمَا تَبَرَّءُوۡا مِنَّا ؕ كَذٰلِكَ يُرِيۡهِمُ اللّٰهُ اَعۡمَالَهُمۡ حَسَرٰتٍ عَلَيۡهِمۡؕ وَمَا هُمۡ بِخٰرِجِيۡنَ مِنَ النَّارِ"},{"ar":"يٰٓاَيُّهَا النَّاسُ كُلُوۡا مِمَّا فِى الۡاَرۡضِ حَلٰلًا طَيِّبًا  ۖ وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِؕ اِنَّهٗ لَـكُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"اِنَّمَا يَاۡمُرُكُمۡ بِالسُّوۡٓءِ وَالۡفَحۡشَآءِ وَاَنۡ تَقُوۡلُوۡا عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَـتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَا ؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ کَفَرُوۡا كَمَثَلِ الَّذِىۡ يَنۡعِقُ بِمَا لَا يَسۡمَعُ اِلَّا دُعَآءً وَّنِدَآءً ؕ صُمٌّۢ بُكۡمٌ عُمۡـىٌ فَهُمۡ لَا يَعۡقِلُوۡنَ"},{"ar":"يٰٓاَ يُّهَا الَّذِيۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ وَاشۡكُرُوۡا لِلّٰهِ اِنۡ کُنۡتُمۡ اِيَّاهُ تَعۡبُدُوۡنَ"},{"ar":"اِنَّمَا حَرَّمَ عَلَيۡکُمُ الۡمَيۡتَةَ وَالدَّمَ وَلَحۡمَ الۡخِنۡزِيۡرِ وَمَآ اُهِلَّ بِهٖ لِغَيۡرِ اللّٰهِ​ۚ فَمَنِ اضۡطُرَّ غَيۡرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثۡمَ عَلَيۡهِ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلَ اللّٰهُ مِنَ الۡکِتٰبِ وَ يَشۡتَرُوۡنَ بِهٖ ثَمَنًا قَلِيۡلًا ۙ اُولٰٓٮِٕكَ مَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ اِلَّا النَّارَ وَلَا يُکَلِّمُهُمُ اللّٰهُ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَکِّيۡهِمۡ ۖۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى وَالۡعَذَابَ بِالۡمَغۡفِرَةِ​ ۚ فَمَآ اَصۡبَرَهُمۡ عَلَى النَّارِ"},{"ar":"ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الۡکِتٰبَ بِالۡحَـقِّؕ وَاِنَّ الَّذِيۡنَ اخۡتَلَفُوۡا فِى الۡكِتٰبِ لَفِىۡ شِقَاقٍۢ بَعِيۡدٍ"},{"ar":"لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ​ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِى الرِّقَابِ​ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ ​ ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡا ۚ وَالصّٰبِرِيۡنَ فِى الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡا ؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡكُمُ الۡقِصَاصُ فِى الۡقَتۡلٰى  ؕ الۡحُرُّ بِالۡحُـرِّ وَالۡعَبۡدُ بِالۡعَبۡدِ وَالۡاُنۡثَىٰ بِالۡاُنۡثٰىؕ فَمَنۡ عُفِىَ لَهٗ مِنۡ اَخِيۡهِ شَىۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَاَدَآءٌ اِلَيۡهِ بِاِحۡسَانٍؕ ذٰلِكَ تَخۡفِيۡفٌ مِّنۡ رَّبِّكُمۡ وَرَحۡمَةٌ  ؕ فَمَنِ اعۡتَدٰى بَعۡدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيۡمٌۚ"},{"ar":"وَ لَـكُمۡ فِى الۡقِصَاصِ حَيٰوةٌ يّٰٓـاُولِىۡ الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ"},{"ar":"كُتِبَ عَلَيۡكُمۡ اِذَا حَضَرَ اَحَدَكُمُ الۡمَوۡتُ اِنۡ تَرَكَ خَيۡرَا  ۖۚ اۨلۡوَصِيَّةُ لِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ بِالۡمَعۡرُوۡفِۚ حَقًّا عَلَى الۡمُتَّقِيۡنَؕ"},{"ar":"فَمَنۡۢ بَدَّلَهٗ بَعۡدَمَا سَمِعَهٗ فَاِنَّمَآ اِثۡمُهٗ عَلَى الَّذِيۡنَ يُبَدِّلُوۡنَهٗؕ اِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌؕ"},{"ar":"فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ بَيۡنَهُمۡ فَلَاۤ اِثۡمَ عَلَيۡهِؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يٰٓـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡکُمُ الصِّيَامُ کَمَا كُتِبَ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ"},{"ar":"اَيَّامًا مَّعۡدُوۡدٰتٍؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَ​ؕ وَعَلَى الَّذِيۡنَ يُطِيۡقُوۡنَهٗ فِدۡيَةٌ طَعَامُ مِسۡكِيۡنٍؕ فَمَنۡ تَطَوَّعَ خَيۡرًا فَهُوَ خَيۡرٌ لَّهٗ ؕ وَاَنۡ تَصُوۡمُوۡا خَيۡرٌ لَّـکُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"شَهۡرُ رَمَضَانَ الَّذِىۡٓ اُنۡزِلَ فِيۡهِ الۡقُرۡاٰنُ هُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الۡهُدٰى وَالۡفُرۡقَانِۚ فَمَنۡ شَهِدَ مِنۡكُمُ الشَّهۡرَ فَلۡيَـصُمۡهُ ؕ وَمَنۡ کَانَ مَرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَؕ يُرِيۡدُ اللّٰهُ بِکُمُ الۡيُسۡرَ وَلَا يُرِيۡدُ بِکُمُ الۡعُسۡرَ وَلِتُکۡمِلُوا الۡعِدَّةَ وَلِتُکَبِّرُوا اللّٰهَ عَلٰى مَا هَدٰٮكُمۡ وَلَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذَا سَاَلَـكَ عِبَادِىۡ عَنِّىۡ فَاِنِّىۡ قَرِيۡبٌؕ اُجِيۡبُ دَعۡوَةَ الدَّاعِ اِذَا دَعَانِ فَلۡيَسۡتَجِيۡبُوۡا لِىۡ وَلۡيُؤۡمِنُوۡا بِىۡ لَعَلَّهُمۡ يَرۡشُدُوۡنَ"},{"ar":"اُحِلَّ لَـکُمۡ لَيۡلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَآٮِٕكُمۡ​ؕ هُنَّ لِبَاسٌ لَّـكُمۡ وَاَنۡـتُمۡ لِبَاسٌ لَّهُنَّ ؕ عَلِمَ اللّٰهُ اَنَّکُمۡ كُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنۡكُمۡۚ فَالۡـــٰٔنَ بَاشِرُوۡهُنَّ وَابۡتَغُوۡا مَا کَتَبَ اللّٰهُ لَـكُمۡ وَكُلُوۡا وَاشۡرَبُوۡا حَتّٰى يَتَبَيَّنَ لَـكُمُ الۡخَـيۡطُ الۡاَبۡيَضُ مِنَ الۡخَـيۡطِ الۡاَسۡوَدِ مِنَ الۡفَجۡرِ​ؕ ثُمَّ اَتِمُّوا الصِّيَامَ اِلَى الَّيۡلِ​ۚ وَلَا تُبَاشِرُوۡهُنَّ وَاَنۡـتُمۡ عٰكِفُوۡنَ فِى الۡمَسٰجِدِؕ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَقۡرَبُوۡهَا ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُوۡنَ"},{"ar":"وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُـکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡاَهِلَّةِ ​ؕ قُلۡ هِىَ مَوَاقِيۡتُ لِلنَّاسِ وَالۡحَجِّ ؕ وَلَيۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوا الۡبُيُوۡتَ مِنۡ ظُهُوۡرِهَا وَلٰـكِنَّ الۡبِرَّ مَنِ اتَّقٰى​ۚ وَاۡتُوا الۡبُيُوۡتَ مِنۡ اَبۡوَابِهَا وَاتَّقُوا اللّٰهَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡا ؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ"},{"ar":"وَاقۡتُلُوۡهُمۡ حَيۡثُ ثَقِفۡتُمُوۡهُمۡ وَاَخۡرِجُوۡهُمۡ مِّنۡ حَيۡثُ اَخۡرَجُوۡكُمۡ​ وَالۡفِتۡنَةُ اَشَدُّ مِنَ الۡقَتۡلِۚ وَلَا تُقٰتِلُوۡهُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَـرَامِ حَتّٰى يُقٰتِلُوۡكُمۡ فِيۡهِ​ۚ فَاِنۡ قٰتَلُوۡكُمۡ فَاقۡتُلُوۡهُمۡؕ كَذٰلِكَ جَزَآءُ الۡكٰفِرِيۡنَ"},{"ar":"فَاِنِ انۡـتَهَوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَقٰتِلُوۡهُمۡ حَتّٰى لَا تَكُوۡنَ فِتۡنَةٌ وَّيَكُوۡنَ الدِّيۡنُ لِلّٰهِ​ؕ فَاِنِ انتَهَوۡا فَلَا عُدۡوَانَ اِلَّا عَلَى الظّٰلِمِيۡنَ"},{"ar":"اَلشَّهۡرُ الۡحَـرَامُ بِالشَّهۡرِ الۡحَـرَامِ وَالۡحُرُمٰتُ قِصَاصٌ​ؕ فَمَنِ اعۡتَدٰى عَلَيۡكُمۡ فَاعۡتَدُوۡا عَلَيۡهِ بِمِثۡلِ مَا اعۡتَدٰى عَلَيۡكُمۡ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ مَعَ الۡمُتَّقِيۡنَ"},{"ar":"وَاَنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلَا تُلۡقُوۡا بِاَيۡدِيۡكُمۡ اِلَى التَّهۡلُكَةِ ۖ  ۛۚ وَاَحۡسِنُوۡا  ۛۚ اِنَّ اللّٰهَ يُحِبُّ الۡمُحۡسِنِيۡنَ"},{"ar":"وَاَتِمُّوا الۡحَجَّ وَالۡعُمۡرَةَ لِلّٰهِؕ فَاِنۡ اُحۡصِرۡتُمۡ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ وَلَا تَحۡلِقُوۡا رُءُوۡسَكُمۡ حَتّٰى يَبۡلُغَ الۡهَدۡىُ مَحِلَّهٗ ؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ بِهٖۤ اَذًى مِّنۡ رَّاۡسِهٖ فَفِدۡيَةٌ مِّنۡ صِيَامٍ اَوۡ صَدَقَةٍ اَوۡ نُسُكٍۚ فَاِذَآ اَمِنۡتُمۡ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَةِ اِلَى الۡحَجِّ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِى الۡحَجِّ وَسَبۡعَةٍ اِذَا رَجَعۡتُمۡؕ تِلۡكَ عَشَرَةٌ كَامِلَةٌ  ؕ ذٰ لِكَ لِمَنۡ لَّمۡ يَكُنۡ اَهۡلُهٗ حَاضِرِىۡ الۡمَسۡجِدِ الۡحَـرَامِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"اَلۡحَجُّ اَشۡهُرٌ مَّعۡلُوۡمٰتٌ ​ۚ فَمَنۡ فَرَضَ فِيۡهِنَّ الۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوۡقَۙ وَلَا جِدَالَ فِى الۡحَجِّ ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ يَّعۡلَمۡهُ اللّٰهُ ​ؕ وَتَزَوَّدُوۡا فَاِنَّ خَيۡرَ الزَّادِ التَّقۡوٰى وَاتَّقُوۡنِ يٰٓاُولِى الۡاَلۡبَابِ"},{"ar":"​لَيۡسَ عَلَيۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡؕ فَاِذَآ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوا اللّٰهَ عِنۡدَ الۡمَشۡعَرِ الۡحَـرَامِ وَاذۡکُرُوۡهُ کَمَا هَدٰٮکُمۡ​ۚ وَاِنۡ کُنۡتُمۡ مِّنۡ قَبۡلِهٖ لَمِنَ الضَّآ لِّيۡنَ"},{"ar":"ثُمَّ اَفِيۡضُوۡا مِنۡ حَيۡثُ اَفَاضَ النَّاسُ وَاسۡتَغۡفِرُوا اللّٰهَ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"فَاِذَا قَضَيۡتُمۡ مَّنَاسِكَکُمۡ فَاذۡکُرُوا اللّٰهَ كَذِكۡرِكُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًا ؕ فَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا وَمَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ"},{"ar":"وَمِنۡهُمۡ مَّنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا حَسَنَةً وَّفِى الۡاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ"},{"ar":"اُولٰٓٮِٕكَ لَهُمۡ نَصِيۡبٌ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ سَرِيۡعُ الۡحِسَابِ"},{"ar":"وَاذۡكُرُوا اللّٰهَ فِىۡٓ اَيَّامٍ مَّعۡدُوۡدٰتٍ​ؕ فَمَنۡ تَعَجَّلَ فِىۡ يَوۡمَيۡنِ فَلَاۤ اِثۡمَ عَلَيۡهِ ۚ وَمَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَيۡه​ِ ۙ لِمَنِ اتَّقٰى ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ اِلَيۡهِ تُحۡشَرُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يُّعۡجِبُكَ قَوۡلُهٗ فِى الۡحَيٰوةِ الدُّنۡيَا وَيُشۡهِدُ اللّٰهَ عَلٰى مَا فِىۡ قَلۡبِهٖۙ وَهُوَ اَلَدُّ الۡخِصَامِ"},{"ar":"وَاِذَا تَوَلّٰى سَعٰى فِى الۡاَرۡضِ لِيُفۡسِدَ فِيۡهَا وَيُهۡلِكَ الۡحَـرۡثَ وَالنَّسۡلَ​ؕ وَاللّٰهُ لَا يُحِبُّ الۡفَسَادَ"},{"ar":"وَاِذَا قِيۡلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتۡهُ الۡعِزَّةُ بِالۡاِثۡمِ​ فَحَسۡبُهٗ جَهَنَّمُ​ؕ وَلَبِئۡسَ الۡمِهَادُ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّشۡرِىۡ نَفۡسَهُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ​ؕ وَ اللّٰهُ رَءُوۡفٌ ۢ بِالۡعِبَادِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا ادۡخُلُوۡا فِى السِّلۡمِ کَآفَّةً  وَلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِ​ؕ اِنَّهٗ لَـکُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"فَاِنۡ زَلَـلۡتُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَيِّنٰتُ فَاعۡلَمُوۡٓا اَنَّ اللّٰهَ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"هَلۡ يَنۡظُرُوۡنَ اِلَّاۤ اَنۡ يَّاۡتِيَهُمُ اللّٰهُ فِىۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَالۡمَلٰٓٮِٕکَةُ وَقُضِىَ الۡاَمۡرُ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ"},{"ar":"سَلۡ بَنِىۡٓ اِسۡرَآءِيۡلَ كَمۡ اٰتَيۡنٰهُمۡ مِّنۡ اٰيَةٍۢ بَيِّنَةٍ ​ؕ وَمَنۡ يُّبَدِّلۡ نِعۡمَةَ اللّٰهِ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"زُيِّنَ لِلَّذِيۡنَ كَفَرُوا الۡحَيٰوةُ الدُّنۡيَا وَيَسۡخَرُوۡنَ مِنَ الَّذِيۡنَ اٰمَنُوۡا ​ ۘ وَالَّذِيۡنَ اتَّقَوۡا فَوۡقَهُمۡ يَوۡمَ الۡقِيٰمَةِ ؕ وَاللّٰهُ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ"},{"ar":"كَانَ النَّاسُ اُمَّةً وَّاحِدَةً  فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ وَاَنۡزَلَ مَعَهُمُ الۡكِتٰبَ بِالۡحَـقِّ لِيَحۡكُمَ بَيۡنَ النَّاسِ فِيۡمَا اخۡتَلَفُوۡا فِيۡهِ ​ؕ وَمَا اخۡتَلَفَ فِيۡهِ اِلَّا الَّذِيۡنَ اُوۡتُوۡهُ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ بَغۡيًا ۢ بَيۡنَهُمۡ​ۚ فَهَدَى اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِيۡهِ مِنَ الۡحَـقِّ بِاِذۡنِهٖ​ ؕ وَاللّٰهُ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ"},{"ar":"اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوا الۡجَـنَّةَ وَ لَمَّا يَاۡتِكُمۡ مَّثَلُ الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلِكُمۡؕ مَسَّتۡهُمُ الۡبَاۡسَآءُ وَالضَّرَّآءُ وَزُلۡزِلُوۡا حَتّٰى يَقُوۡلَ الرَّسُوۡلُ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ مَتٰى نَصۡرُ اللّٰهِؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰهِ قَرِيۡبٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَ ؕ قُلۡ مَآ اَنۡفَقۡتُمۡ مِّنۡ خَيۡرٍ فَلِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِ​ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"كُتِبَ عَلَيۡکُمُ الۡقِتَالُ وَهُوَ كُرۡهٌ لَّـكُمۡ​ۚ وَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡـــًٔا وَّهُوَ خَيۡرٌ لَّـکُمۡ​ۚ وَعَسٰۤى اَنۡ تُحِبُّوۡا شَيۡـــًٔا وَّهُوَ شَرٌّ لَّـكُمۡؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الشَّهۡرِ الۡحَـرَامِ قِتَالٍ فِيۡهِ​ؕ قُلۡ قِتَالٌ فِيۡهِ كَبِيۡرٌ ​ؕ وَصَدٌّ عَنۡ سَبِيۡلِ اللّٰهِ وَ کُفۡرٌ ۢ بِهٖ وَالۡمَسۡجِدِ الۡحَـرَامِ وَاِخۡرَاجُ اَهۡلِهٖ مِنۡهُ اَكۡبَرُ عِنۡدَ اللّٰهِ ​​ۚ وَالۡفِتۡنَةُ اَکۡبَرُ مِنَ الۡقَتۡلِ​ؕ وَلَا يَزَالُوۡنَ يُقَاتِلُوۡنَكُمۡ حَتّٰى يَرُدُّوۡكُمۡ عَنۡ دِيۡـنِکُمۡ اِنِ اسۡتَطَاعُوۡا ​ؕ وَمَنۡ يَّرۡتَدِدۡ مِنۡكُمۡ عَنۡ دِيۡـنِهٖ فَيَمُتۡ وَهُوَ کَافِرٌ فَاُولٰٓٮِٕكَ حَبِطَتۡ اَعۡمَالُهُمۡ فِى الدُّنۡيَا وَالۡاٰخِرَةِ ​​ۚ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَاجَرُوۡا وَجَاهَدُوۡا فِىۡ سَبِيۡلِ اللّٰهِۙ اُولٰٓٮِٕكَ يَرۡجُوۡنَ رَحۡمَتَ اللّٰهِؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡخَمۡرِ وَالۡمَيۡسِرِ​ؕ قُلۡ فِيۡهِمَآ اِثۡمٌ کَبِيۡرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثۡمُهُمَآ اَکۡبَرُ مِنۡ نَّفۡعِهِمَا ؕ وَيَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ  قُلِ الۡعَفۡوَ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّکُمۡ تَتَفَكَّرُوۡنَۙ"},{"ar":"فِى الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـــَٔلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌ ؕ وَاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ​ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ​ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"وَلَا تَنۡكِحُوا الۡمُشۡرِكٰتِ حَتّٰى يُؤۡمِنَّ​ؕ وَلَاَمَةٌ مُّؤۡمِنَةٌ خَيۡرٌ مِّنۡ مُّشۡرِكَةٍ وَّلَوۡ اَعۡجَبَتۡكُمۡ​ۚ وَلَا تُنۡكِحُوا الۡمُشۡرِكِيۡنَ حَتّٰى يُؤۡمِنُوۡا ​ؕ وَلَعَبۡدٌ مُّؤۡمِنٌ خَيۡرٌ مِّنۡ مُّشۡرِكٍ وَّلَوۡ اَعۡجَبَكُمۡؕ اُولٰٓٮِٕكَ يَدۡعُوۡنَ اِلَى النَّارِ  ۖۚ وَاللّٰهُ يَدۡعُوۡٓا اِلَى الۡجَـنَّةِ وَالۡمَغۡفِرَةِ بِاِذۡنِهٖ​ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ "},{"ar":"وَ يَسۡـــَٔلُوۡنَكَ عَنِ الۡمَحِيۡضِ​ۙ قُلۡ هُوَ اَذًى فَاعۡتَزِلُوۡا النِّسَآءَ فِى الۡمَحِيۡضِ​ۙ وَلَا تَقۡرَبُوۡهُنَّ حَتّٰى يَطۡهُرۡنَ​​ۚ فَاِذَا تَطَهَّرۡنَ فَاۡتُوۡهُنَّ مِنۡ حَيۡثُ اَمَرَكُمُ اللّٰهُ​ؕ اِنَّ اللّٰهَ يُحِبُّ التَّوَّابِيۡنَ وَيُحِبُّ الۡمُتَطَهِّرِيۡنَ"},{"ar":"نِسَآؤُكُمۡ حَرۡثٌ لَّـكُمۡ فَاۡتُوۡا حَرۡثَكُمۡ اَنّٰى شِئۡتُمۡ​  وَقَدِّمُوۡا لِاَنۡفُسِكُمۡ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ مُّلٰقُوۡهُ ​ؕ وَ بَشِّرِ الۡمُؤۡمِنِيۡنَ"},{"ar":"وَلَا تَجۡعَلُوا اللّٰهَ عُرۡضَةً لِّاَيۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَتَتَّقُوۡا وَتُصۡلِحُوۡا بَيۡنَ النَّاسِ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغۡوِ فِىۡٓ اَيۡمَانِكُمۡ وَلٰـكِنۡ يُّؤَاخِذُكُمۡ بِمَا كَسَبَتۡ قُلُوۡبُكُمۡ​ؕ وَاللّٰهُ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لِّـلَّذِيۡنَ يُؤۡلُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ تَرَبُّصُ اَرۡبَعَةِ اَشۡهُرٍ​​ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَاِنۡ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"وَالۡمُطَلَّقٰتُ يَتَرَ بَّصۡنَ بِاَنۡفُسِهِنَّ ثَلٰثَةَ قُرُوۡٓءٍ ​ؕ وَلَا يَحِلُّ لَهُنَّ اَنۡ يَّكۡتُمۡنَ مَا خَلَقَ اللّٰهُ فِىۡٓ اَرۡحَامِهِنَّ اِنۡ كُنَّ يُؤۡمِنَّ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ وَبُعُوۡلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِىۡ ذٰ لِكَ اِنۡ اَرَادُوۡٓا اِصۡلَاحًا ​ؕ وَلَهُنَّ مِثۡلُ الَّذِىۡ عَلَيۡهِنَّ بِالۡمَعۡرُوۡفِ​ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٌ ​ ؕ وَاللّٰهُ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"اَلطَّلَاقُ مَرَّتٰنِ​ فَاِمۡسَاكٌ ۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِيۡحٌ ۢ بِاِحۡسَانٍ​ ؕوَلَا يَحِلُّ لَـکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّآ اٰتَيۡتُمُوۡهُنَّ شَيۡـــًٔا اِلَّاۤ اَنۡ يَّخَافَآ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ فَاِنۡ خِفۡتُمۡ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِۙ فَلَا جُنَاحَ عَلَيۡهِمَا فِيۡمَا افۡتَدَتۡ بِهٖؕ​ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَعۡتَدُوۡهَا ​ۚ​ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"فَاِنۡ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنۡۢ بَعۡدُ حَتّٰى تَنۡكِحَ زَوۡجًا غَيۡرَهٗ ​ؕ فَاِنۡ طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ اَنۡ يَّتَرَاجَعَآ اِنۡ ظَنَّآ اَنۡ يُّقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ يُبَيِّنُهَا لِقَوۡمٍ يَّعۡلَمُوۡنَ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡهُنَّ بِمَعۡرُوۡفٍ​ وَلَا تُمۡسِكُوۡهُنَّ ضِرَارًا لِّتَعۡتَدُوۡا​ ۚ وَمَنۡ يَّفۡعَلۡ ذٰ لِكَ فَقَدۡ ظَلَمَ نَفۡسَهٗ ​ؕ وَلَا تَتَّخِذُوۡٓا اٰيٰتِ اللّٰهِ هُزُوًا​ وَّاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ وَمَآ اَنۡزَلَ عَلَيۡكُمۡ مِّنَ الۡكِتٰبِ وَالۡحِكۡمَةِ يَعِظُكُمۡ بِهٖ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَلَا تَعۡضُلُوۡهُنَّ اَنۡ يَّنۡكِحۡنَ اَزۡوَاجَهُنَّ اِذَا تَرَاضَوۡا بَيۡنَهُمۡ بِالۡمَعۡرُوۡفِ​ؕ ذٰ لِكَ يُوۡعَظُ بِهٖ مَنۡ كَانَ مِنۡكُمۡ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِؕ ذٰ لِكُمۡ اَزۡکٰى لَـكُمۡ وَاَطۡهَرُؕ​ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"وَالۡوَالِدٰتُ يُرۡضِعۡنَ اَوۡلَادَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِ​ لِمَنۡ اَرَادَ اَنۡ يُّتِمَّ الرَّضَاعَةَ ​ ؕ وَعَلَى الۡمَوۡلُوۡدِ لَهٗ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِالۡمَعۡرُوۡفِ​ؕ لَا تُكَلَّفُ نَفۡسٌ اِلَّا وُسۡعَهَا ۚ لَا تُضَآرَّ وَالِدَةٌ ۢ بِوَلَدِهَا وَلَا مَوۡلُوۡدٌ لَّهٗ بِوَلَدِهٖ وَعَلَى الۡوَارِثِ مِثۡلُ ذٰ لِكَ ۚ فَاِنۡ اَرَادَا فِصَالًا عَنۡ تَرَاضٍ مِّنۡهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيۡهِمَا ​ؕ وَاِنۡ اَرَدْتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡٓا اَوۡلَادَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ اِذَا سَلَّمۡتُمۡ مَّآ اٰتَيۡتُمۡ بِالۡمَعۡرُوۡفِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡكُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا يَّتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ اَرۡبَعَةَ اَشۡهُرٍ وَّعَشۡرًا ​​ۚ فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ بِالۡمَعۡرُوۡفِؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"وَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا عَرَّضۡتُمۡ بِهٖ مِنۡ خِطۡبَةِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِىۡٓ اَنۡفُسِكُمۡ​ؕ عَلِمَ اللّٰهُ اَنَّكُمۡ سَتَذۡكُرُوۡنَهُنَّ وَلٰـكِنۡ لَّا تُوَاعِدُوۡهُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلًا مَّعۡرُوۡفًا ​ؕ وَلَا تَعۡزِمُوۡا عُقۡدَةَ النِّکَاحِ حَتّٰى يَبۡلُغَ الۡكِتٰبُ اَجَلَهٗ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ يَعۡلَمُ مَا فِىۡٓ اَنۡفُسِكُمۡ فَاحۡذَرُوۡهُ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لَا جُنَاحَ عَلَيۡكُمۡ اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡهُنَّ اَوۡ تَفۡرِضُوۡا لَهُنَّ فَرِيۡضَةً  ۖۚ وَّمَتِّعُوۡهُنَّ ​ۚ عَلَى الۡمُوۡسِعِ قَدَرُهٗ وَ عَلَى الۡمُقۡتِرِ قَدَرُهٗ ​ۚ مَتَاعًا ۢ بِالۡمَعۡرُوۡفِ​​ۚ حَقًّا عَلَى الۡمُحۡسِنِيۡنَ"},{"ar":"وَاِنۡ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيۡضَةً فَنِصۡفُ مَا فَرَضۡتُمۡ اِلَّاۤ اَنۡ يَّعۡفُوۡنَ اَوۡ يَعۡفُوَا الَّذِىۡ بِيَدِهٖ عُقۡدَةُ النِّكَاحِ ​ؕ وَاَنۡ تَعۡفُوۡٓا اَقۡرَبُ لِلتَّقۡوٰى​ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَيۡنَكُمۡ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"حَافِظُوۡا عَلَى الصَّلَوٰتِ وَالصَّلٰوةِ الۡوُسۡطٰى وَقُوۡمُوۡا لِلّٰهِ قٰنِتِيۡنَ"},{"ar":"فَاِنۡ خِفۡتُمۡ فَرِجَالًا اَوۡ رُكۡبَانًا ​​ ۚ فَاِذَآ اَمِنۡتُمۡ فَاذۡکُرُوا اللّٰهَ کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡکُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا  ۖۚ وَّصِيَّةً لِّاَزۡوَاجِهِمۡ مَّتَاعًا اِلَى الۡحَـوۡلِ غَيۡرَ اِخۡرَاجٍ​​ ۚ فَاِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡکُمۡ فِىۡ مَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ مِنۡ مَّعۡرُوۡفٍؕ وَاللّٰهُ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"وَلِلۡمُطَلَّقٰتِ مَتَاعٌ ۢ بِالۡمَعۡرُوۡفِ ​ؕ حَقًّا عَلَى الۡمُتَّقِيۡنَ"},{"ar":"كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِيۡنَ خَرَجُوۡا مِنۡ دِيَارِهِمۡ وَهُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ فَقَالَ لَهُمُ اللّٰهُ مُوۡتُوۡا ثُمَّ اَحۡيَاھُمۡ​ؕ اِنَّ اللّٰهَ لَذُوۡ فَضۡلٍ عَلَى النَّاسِ وَلٰـكِنَّ اَکۡثَرَ النَّاسِ لَا يَشۡکُرُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضۡعَافًا کَثِيۡرَةً  ​ؕ وَاللّٰهُ يَقۡبِضُ وَيَبۡصُۜطُ وَ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الۡمَلَاِ مِنۡۢ بَنِىۡٓ اِسۡرَآءِيۡلَ مِنۡۢ بَعۡدِ مُوۡسٰى​ۘ اِذۡ قَالُوۡا لِنَبِىٍّ لَّهُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِىۡ سَبِيۡلِ اللّٰهِ​ؕ قَالَ هَلۡ عَسَيۡتُمۡ اِنۡ کُتِبَ عَلَيۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡا ؕ قَالُوۡا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِىۡ سَبِيۡلِ اللّٰهِ وَقَدۡ اُخۡرِجۡنَا مِنۡ دِيَارِنَا وَاَبۡنَآٮِٕنَا ​ؕ فَلَمَّا کُتِبَ عَلَيۡهِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا ​ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ​ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِى الۡعِلۡمِ وَ الۡجِسۡمِ​ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اٰيَةَ مُلۡکِهٖۤ اَنۡ يَّاۡتِيَکُمُ التَّابُوۡتُ فِيۡهِ سَکِيۡنَةٌ مِّنۡ رَّبِّکُمۡ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوۡسٰى وَاٰلُ هٰرُوۡنَ تَحۡمِلُهُ الۡمَلٰٓٮِٕكَةُ​ ؕ اِنَّ فِىۡ ذٰلِكَ لَاٰيَةً لَّـکُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُـنُوۡدِۙ قَالَ اِنَّ اللّٰهَ مُبۡتَلِيۡکُمۡ بِنَهَرٍ​ۚ فَمَنۡ شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّىۡ​ۚ وَمَنۡ لَّمۡ يَطۡعَمۡهُ فَاِنَّهٗ مِنِّىۡٓ اِلَّا مَنِ اغۡتَرَفَ غُرۡفَةً ۢ بِيَدِهٖ​​ۚ فَشَرِبُوۡا مِنۡهُ اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ ۙ قَالُوۡا لَا طَاقَةَ لَنَا الۡيَوۡمَ بِجَالُوۡتَ وَجُنُوۡدِهٖ​ؕ قَالَ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوا اللّٰهِۙ کَمۡ مِّنۡ فِئَةٍ قَلِيۡلَةٍ غَلَبَتۡ فِئَةً کَثِيۡرَةً ۢ بِاِذۡنِ اللّٰهِ​ؕ وَاللّٰهُ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَمَّا بَرَزُوۡا لِجَـالُوۡتَ وَجُنُوۡدِهٖ قَالُوۡا رَبَّنَآ اَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَّثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡکٰفِرِيۡنَؕ"},{"ar":"فَهَزَمُوۡهُمۡ بِاِذۡنِ اللّٰهِ ۙ وَقَتَلَ دَاوٗدُ جَالُوۡتَ وَاٰتٰٮهُ اللّٰهُ الۡمُلۡكَ وَالۡحِکۡمَةَ وَعَلَّمَهٗ مِمَّا يَشَآءُ ​ؕ وَلَوۡلَا دَفۡعُ اللّٰهِ النَّاسَ بَعۡضَهُمۡ بِبَعۡضٍ لَّفَسَدَتِ الۡاَرۡضُ وَلٰـکِنَّ اللّٰهَ ذُوۡ فَضۡلٍ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ​ؕ وَاِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَ"},{"ar":"تِلۡكَ الرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلٰى بَعۡضٍ​ۘ مِنۡهُمۡ مَّنۡ كَلَّمَ اللّٰهُ​ وَرَفَعَ بَعۡضَهُمۡ دَرَجٰتٍ​ؕ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلَ الَّذِيۡنَ مِنۡۢ بَعۡدِهِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ وَلٰـكِنِ اخۡتَلَفُوۡا فَمِنۡهُمۡ مَّنۡ اٰمَنَ وَمِنۡهُمۡ مَّنۡ كَفَرَ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلُوۡا وَلٰـكِنَّ اللّٰهَ يَفۡعَلُ مَا يُرِيۡدُ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ يَوۡمٌ لَّا بَيۡعٌ فِيۡهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ ​ ؕ وَالۡكٰفِرُوۡنَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ​ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ​ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ​ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ​​ۚ وَلَا يَـــُٔوۡدُهٗ حِفۡظُهُمَا ​ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ"},{"ar":"لَاۤ اِكۡرَاهَ فِى الدِّيۡنِ​ۙ  قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ​ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا​​ ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"اَللّٰهُ وَلِىُّ الَّذِيۡنَ اٰمَنُوۡا يُخۡرِجُهُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ  وَالَّذِيۡنَ كَفَرُوۡۤا اَوۡلِيٰٓـــُٔهُمُ الطَّاغُوۡتُۙ يُخۡرِجُوۡنَهُمۡ مِّنَ النُّوۡرِ اِلَى الظُّلُمٰتِ​ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِىۡ حَآجَّ اِبۡرٰهٖمَ فِىۡ رَبِّهٖۤ اَنۡ اٰتٰٮهُ اللّٰهُ الۡمُلۡكَ​ۘ اِذۡ قَالَ اِبۡرٰهٖمُ رَبِّىَ الَّذِىۡ يُحۡىٖ وَيُمِيۡتُۙ قَالَ اَنَا اُحۡىٖ وَاُمِيۡتُ​ؕ قَالَ اِبۡرٰهٖمُ فَاِنَّ اللّٰهَ يَاۡتِىۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِهَا مِنَ الۡمَغۡرِبِ فَبُهِتَ الَّذِىۡ كَفَرَ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ​ۚ"},{"ar":"اَوۡ كَالَّذِىۡ مَرَّ عَلٰى قَرۡيَةٍ وَّ هِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا ​ۚ قَالَ اَنّٰى يُحۡىٖ هٰذِهِ اللّٰهُ بَعۡدَ مَوۡتِهَا ​ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ ​ؕ قَالَ كَمۡ لَبِثۡتَ​ؕ قَالَ لَبِثۡتُ يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ​ؕ قَالَ بَلۡ لَّبِثۡتَ مِائَةَ عَامٍ فَانۡظُرۡ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡ​ۚ وَانْظُرۡ اِلٰى حِمَارِكَ وَلِنَجۡعَلَكَ اٰيَةً لِّلنَّاسِ​ وَانْظُرۡ اِلَى الۡعِظَامِ كَيۡفَ نُـنۡشِزُهَا ثُمَّ نَكۡسُوۡهَا لَحۡمًا ​ؕ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اَرِنِىۡ كَيۡفَ تُحۡىِ الۡمَوۡتٰى ؕ قَالَ اَوَلَمۡ تُؤۡمِنۡ​ؕ قَالَ بَلٰى وَلٰـكِنۡ لِّيَطۡمَٮِٕنَّ قَلۡبِىۡ​ؕ قَالَ فَخُذۡ اَرۡبَعَةً مِّنَ الطَّيۡرِ فَصُرۡهُنَّ اِلَيۡكَ ثُمَّ اجۡعَلۡ عَلٰى كُلِّ جَبَلٍ مِّنۡهُنَّ جُزۡءًا ثُمَّ ادۡعُهُنَّ يَاۡتِيۡنَكَ سَعۡيًا ​ؕ وَاعۡلَمۡ اَنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ​ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى​ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى​ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا ​ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡـكٰفِرِيۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ​ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"اَيَوَدُّ اَحَدُكُمۡ اَنۡ تَكُوۡنَ لَهٗ جَنَّةٌ مِّنۡ نَّخِيۡلٍ وَّاَعۡنَابٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُۙ لَهٗ فِيۡهَا مِنۡ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الۡكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَآءُ ۖۚ فَاَصَابَهَاۤ اِعۡصَارٌ فِيۡهِ نَارٌ فَاحۡتَرَقَتۡ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَتَفَكَّرُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَيِّبٰتِ مَا كَسَبۡتُمۡ وَمِمَّاۤ اَخۡرَجۡنَا لَـكُمۡ مِّنَ الۡاَرۡضِ وَلَا تَيَمَّمُوا الۡخَبِيۡثَ مِنۡهُ تُنۡفِقُوۡنَ وَلَسۡتُمۡ بِاٰخِذِيۡهِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِيۡهِ​ؕ وَاعۡلَمُوۡۤا اَنَّ اللّٰهَ غَنِىٌّ حَمِيۡدٌ"},{"ar":"اَلشَّيۡطٰنُ يَعِدُكُمُ الۡـفَقۡرَ وَيَاۡمُرُكُمۡ بِالۡفَحۡشَآءِ​ ۚ وَاللّٰهُ يَعِدُكُمۡ مَّغۡفِرَةً مِّنۡهُ وَفَضۡلًا ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌۚ  ۙۖ"},{"ar":"يُؤۡتِى الۡحِكۡمَةَ مَنۡ يَّشَآءُ​​ ۚ وَمَنۡ يُّؤۡتَ الۡحِكۡمَةَ فَقَدۡ اُوۡتِىَ خَيۡرًا كَثِيۡرًا​ ؕ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ"},{"ar":"وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗ ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ"},{"ar":"اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ​ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ​ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ​ ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ​ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡـتُمۡ لَا تُظۡلَمُوۡنَ"},{"ar":"لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِى الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ​ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ​ۚ لَا يَسۡـــَٔلُوۡنَ النَّاسَ اِلۡحَــافًا ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"اَلَّذِيۡنَ يَاۡكُلُوۡنَ الرِّبٰوا لَا يَقُوۡمُوۡنَ اِلَّا كَمَا يَقُوۡمُ الَّذِىۡ يَتَخَبَّطُهُ الشَّيۡطٰنُ مِنَ الۡمَسِّ​ؕ ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡۤا اِنَّمَا الۡبَيۡعُ مِثۡلُ الرِّبٰوا​ ۘ​ وَاَحَلَّ اللّٰهُ الۡبَيۡعَ وَحَرَّمَ الرِّبٰوا​ ؕ فَمَنۡ جَآءَهٗ مَوۡعِظَةٌ مِّنۡ رَّبِّهٖ فَانۡتَهٰى فَلَهٗ مَا سَلَفَؕ وَاَمۡرُهٗۤ اِلَى اللّٰهِ​ؕ وَمَنۡ عَادَ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِى الصَّدَقٰتِ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوۡا مَا بَقِىَ مِنَ الرِّبٰٓوا اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰهِ وَرَسُوۡلِهٖ​ۚ وَاِنۡ تُبۡتُمۡ فَلَـكُمۡ رُءُوۡسُ اَمۡوَالِكُمۡ​ۚ لَا تَظۡلِمُوۡنَ وَلَا تُظۡلَمُوۡنَ"},{"ar":"وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ ​ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ​ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا تُرۡجَعُوۡنَ فِيۡهِ اِلَى اللّٰهِ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَدَايَنۡتُمۡ بِدَيۡنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكۡتُبُوۡهُ ​ؕ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبٌۢ بِالۡعَدۡلِ​ وَلَا يَاۡبَ كَاتِبٌ اَنۡ يَّكۡتُبَ كَمَا عَلَّمَهُ اللّٰهُ​ فَلۡيَكۡتُبۡ ​ۚوَلۡيُمۡلِلِ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـــًٔا ​ؕ فَاِنۡ كَانَ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ سَفِيۡهًا اَوۡ ضَعِيۡفًا اَوۡ لَا يَسۡتَطِيۡعُ اَنۡ يُّمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهٗ بِالۡعَدۡلِ​ؕ وَاسۡتَشۡهِدُوۡا شَهِيۡدَيۡنِ مِنۡ رِّجَالِكُمۡ​ۚ فَاِنۡ لَّمۡ يَكُوۡنَا رَجُلَيۡنِ فَرَجُلٌ وَّامۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّهَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮهُمَا فَتُذَكِّرَ اِحۡدٰٮهُمَا الۡاُخۡرٰى​ؕ وَ لَا يَاۡبَ الشُّهَدَآءُ اِذَا مَا دُعُوۡا ​ؕ وَلَا تَسۡـــَٔمُوۡۤا اَنۡ تَكۡتُبُوۡهُ صَغِيۡرًا اَوۡ كَبِيۡرًا اِلٰٓى اَجَلِهٖ​ؕ ذٰ لِكُمۡ اَقۡسَطُ عِنۡدَ اللّٰهِ وَاَقۡوَمُ لِلشَّهَادَةِ وَاَدۡنٰۤى اَلَّا تَرۡتَابُوۡٓا اِلَّاۤ اَنۡ تَكُوۡنَ تِجَارَةً حَاضِرَةً تُدِيۡرُوۡنَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ اَلَّا تَكۡتُبُوۡهَا ​ؕ وَاَشۡهِدُوۡۤا اِذَا تَبَايَعۡتُمۡ وَلَا يُضَآرَّ كَاتِبٌ وَّلَا شَهِيۡدٌ  ؕ وَاِنۡ تَفۡعَلُوۡا فَاِنَّهٗ فُسُوۡقٌ ۢ بِكُمۡ ؕ وَ اتَّقُوا اللّٰهَ​ ؕ وَيُعَلِّمُكُمُ اللّٰهُ​ ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِنۡ كُنۡتُمۡ عَلٰى سَفَرٍ وَّلَمۡ تَجِدُوۡا كَاتِبًا فَرِهٰنٌ مَّقۡبُوۡضَةٌ ​ ؕ فَاِنۡ اَمِنَ بَعۡضُكُمۡ بَعۡضًا فَلۡيُؤَدِّ الَّذِى اؤۡتُمِنَ اَمَانَـتَهٗ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ​ؕ وَلَا تَكۡتُمُوا الشَّهَادَةَ ​ ؕ وَمَنۡ يَّكۡتُمۡهَا فَاِنَّهٗۤ اٰثِمٌ قَلۡبُهٗ​ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ عَلِيۡمٌ"},{"ar":"لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ وَاِنۡ تُبۡدُوۡا مَا فِىۡۤ اَنۡفُسِكُمۡ اَوۡ تُخۡفُوۡهُ يُحَاسِبۡكُمۡ بِهِ اللّٰهُ​ؕ فَيَـغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ​ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓٮِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ​ وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا​ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ"},{"ar":"لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ​ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ​ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ​ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ​​ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ​ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ"}]}};
const DEFAULT_QURAN_UTHMANI = {"baqarah":{"id":"baqarah","surahNum":2,"nameAr":"سُورَةُ ٱلْبَقَرَةِ","nameTa":"அல்-பகரா","nameEn":"Al-Baqarah","ayat":[{"ar":"الٓمّٓۚ"},{"ar":"ذٰلِكَ الۡڪِتٰبُ لَا رَيۡبَۛۚۖ فِيۡهِۛۚ هُدًى لِّلۡمُتَّقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَۙ"},{"ar":"وَالَّذِيۡنَ يُؤۡمِنُوۡنَ بِمَۤا اُنۡزِلَ اِلَيۡكَ وَمَاۤ اُنۡزِلَ مِنۡ قَبۡلِكَۚ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلٰى هُدًى مِّنۡ رَّبِّهِمۡ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا سَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"خَتَمَ اللّٰهُ عَلَىٰ قُلُوۡبِهِمۡ وَعَلٰى سَمۡعِهِمۡ​ؕ وَعَلٰىٓ اَبۡصَارِهِمۡ غِشَاوَةٌ  وَّلَهُمۡ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ اٰمَنَّا بِاللّٰهِ وَبِالۡيَوۡمِ الۡاٰخِرِ وَمَا هُمۡ بِمُؤۡمِنِيۡنَ​ۘ"},{"ar":"يُخٰدِعُوۡنَ اللّٰهَ وَالَّذِيۡنَ اٰمَنُوۡا ​ۚ وَمَا يَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَؕ"},{"ar":"فِىۡ قُلُوۡبِهِمۡ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًا ​ۚ وَّلَهُمۡ عَذَابٌ اَلِيۡمٌۙۢبِمَا كَانُوۡا يَكۡذِبُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ لَا تُفۡسِدُوۡا فِىۡ الۡاَرۡضِۙ قَالُوۡاۤ اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ"},{"ar":"اَلَا ۤ اِنَّهُمۡ هُمُ الۡمُفۡسِدُوۡنَ وَلٰـكِنۡ لَّا يَشۡعُرُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا كَمَاۤ اٰمَنَ النَّاسُ قَالُوۡاۤ اَنُؤۡمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُ​ ؕ اَلَاۤ اِنَّهُمۡ هُمُ السُّفَهَآءُ وَلٰـكِنۡ لَّا يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡاۤ اٰمَنَّا ۖۚ وَاِذَا خَلَوۡا اِلٰى شَيٰطِيۡنِهِمۡۙ قَالُوۡاۤ اِنَّا مَعَكُمۡۙ اِنَّمَا نَحۡنُ مُسۡتَهۡزِءُوۡنَ"},{"ar":"اَللّٰهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِىۡ طُغۡيَانِهِمۡ يَعۡمَهُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى فَمَا رَبِحَتۡ تِّجَارَتُهُمۡ وَمَا كَانُوۡا مُهۡتَدِيۡنَ"},{"ar":"مَثَلُهُمۡ كَمَثَلِ الَّذِى اسۡتَوۡقَدَ نَارًا ​ۚ فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَهٗ ذَهَبَ اللّٰهُ بِنُوۡرِهِمۡ وَتَرَكَهُمۡ فِىۡ ظُلُمٰتٍ لَّا يُبۡصِرُوۡنَ"},{"ar":"صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَرۡجِعُوۡنَ ۙ"},{"ar":"اَوۡ كَصَيِّبٍ مِّنَ السَّمَآءِ فِيۡهِ ظُلُمٰتٌ وَّرَعۡدٌ وَّبَرۡقٌ​ ۚ يَجۡعَلُوۡنَ اَصَابِعَهُمۡ فِىۡۤ اٰذَانِهِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ​ؕ وَاللّٰهُ مُحِيۡطٌ​ۢ بِالۡكٰفِرِيۡنَ"},{"ar":"يَكَادُ الۡبَرۡقُ يَخۡطَفُ اَبۡصَارَهُمۡ​ؕ كُلَّمَاۤ اَضَآءَ لَهُمۡ مَّشَوۡا فِيۡهِۙ وَاِذَاۤ اَظۡلَمَ عَلَيۡهِمۡ قَامُوۡا​ؕ وَلَوۡ شَآءَ اللّٰهُ لَذَهَبَ بِسَمۡعِهِمۡ وَاَبۡصَارِهِمۡ​ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"يٰۤاَيُّهَا النَّاسُ اعۡبُدُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ وَالَّذِيۡنَ مِنۡ قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَ ۙ"},{"ar":"الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّـكُمۡ​ۚ فَلَا تَجۡعَلُوۡا لِلّٰهِ اَنۡدَادًا وَّاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاِنۡ کُنۡتُمۡ فِىۡ رَيۡبٍ مِّمَّا نَزَّلۡنَا عَلٰى عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَةٍ مِّنۡ مِّثۡلِهٖ وَادۡعُوۡا شُهَدَآءَكُمۡ مِّنۡ دُوۡنِ اللّٰهِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَلَنۡ تَفۡعَلُوۡا فَاتَّقُوۡا النَّارَ الَّتِىۡ وَقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُ  ۖۚ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ"},{"ar":"وَبَشِّرِ الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ؕ ڪُلَّمَا رُزِقُوۡا مِنۡهَا مِنۡ ثَمَرَةٍ رِّزۡقًا ​ۙ قَالُوۡا هٰذَا الَّذِىۡ رُزِقۡنَا مِنۡ قَبۡلُ وَاُتُوۡا بِهٖ مُتَشَابِهًا ​ؕ وَلَهُمۡ فِيۡهَآ اَزۡوَاجٌ مُّطَهَّرَةٌ ​ۙ وَّهُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ اللّٰهَ لَا يَسۡتَحۡـىٖۤ اَنۡ يَّضۡرِبَ مَثَلًا مَّا ​بَعُوۡضَةً فَمَا فَوۡقَهَا ​ؕ فَاَمَّا ​الَّذِيۡنَ اٰمَنُوۡا فَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ۚ وَاَمَّا الَّذِيۡنَ ڪَفَرُوۡا فَيَقُوۡلُوۡنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۘ يُضِلُّ بِهٖ ڪَثِيۡرًا وَّيَهۡدِىۡ بِهٖ كَثِيۡرًا ​ؕ وَمَا يُضِلُّ بِهٖۤ اِلَّا الۡفٰسِقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَنۡقُضُوۡنَ عَهۡدَ اللّٰهِ مِنۡۢ بَعۡدِ مِيۡثَاقِهٖ وَيَقۡطَعُوۡنَ مَآ اَمَرَ اللّٰهُ بِهٖۤ اَنۡ يُّوۡصَلَ وَيُفۡسِدُوۡنَ فِى الۡاَرۡضِ​ؕ اُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"كَيۡفَ تَكۡفُرُوۡنَ بِاللّٰهِ وَڪُنۡتُمۡ اَمۡوَاتًا فَاَحۡيَاکُمۡ​ۚ ثُمَّ يُمِيۡتُكُمۡ ثُمَّ يُحۡيِيۡكُمۡ ثُمَّ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"هُوَ الَّذِىۡ خَلَقَ لَـكُمۡ مَّا فِى الۡاَرۡضِ جَمِيۡعًا ثُمَّ اسۡتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰٮهُنَّ سَبۡعَ سَمٰوٰتٍ​ؕ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذۡ قَالَ رَبُّكَ لِلۡمَلٰٓٮِٕكَةِ اِنِّىۡ جَاعِلٌ فِى الۡاَرۡضِ خَلِيۡفَةً ؕ قَالُوۡٓا اَتَجۡعَلُ فِيۡهَا مَنۡ يُّفۡسِدُ فِيۡهَا وَيَسۡفِكُ الدِّمَآءَۚ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَـكَ​ؕ قَالَ اِنِّىۡٓ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَعَلَّمَ اٰدَمَ الۡاَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى الۡمَلٰٓٮِٕكَةِ فَقَالَ اَنۡۢبِــُٔوۡنِىۡ بِاَسۡمَآءِ هٰٓؤُلَآءِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"قَالُوۡا سُبۡحٰنَكَ لَا عِلۡمَ لَنَآ اِلَّا مَا عَلَّمۡتَنَا ؕ اِنَّكَ اَنۡتَ الۡعَلِيۡمُ الۡحَكِيۡمُ"},{"ar":"قَالَ يٰٓـاٰدَمُ اَنۡۢبِئۡهُمۡ بِاَسۡمَآٮِٕهِمۡ​ۚ فَلَمَّآ اَنۡۢبَاَهُمۡ بِاَسۡمَآٮِٕهِمۡۙ قَالَ اَلَمۡ اَقُل لَّـكُمۡ اِنِّىۡٓ اَعۡلَمُ غَيۡبَ السَّمٰوٰتِ وَالۡاَرۡضِۙ وَاَعۡلَمُ مَا تُبۡدُوۡنَ وَمَا كُنۡتُمۡ تَكۡتُمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا لِلۡمَلٰٓٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡٓا اِلَّاۤ اِبۡلِيۡسَؕ اَبٰى وَاسۡتَكۡبَرَ  وَكَانَ مِنَ الۡكٰفِرِيۡنَ"},{"ar":"وَقُلۡنَا يٰٓـاٰدَمُ اسۡكُنۡ اَنۡتَ وَزَوۡجُكَ الۡجَـنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوۡنَا مِنَ الظّٰلِمِيۡنَ"},{"ar":"فَاَزَلَّهُمَا الشَّيۡطٰنُ عَنۡهَا فَاَخۡرَجَهُمَا مِمَّا كَانَا فِيۡهِ​ وَقُلۡنَا اهۡبِطُوۡا بَعۡضُكُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَلَـكُمۡ فِى الۡاَرۡضِ مُسۡتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيۡنٍ"},{"ar":"فَتَلَقّٰٓى اٰدَمُ مِنۡ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيۡهِ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"قُلۡنَا اهۡبِطُوۡا مِنۡهَا جَمِيۡعًا ​​ۚ فَاِمَّا يَاۡتِيَنَّكُمۡ مِّنِّىۡ هُدًى فَمَنۡ تَبِعَ هُدَاىَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِـاٰيٰتِنَآ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَوۡفُوۡا بِعَهۡدِىۡٓ اُوۡفِ بِعَهۡدِكُمۡۚ وَاِيَّاىَ فَارۡهَبُوۡنِ"},{"ar":"وَاٰمِنُوۡا بِمَآ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَكُمۡ وَلَا تَكُوۡنُوۡآ اَوَّلَ كَافِرٍۢ بِهٖ​ وَلَا تَشۡتَرُوۡا بِاٰيٰتِىۡ ثَمَنًا قَلِيۡلًا وَّاِيَّاىَ فَاتَّقُوۡنِ"},{"ar":"وَلَا تَلۡبِسُوا الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوا الۡحَـقَّ وَاَنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارۡكَعُوۡا مَعَ الرّٰكِعِيۡنَ"},{"ar":"اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"وَاسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ​ؕ وَاِنَّهَا لَكَبِيۡرَةٌ اِلَّا عَلَى الۡخٰشِعِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا رَبِّهِمۡ وَاَنَّهُمۡ اِلَيۡهِ رٰجِعُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا شَفَاعَةٌ وَّلَا يُؤۡخَذُ مِنۡهَا عَدۡلٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذۡ نَجَّيۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ يَسُوۡمُوۡنَكُمۡ سُوۡٓءَ الۡعَذَابِ يُذَبِّحُوۡنَ اَبۡنَآءَكُمۡ وَيَسۡتَحۡيُوۡنَ نِسَآءَكُمۡ​ؕ وَفِىۡ ذٰلِكُمۡ بَلَاۤءٌ مِّنۡ رَّبِّكُمۡ عَظِيۡمٌ"},{"ar":"وَاِذۡ فَرَقۡنَا بِكُمُ الۡبَحۡرَ فَاَنۡجَيۡنٰکُمۡ وَاَغۡرَقۡنَآ اٰلَ فِرۡعَوۡنَ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"وَاِذۡ وٰعَدۡنَا مُوۡسٰٓى اَرۡبَعِيۡنَ لَيۡلَةً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"ثُمَّ عَفَوۡنَا عَنۡكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَالۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُوۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ اِنَّكُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِكُمُ الۡعِجۡلَ فَتُوۡبُوۡآ اِلٰى بَارِٮِٕكُمۡ فَاقۡتُلُوۡٓا اَنۡفُسَكُمۡؕ ذٰ لِكُمۡ خَيۡرٌ لَّـكُمۡ عِنۡدَ بَارِٮِٕكُمۡؕ فَتَابَ عَلَيۡكُمۡ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نُّؤۡمِنَ لَـكَ حَتّٰى نَرَى اللّٰهَ جَهۡرَةً فَاَخَذَتۡكُمُ الصّٰعِقَةُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"ثُمَّ بَعَثۡنٰكُمۡ مِّنۡۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَظَلَّلۡنَا عَلَيۡکُمُ الۡغَمَامَ وَاَنۡزَلۡنَا عَلَيۡكُمُ الۡمَنَّ وَالسَّلۡوٰى​ؕ كُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ​ؕ وَمَا ظَلَمُوۡنَا وَلٰـكِنۡ كَانُوۡآ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا ادۡخُلُوۡا هٰذِهِ الۡقَرۡيَةَ فَکُلُوۡا مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدًا وَّادۡخُلُوا الۡبَابَ سُجَّدًا وَّقُوۡلُوۡا حِطَّةٌ نَّغۡفِرۡ لَـكُمۡ خَطٰيٰكُمۡ​ؕ وَسَنَزِيۡدُ الۡمُحۡسِنِيۡنَ"},{"ar":"فَبَدَّلَ الَّذِيۡنَ ظَلَمُوۡا قَوۡلاً غَيۡرَ الَّذِىۡ قِيۡلَ لَهُمۡ فَاَنۡزَلۡنَا عَلَى الَّذِيۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا كَانُوۡا يَفۡسُقُوۡنَ"},{"ar":"وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ​ؕ فَانۡفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا​ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ​ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نَّصۡبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِهَا وَقِثَّـآٮِٕهَا وَفُوۡمِهَا وَعَدَسِهَا وَ بَصَلِهَا​ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِىۡ هُوَ اَدۡنٰى بِالَّذِىۡ هُوَ خَيۡرٌ​ؕ اِهۡبِطُوۡا مِصۡرًا فَاِنَّ لَـکُمۡ مَّا سَاَلۡتُمۡ​ؕ وَضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ وَالۡمَسۡکَنَةُ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ​ؕ ذٰلِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ الۡحَـقِّ​ؕ ذٰلِكَ بِمَا عَصَوا وَّڪَانُوۡا يَعۡتَدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَادُوۡا وَالنَّصٰرٰى وَالصّٰبِـِٕـيۡنَ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَعَمِلَ صَالِحًـا فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰكُمۡ بِقُوَّةٍ وَّ اذۡكُرُوۡا مَا فِيۡهِ لَعَلَّكُمۡ تَتَّقُوۡنَ"},{"ar":"ثُمَّ تَوَلَّيۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ​​ۚ فَلَوۡلَا فَضۡلُ اللّٰهِ عَلَيۡكُمۡ وَرَحۡمَتُهٗ لَـكُنۡتُمۡ مِّنَ الۡخٰسِرِيۡنَ"},{"ar":"وَلَقَدۡ عَلِمۡتُمُ الَّذِيۡنَ اعۡتَدَوۡا مِنۡكُمۡ فِىۡ السَّبۡتِ فَقُلۡنَا لَهُمۡ كُوۡنُوۡا قِرَدَةً خَاسِـِٔـيۡنَ ​ۚ"},{"ar":"فَجَعَلۡنٰهَا نَكٰلاً لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةً لِّلۡمُتَّقِيۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖۤ اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَةً ​ ؕ قَالُوۡآ اَتَتَّخِذُنَا هُزُوًۡا ​ؕ قَالَ اَعُوۡذُ بِاللّٰهِ اَنۡ اَكُوۡنَ مِنَ الۡجٰـهِلِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكۡرٌؕ عَوَانٌۢ بَيۡنَ ذٰلِكَ​ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا لَوۡنُهَا ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ صَفۡرَآءُۙ فَاقِعٌ لَّوۡنُهَا تَسُرُّ النّٰظِرِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَۙ اِنَّ الۡبَقَرَ تَشٰبَهَ عَلَيۡنَا ؕ وَاِنَّـآ اِنۡ شَآءَ اللّٰهُ لَمُهۡتَدُوۡنَ"},{"ar":"قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوۡلٌ تُثِيۡرُ الۡاَرۡضَ وَلَا تَسۡقِى الۡحَـرۡثَ ​ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيۡهَا ​ؕ قَالُوا الۡـٰٔـنَ جِئۡتَ بِالۡحَـقِّ​ؕ فَذَبَحُوۡهَا وَمَا كَادُوۡا يَفۡعَلُوۡنَ"},{"ar":"وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِيۡهَا ​ؕ وَاللّٰهُ مُخۡرِجٌ مَّا كُنۡتُمۡ تَكۡتُمُوۡنَۚ"},{"ar":"فَقُلۡنَا اضۡرِبُوۡهُ بِبَعۡضِهَا ​ؕ كَذٰلِكَ يُحۡىِ اللّٰهُ الۡمَوۡتٰى ۙ وَيُرِيۡکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"ثُمَّ قَسَتۡ قُلُوۡبُكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ فَهِىَ كَالۡحِجَارَةِ اَوۡ اَشَدُّ قَسۡوَةً ​ ؕ وَاِنَّ مِنَ الۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ الۡاَنۡهٰرُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ الۡمَآءُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اَفَتَطۡمَعُوۡنَ اَنۡ يُّؤۡمِنُوۡا لَـكُمۡ وَقَدۡ كَانَ فَرِيۡقٌ مِّنۡهُمۡ يَسۡمَعُوۡنَ کَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوۡنَهٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡهُ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَـقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّا  ۖۚ وَاِذَا خَلَا بَعۡضُهُمۡ اِلٰى بَعۡضٍ قَالُوۡآ اَ تُحَدِّثُوۡنَهُمۡ بِمَا فَتَحَ اللّٰهُ عَلَيۡكُمۡ لِيُحَآجُّوۡكُمۡ بِهٖ عِنۡدَ رَبِّكُمۡ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"اَوَلَا يَعۡلَمُوۡنَ اَنَّ اللّٰهَ يَعۡلَمُ مَا يُسِرُّوۡنَ وَمَا يُعۡلِنُوۡنَ"},{"ar":"وَ مِنۡهُمۡ اُمِّيُّوۡنَ لَا يَعۡلَمُوۡنَ الۡكِتٰبَ اِلَّاۤ اَمَانِىَّ وَاِنۡ هُمۡ اِلَّا يَظُنُّوۡنَ"},{"ar":"فَوَيۡلٌ لِّلَّذِيۡنَ يَكۡتُبُوۡنَ الۡكِتٰبَ بِاَيۡدِيۡهِمۡ ثُمَّ يَقُوۡلُوۡنَ هٰذَا مِنۡ عِنۡدِ اللّٰهِ لِيَشۡتَرُوۡا بِهٖ ثَمَنًا قَلِيۡلًا ؕ فَوَيۡلٌ لَّهُمۡ مِّمَّا کَتَبَتۡ اَيۡدِيۡهِمۡ وَوَيۡلٌ لَّهُمۡ مِّمَّا يَكۡسِبُوۡنَ"},{"ar":"وَقَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدَةً ​ ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰهِ عَهۡدًا فَلَنۡ يُّخۡلِفَ اللّٰهُ عَهۡدَهٗۤ​ اَمۡ تَقُوۡلُوۡنَ عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"بَلٰى مَنۡ كَسَبَ سَيِّئَةً وَّاَحَاطَتۡ بِهٖ خَطِيْۤـــَٔتُهٗ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَالَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓٮِٕكَ اَصۡحٰبُ الۡجَـنَّةِ ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَ بَنِىۡٓ اِسۡرَآءِيۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰهَ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا وَّذِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰکِيۡنِ وَقُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ ؕ ثُمَّ تَوَلَّيۡتُمۡ اِلَّا قَلِيۡلًا مِّنۡکُمۡ وَاَنۡـتُمۡ مُّعۡرِضُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ لَا تَسۡفِكُوۡنَ دِمَآءَكُمۡ وَلَا تُخۡرِجُوۡنَ اَنۡفُسَكُمۡ مِّنۡ دِيَارِكُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَاَنۡـتُمۡ تَشۡهَدُوۡنَ"},{"ar":"ثُمَّ اَنۡـتُمۡ هٰٓؤُلَاۤءِ تَقۡتُلُوۡنَ اَنۡفُسَكُمۡ وَتُخۡرِجُوۡنَ فَرِيۡقًا مِّنۡكُمۡ مِّنۡ دِيَارِهِمۡ تَظٰهَرُوۡنَ عَلَيۡهِمۡ بِالۡاِثۡمِ وَالۡعُدۡوَانِؕ وَاِنۡ يَّاۡتُوۡكُمۡ اُسٰرٰى تُفٰدُوۡهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡڪُمۡ اِخۡرَاجُهُمۡ​​ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡكِتٰبِ وَتَكۡفُرُوۡنَ بِبَعۡضٍ​ۚ فَمَا جَزَآءُ مَنۡ يَّفۡعَلُ ذٰلِكَ مِنۡکُمۡ اِلَّا خِزۡىٌ فِى الۡحَيٰوةِ الدُّنۡيَا ​ۚ وَيَوۡمَ الۡقِيٰمَةِ يُرَدُّوۡنَ اِلٰٓى اَشَدِّ الۡعَذَابِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الۡحَيٰوةَ الدُّنۡيَا بِالۡاٰخِرَةِ​ فَلَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَ لَقَدۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَقَفَّيۡنَا مِنۡۢ بَعۡدِهٖ بِالرُّسُلِ​ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ اَفَكُلَّمَا جَآءَكُمۡ رَسُوۡلٌۢ بِمَا لَا تَهۡوٰٓى اَنۡفُسُكُمُ اسۡتَكۡبَرۡتُمۡ​ۚ فَفَرِيۡقًا كَذَّبۡتُمۡ وَفَرِيۡقًا تَقۡتُلُوۡنَ"},{"ar":"وَقَالُوۡا قُلُوۡبُنَا غُلۡفٌ​ؕ بَل لَّعَنَهُمُ اللّٰهُ بِكُفۡرِهِمۡ فَقَلِيۡلًا مَّا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ كِتٰبٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡۙ وَكَانُوۡا مِنۡ قَبۡلُ يَسۡتَفۡتِحُوۡنَ عَلَى الَّذِيۡنَ كَفَرُوۡا  ​ۖۚ فَلَمَّا جَآءَهُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِهٖ​ فَلَعۡنَةُ اللّٰهِ عَلَى الۡكٰفِرِيۡنَ"},{"ar":"بِئۡسَمَا اشۡتَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ اَنۡ يَّڪۡفُرُوۡا بِمَآ اَنۡزَلَ اللّٰهُ بَغۡيًا اَنۡ يُّنَزِّلَ اللّٰهُ مِنۡ فَضۡلِهٖ عَلٰى مَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ​ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰى غَضَبٍ​ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا بِمَآ اَنۡزَلَ اللّٰهُ قَالُوۡا نُؤۡمِنُ بِمَآ اُنۡزِلَ عَلَيۡنَا وَيَكۡفُرُوۡنَ بِمَا وَرَآءَهٗ وَهُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا مَعَهُمۡ​ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡـــۢبِيَآءَ اللّٰهِ مِنۡ قَبۡلُ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"وَلَقَدۡ جَآءَکُمۡ مُّوۡسٰى بِالۡبَيِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَآ اٰتَيۡنٰکُمۡ بِقُوَّةٍ وَّاسۡمَعُوۡا ​ ؕ قَالُوۡا سَمِعۡنَا وَعَصَيۡنَا  وَاُشۡرِبُوۡا فِىۡ قُلُوۡبِهِمُ الۡعِجۡلَ بِکُفۡرِهِمۡ ​ؕ قُلۡ بِئۡسَمَا يَاۡمُرُکُمۡ بِهٖۤ اِيۡمَانُكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"قُلۡ اِنۡ كَانَتۡ لَـکُمُ الدَّارُ الۡاٰخِرَةُ عِنۡدَ اللّٰهِ خَالِصَةً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"وَ لَنۡ يَّتَمَنَّوۡهُ اَبَدًاۢ بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَلَتَجِدَنَّهُمۡ اَحۡرَصَ النَّاسِ عَلٰى حَيٰوةٍ  ۛۚ وَ مِنَ الَّذِيۡنَ اَشۡرَكُوۡا​​  ۛۚ يَوَدُّ اَحَدُهُمۡ لَوۡ يُعَمَّرُ اَ لۡفَ سَنَةٍ ۚ وَمَا هُوَ بِمُزَحۡزِحِهٖ مِنَ الۡعَذَابِ اَنۡ يُّعَمَّرَ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ "},{"ar":"قُلۡ مَنۡ كَانَ عَدُوًّا لِّجِبۡرِيۡلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلۡبِكَ بِاِذۡنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدًى وَّبُشۡرٰى لِلۡمُؤۡمِنِيۡنَ"},{"ar":"مَنۡ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰٓٮِٕکَتِهٖ وَ رُسُلِهٖ وَجِبۡرِيۡلَ وَمِيۡكٰٮلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلۡكٰفِرِيۡنَ"},{"ar":"وَلَقَدۡ اَنۡزَلۡنَآ اِلَيۡكَ اٰيٰتٍۢ بَيِّنٰتٍ​​ۚ وَمَا يَكۡفُرُ بِهَآ اِلَّا الۡفٰسِقُوۡنَ"},{"ar":"اَوَکُلَّمَا عٰهَدُوۡا عَهۡدًا نَّبَذَهٗ فَرِيۡقٌ مِّنۡهُمۡ​ؕ بَلۡ اَكۡثَرُهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡ نَبَذَ فَرِيۡقٌ مِّنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَۙ کِتٰبَ اللّٰهِ وَرَآءَ ظُهُوۡرِهِمۡ كَاَنَّهُمۡ لَا يَعۡلَمُوۡنَ"},{"ar":"وَاتَّبَعُوۡا مَا تَتۡلُوا الشَّيٰطِيۡنُ عَلٰى مُلۡكِ سُلَيۡمٰنَ​​ۚ وَمَا کَفَرَ سُلَيۡمٰنُ وَلٰـكِنَّ الشَّيٰـطِيۡنَ كَفَرُوۡا يُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ وَمَآ اُنۡزِلَ عَلَى الۡمَلَـکَيۡنِ بِبَابِلَ هَارُوۡتَ وَمَارُوۡتَ​ؕ وَمَا يُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰى يَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَةٌ فَلَا تَكۡفُرۡؕ​ فَيَتَعَلَّمُوۡنَ مِنۡهُمَا مَا يُفَرِّقُوۡنَ بِهٖ بَيۡنَ الۡمَرۡءِ وَ زَوۡجِهٖ​ؕ وَمَا هُمۡ بِضَآرِّيۡنَ بِهٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَيَتَعَلَّمُوۡنَ مَا يَضُرُّهُمۡ وَلَا يَنۡفَعُهُمۡ​ؕ وَلَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮهُ مَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ​ؕ وَلَبِئۡسَ مَا شَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ​ؕ لَوۡ کَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"وَلَوۡ اَنَّهُمۡ اٰمَنُوۡا وَاتَّقَوۡا لَمَثُوۡبَةٌ مِّنۡ عِنۡدِ اللّٰهِ خَيۡرٌ ؕ​ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَاسۡمَعُوۡا ​ؕ وَلِلۡڪٰفِرِيۡنَ عَذَابٌ اَلِيۡمٌ"},{"ar":"مَا يَوَدُّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَلَا الۡمُشۡرِكِيۡنَ اَنۡ يُّنَزَّلَ عَلَيۡڪُمۡ مِّنۡ خَيۡرٍ مِّنۡ رَّبِّکُمۡ​ؕ وَاللّٰهُ يَخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ"},{"ar":"مَا نَنۡسَخۡ مِنۡ اٰيَةٍ اَوۡ نُنۡسِهَا نَاۡتِ بِخَيۡرٍ مِّنۡهَآ اَوۡ مِثۡلِهَا ​ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَمَا لَـکُمۡ مِّنۡ دُوۡنِ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَمۡ تُرِيۡدُوۡنَ اَنۡ تَسۡـَٔـلُوۡا رَسُوۡلَـكُمۡ كَمَا سُٮِٕلَ مُوۡسٰى مِنۡ قَبۡلُ​ؕ وَمَنۡ يَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِيۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ"},{"ar":"وَدَّ کَثِيۡرٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يَرُدُّوۡنَكُمۡ مِّنۡۢ بَعۡدِ اِيۡمَانِكُمۡ كُفَّارًا ۖۚ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِهِمۡ مِّنۡۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ الۡحَـقُّ​ ۚ فَاعۡفُوۡا وَاصۡفَحُوۡا حَتّٰى يَاۡتِىَ اللّٰهُ بِاَمۡرِهٖ ​ؕ اِنَّ اللّٰهَ عَلٰى کُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ  ​ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَقَالُوۡا لَنۡ يَّدۡخُلَ الۡجَـنَّةَ اِلَّا مَنۡ كَانَ هُوۡدًا اَوۡ نَصٰرٰى​ؕ تِلۡكَ اَمَانِيُّهُمۡ​ؕ قُلۡ هَاتُوۡا بُرۡهَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"بَلٰى مَنۡ اَسۡلَمَ وَجۡهَهٗ لِلّٰهِ وَهُوَ مُحۡسِنٌ فَلَهٗۤ اَجۡرُهٗ عِنۡدَ رَبِّهٖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَقَالَتِ الۡيَهُوۡدُ لَـيۡسَتِ النَّصٰرٰى عَلٰى شَىۡءٍ وَّقَالَتِ النَّصٰرٰى لَـيۡسَتِ الۡيَهُوۡدُ عَلٰى شَىۡءٍۙ وَّهُمۡ يَتۡلُوۡنَ الۡكِتٰبَؕ كَذٰلِكَ قَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ مِثۡلَ قَوۡلِهِمۡ​ۚ فَاللّٰهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ الۡقِيٰمَةِ فِيۡمَا كَانُوۡا فِيۡهِ يَخۡتَلِفُوۡنَ"},{"ar":"وَمَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنۡ يُّذۡكَرَ فِيۡهَا اسۡمُهٗ وَسَعٰـى فِىۡ خَرَابِهَا ​ؕ اُولٰٓٮِٕكَ مَا كَانَ لَهُمۡ اَنۡ يَّدۡخُلُوۡهَآ اِلَّا خَآٮِٕفِيۡنَ ؕ لَهُمۡ فِى الدُّنۡيَا خِزۡىٌ وَّلَهُمۡ فِى الۡاٰخِرَةِ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَلِلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ​ فَاَيۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡهُ اللّٰهِ​ؕ اِنَّ اللّٰهَ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۙ​ سُبۡحٰنَهٗ ​ؕ بَل لَّهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ كُلٌّ لَّهٗ قَانِتُوۡنَ"},{"ar":"بَدِيۡعُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ"},{"ar":"وَقَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ لَوۡلَا يُكَلِّمُنَا اللّٰهُ اَوۡ تَاۡتِيۡنَآ اٰيَةٌ ​ ؕ كَذٰلِكَ قَالَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّثۡلَ قَوۡلِهِمۡؕ​ تَشَابَهَتۡ قُلُوۡبُهُمۡ​ؕ قَدۡ بَيَّنَّا الۡاٰيٰتِ لِقَوۡمٍ يُّوۡقِنُوۡنَ"},{"ar":"اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًا ۙ​ وَّلَا تُسۡـَٔـلُ عَنۡ اَصۡحٰبِ الۡجَحِيۡمِ"},{"ar":"وَلَنۡ تَرۡضٰى عَنۡكَ الۡيَهُوۡدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَهُمۡ​ؕ قُلۡ اِنَّ هُدَى اللّٰهِ هُوَ الۡهُدٰى​ؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ بَعۡدَ الَّذِىۡ جَآءَكَ مِنَ الۡعِلۡمِ​ۙ مَا لَـكَ مِنَ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَتۡلُوۡنَهٗ حَقَّ تِلَاوَتِهٖؕ اُولٰٓٮِٕكَ يُؤۡمِنُوۡنَ بِهٖ​ ؕ وَمَنۡ يَّكۡفُرۡ بِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا عَدۡلٌ وَّلَا تَنۡفَعُهَا شَفَاعَةٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذِ ابۡتَلٰٓى اِبۡرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ ​ؕ قَالَ اِنِّىۡ جَاعِلُكَ لِلنَّاسِ اِمَامًا ​ؕ قَالَ وَمِنۡ ذُرِّيَّتِىۡ ​ؕ قَالَ لَا يَنَالُ عَهۡدِى الظّٰلِمِيۡنَ"},{"ar":"وَاِذۡ جَعَلۡنَا الۡبَيۡتَ مَثَابَةً لِّلنَّاسِ وَاَمۡنًا ؕ وَاتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰهٖمَ مُصَلًّى​ ؕ وَعَهِدۡنَآ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ اَنۡ طَهِّرَا بَيۡتِىَ لِلطَّآٮِٕفِيۡنَ وَالۡعٰكِفِيۡنَ وَالرُّکَّعِ السُّجُوۡدِ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اجۡعَلۡ هٰذَا بَلَدًا اٰمِنًا وَّارۡزُقۡ اَهۡلَهٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ قَالَ وَمَنۡ كَفَرَ فَاُمَتِّعُهٗ قَلِيۡلًا ثُمَّ اَضۡطَرُّهٗۤ اِلٰى عَذَابِ النَّارِ​ؕ وَبِئۡسَ الۡمَصِيۡرُ"},{"ar":"وَاِذۡ يَرۡفَعُ اِبۡرٰهٖمُ الۡقَوَاعِدَ مِنَ الۡبَيۡتِ وَاِسۡمٰعِيۡلُؕ رَبَّنَا تَقَبَّلۡ مِنَّا ​ؕ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ"},{"ar":"رَبَّنَا وَاجۡعَلۡنَا مُسۡلِمَيۡنِ لَـكَ وَ مِنۡ ذُرِّيَّتِنَآ اُمَّةً مُّسۡلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَا ۚ اِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"رَبَّنَا وَابۡعَثۡ فِيۡهِمۡ رَسُوۡلًا مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِكَ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَ يُزَكِّيۡهِمۡ​ؕ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ"},{"ar":"وَمَنۡ يَّرۡغَبُ عَنۡ مِّلَّةِ اِبۡرٰهٖمَ اِلَّا مَنۡ سَفِهَ نَفۡسَهٗ ​ؕ وَلَقَدِ اصۡطَفَيۡنٰهُ فِى الدُّنۡيَا ​ۚ وَاِنَّهٗ فِى الۡاٰخِرَةِ لَمِنَ الصّٰلِحِيۡنَ"},{"ar":"اِذۡ قَالَ لَهٗ رَبُّهٗۤ اَسۡلِمۡ​ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِيۡنَ"},{"ar":"وَوَصّٰى بِهَآ اِبۡرٰهٖمُ بَنِيۡهِ وَ يَعۡقُوۡبُؕ يٰبَنِىَّ اِنَّ اللّٰهَ اصۡطَفٰى لَـكُمُ الدِّيۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡـتُمۡ مُّسۡلِمُوۡنَؕ"},{"ar":"اَمۡ كُنۡتُمۡ شُهَدَآءَ اِذۡ حَضَرَ يَعۡقُوۡبَ الۡمَوۡتُۙ اِذۡ قَالَ لِبَنِيۡهِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِىۡؕ قَالُوۡا نَعۡبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآٮِٕكَ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ اِلٰهًا وَّاحِدًا ۖۚ وَّنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"وَقَالُوۡا کُوۡنُوۡا هُوۡدًا اَوۡ نَصٰرٰى تَهۡتَدُوۡا ​ؕ قُلۡ بَلۡ مِلَّةَ اِبۡرٰهٖمَ حَنِيۡفًا ​ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ"},{"ar":"قُوۡلُوۡٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنۡزِلَ اِلَيۡنَا وَمَآ اُنۡزِلَ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَمَآ اُوۡتِىَ مُوۡسٰى وَعِيۡسٰى وَمَآ اُوۡتِىَ النَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ​ۚ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَآ اٰمَنۡتُمۡ بِهٖ فَقَدِ اهۡتَدَوْا ​ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا هُمۡ فِىۡ شِقَاقٍ​ ۚ فَسَيَكۡفِيۡکَهُمُ اللّٰهُ ​ۚ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُؕ"},{"ar":"صِبۡغَةَ اللّٰهِ ​ۚ وَمَنۡ اَحۡسَنُ مِنَ اللّٰهِ صِبۡغَةً  وَّنَحۡنُ لَهٗ عٰبِدُوۡنَ"},{"ar":"قُلۡ اَ تُحَآجُّوۡنَـنَا فِى اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّکُمۡۚ وَلَنَآ اَعۡمَالُـنَا وَلَـكُمۡ اَعۡمَالُكُمۡۚ وَنَحۡنُ لَهٗ مُخۡلِصُوۡنَۙ"},{"ar":"اَمۡ تَقُوۡلُوۡنَ اِنَّ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطَ كَانُوۡا هُوۡدًا اَوۡ نَصٰرٰى​ؕ قُلۡ ءَاَنۡـتُمۡ اَعۡلَمُ اَمِ اللّٰهُ​ ؕ وَمَنۡ اَظۡلَمُ مِمَّنۡ كَتَمَ شَهَادَةً عِنۡدَهٗ مِنَ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"سَيَقُوۡلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰٮهُمۡ عَنۡ قِبۡلَتِهِمُ الَّتِىۡ كَانُوۡا عَلَيۡهَا ​ؕ قُل لِّلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ ؕ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِراطٍ مُّسۡتَقِيۡمٍ"},{"ar":"وَكَذٰلِكَ جَعَلۡنٰكُمۡ اُمَّةً وَّسَطًا لِّتَکُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ وَيَكُوۡنَ الرَّسُوۡلُ عَلَيۡكُمۡ شَهِيۡدًا ؕ وَمَا جَعَلۡنَا الۡقِبۡلَةَ الَّتِىۡ كُنۡتَ عَلَيۡهَآ اِلَّا لِنَعۡلَمَ مَنۡ يَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ يَّنۡقَلِبُ عَلٰى عَقِبَيۡهِ ​ؕ وَاِنۡ كَانَتۡ لَكَبِيۡرَةً اِلَّا عَلَى الَّذِيۡنَ هَدَى اللّٰهُ ؕ وَمَا كَانَ اللّٰهُ لِيُضِيْعَ اِيۡمَانَكُمۡ​ ؕ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِيۡمٌ"},{"ar":"قَدۡ نَرٰى تَقَلُّبَ وَجۡهِكَ فِى السَّمَآءِ​​ۚ فَلَـنُوَلِّيَنَّكَ قِبۡلَةً تَرۡضٰٮهَا​ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَكُمۡ شَطۡرَهٗ ​ؕ وَاِنَّ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ لَيَـعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعۡمَلُوۡنَ"},{"ar":"وَلَٮِٕنۡ اَ تَيۡتَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوۡا قِبۡلَتَكَ​ۚ وَمَآ اَنۡتَ بِتَابِعٍ قِبۡلَتَهُمۡ​ۚ وَمَا بَعۡضُهُمۡ بِتَابِعٍ قِبۡلَةَ بَعۡضٍؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ​ۙ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيۡنَ​ۘ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَعۡرِفُوۡنَهٗ كَمَا يَعۡرِفُوۡنَ اَبۡنَآءَهُمۡؕ وَاِنَّ فَرِيۡقًا مِّنۡهُمۡ لَيَكۡتُمُوۡنَ الۡحَـقَّ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُوۡنَنَّ مِنَ الۡمُمۡتَرِيۡنَ"},{"ar":"وَلِكُلٍّ وِّجۡهَةٌ هُوَ مُوَلِّيۡهَا ​ۚ فَاسۡتَبِقُوا الۡخَيۡرٰتِؕ اَيۡنَ مَا تَكُوۡنُوۡا يَاۡتِ بِكُمُ اللّٰهُ جَمِيۡعًا ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَاِنَّهٗ لَـلۡحَقُّ مِنۡ رَّبِّكَؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَڪُمۡ شَطۡرَهٗ ۙ لِئَلَّا يَكُوۡنَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ اِلَّا الَّذِيۡنَ ظَلَمُوۡا مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَاخۡشَوۡنِىۡ وَلِاُتِمَّ نِعۡمَتِىۡ عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُوۡنَ ۙ​ۛ"},{"ar":"كَمَآ اَرۡسَلۡنَا فِيۡکُمۡ رَسُوۡلًا مِّنۡکُمۡ يَتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِنَا وَيُزَكِّيۡکُمۡ وَيُعَلِّمُکُمُ الۡكِتٰبَ وَالۡحِکۡمَةَ وَيُعَلِّمُكُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ ؕ​ۛ"},{"ar":"فَاذۡكُرُوۡنِىۡٓ اَذۡكُرۡكُمۡ وَاشۡکُرُوۡا لِىۡ وَلَا تَكۡفُرُوۡنِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا اسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ؕ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَا تَقُوۡلُوۡا لِمَنۡ يُّقۡتَلُ فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوَاتٌ ؕ بَلۡ اَحۡيَآءٌ وَّلٰـكِنۡ لَّا تَشۡعُرُوۡنَ"},{"ar":"وَلَـنَبۡلُوَنَّكُمۡ بِشَىۡءٍ مِّنَ الۡخَـوۡفِ وَالۡجُـوۡعِ وَنَقۡصٍ مِّنَ الۡاَمۡوَالِ وَالۡاَنۡفُسِ وَالثَّمَرٰتِؕ وَبَشِّرِ الصّٰبِرِيۡنَۙ"},{"ar":"الَّذِيۡنَ اِذَآ اَصَابَتۡهُمۡ مُّصِيۡبَةٌ  ۙ قَالُوۡٓا اِنَّا لِلّٰهِ وَاِنَّـآ اِلَيۡهِ رٰجِعُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلَيۡهِمۡ صَلَوٰتٌ مِّنۡ رَّبِّهِمۡ وَرَحۡمَةٌ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُهۡتَدُوۡنَ"},{"ar":"اِنَّ الصَّفَا وَالۡمَرۡوَةَ مِنۡ شَعَآٮِٕرِ اللّٰهِۚ فَمَنۡ حَجَّ الۡبَيۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ اَنۡ يَّطَّوَّفَ بِهِمَا ؕ وَمَنۡ تَطَوَّعَ خَيۡرًا ۙ فَاِنَّ اللّٰهَ شَاكِرٌ عَلِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلۡنَا مِنَ الۡبَيِّنٰتِ وَالۡهُدٰى مِنۡۢ بَعۡدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِى الۡكِتٰبِۙ اُولٰٓٮِٕكَ يَلۡعَنُهُمُ اللّٰهُ وَ يَلۡعَنُهُمُ اللّٰعِنُوۡنَۙ"},{"ar":"اِلَّا الَّذِيۡنَ تَابُوۡا وَاَصۡلَحُوۡا وَبَيَّـنُوۡا فَاُولٰٓٮِٕكَ اَ تُوۡبُ عَلَيۡهِمۡۚ وَاَنَا التَّوَّابُ الرَّحِيۡمُ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ اُولٰٓٮِٕكَ عَلَيۡهِمۡ لَعۡنَةُ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ"},{"ar":"خٰلِدِيۡنَ فِيۡهَا ۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَ"},{"ar":"وَاِلٰهُكُمۡ اِلٰهٌ وَّاحِدٌ  ۚ لَآ اِلٰهَ اِلَّا هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ"},{"ar":"اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ وَالۡفُلۡكِ الَّتِىۡ تَجۡرِىۡ فِى الۡبَحۡرِ بِمَا يَنۡفَعُ النَّاسَ وَمَآ اَنۡزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡيَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيۡهَا مِنۡ کُلِّ دَآ بَّةٍ وَّتَصۡرِيۡفِ الرِّيٰحِ وَالسَّحَابِ الۡمُسَخَّرِ بَيۡنَ السَّمَآءِ وَالۡاَرۡضِ لَاٰيٰتٍ لِّقَوۡمٍ يَّعۡقِلُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّتَّخِذُ مِنۡ دُوۡنِ اللّٰهِ اَنۡدَادًا يُّحِبُّوۡنَهُمۡ كَحُبِّ اللّٰهِؕ وَالَّذِيۡنَ اٰمَنُوۡٓا اَشَدُّ حُبًّا لِّلّٰهِ ؕ وَلَوۡ يَرَى الَّذِيۡنَ ظَلَمُوۡٓا اِذۡ يَرَوۡنَ الۡعَذَابَۙ اَنَّ الۡقُوَّةَ لِلّٰهِ جَمِيۡعًا ۙ وَّاَنَّ اللّٰهَ شَدِيۡدُ الۡعَذَابِ"},{"ar":"اِذۡ تَبَرَّاَ الَّذِيۡنَ اتُّبِعُوۡا مِنَ الَّذِيۡنَ اتَّبَعُوۡا وَرَاَوُا الۡعَذَابَ وَ تَقَطَّعَتۡ بِهِمُ الۡاَسۡبَابُ"},{"ar":"وَقَالَ الَّذِيۡنَ اتَّبَعُوۡا لَوۡ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنۡهُمۡ كَمَا تَبَرَّءُوۡا مِنَّا ؕ كَذٰلِكَ يُرِيۡهِمُ اللّٰهُ اَعۡمَالَهُمۡ حَسَرٰتٍ عَلَيۡهِمۡؕ وَمَا هُمۡ بِخٰرِجِيۡنَ مِنَ النَّارِ"},{"ar":"يٰٓاَيُّهَا النَّاسُ كُلُوۡا مِمَّا فِى الۡاَرۡضِ حَلٰلًا طَيِّبًا  ۖ وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِؕ اِنَّهٗ لَـكُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"اِنَّمَا يَاۡمُرُكُمۡ بِالسُّوۡٓءِ وَالۡفَحۡشَآءِ وَاَنۡ تَقُوۡلُوۡا عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَـتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَا ؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ کَفَرُوۡا كَمَثَلِ الَّذِىۡ يَنۡعِقُ بِمَا لَا يَسۡمَعُ اِلَّا دُعَآءً وَّنِدَآءً ؕ صُمٌّۢ بُكۡمٌ عُمۡـىٌ فَهُمۡ لَا يَعۡقِلُوۡنَ"},{"ar":"يٰٓاَ يُّهَا الَّذِيۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ وَاشۡكُرُوۡا لِلّٰهِ اِنۡ کُنۡتُمۡ اِيَّاهُ تَعۡبُدُوۡنَ"},{"ar":"اِنَّمَا حَرَّمَ عَلَيۡکُمُ الۡمَيۡتَةَ وَالدَّمَ وَلَحۡمَ الۡخِنۡزِيۡرِ وَمَآ اُهِلَّ بِهٖ لِغَيۡرِ اللّٰهِ​ۚ فَمَنِ اضۡطُرَّ غَيۡرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثۡمَ عَلَيۡهِ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلَ اللّٰهُ مِنَ الۡکِتٰبِ وَ يَشۡتَرُوۡنَ بِهٖ ثَمَنًا قَلِيۡلًا ۙ اُولٰٓٮِٕكَ مَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ اِلَّا النَّارَ وَلَا يُکَلِّمُهُمُ اللّٰهُ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَکِّيۡهِمۡ ۖۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى وَالۡعَذَابَ بِالۡمَغۡفِرَةِ​ ۚ فَمَآ اَصۡبَرَهُمۡ عَلَى النَّارِ"},{"ar":"ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الۡکِتٰبَ بِالۡحَـقِّؕ وَاِنَّ الَّذِيۡنَ اخۡتَلَفُوۡا فِى الۡكِتٰبِ لَفِىۡ شِقَاقٍۢ بَعِيۡدٍ"},{"ar":"لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ​ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِى الرِّقَابِ​ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ ​ ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡا ۚ وَالصّٰبِرِيۡنَ فِى الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡا ؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡكُمُ الۡقِصَاصُ فِى الۡقَتۡلٰى  ؕ الۡحُرُّ بِالۡحُـرِّ وَالۡعَبۡدُ بِالۡعَبۡدِ وَالۡاُنۡثَىٰ بِالۡاُنۡثٰىؕ فَمَنۡ عُفِىَ لَهٗ مِنۡ اَخِيۡهِ شَىۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَاَدَآءٌ اِلَيۡهِ بِاِحۡسَانٍؕ ذٰلِكَ تَخۡفِيۡفٌ مِّنۡ رَّبِّكُمۡ وَرَحۡمَةٌ  ؕ فَمَنِ اعۡتَدٰى بَعۡدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيۡمٌۚ"},{"ar":"وَ لَـكُمۡ فِى الۡقِصَاصِ حَيٰوةٌ يّٰٓـاُولِىۡ الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ"},{"ar":"كُتِبَ عَلَيۡكُمۡ اِذَا حَضَرَ اَحَدَكُمُ الۡمَوۡتُ اِنۡ تَرَكَ خَيۡرَا  ۖۚ اۨلۡوَصِيَّةُ لِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ بِالۡمَعۡرُوۡفِۚ حَقًّا عَلَى الۡمُتَّقِيۡنَؕ"},{"ar":"فَمَنۡۢ بَدَّلَهٗ بَعۡدَمَا سَمِعَهٗ فَاِنَّمَآ اِثۡمُهٗ عَلَى الَّذِيۡنَ يُبَدِّلُوۡنَهٗؕ اِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌؕ"},{"ar":"فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ بَيۡنَهُمۡ فَلَاۤ اِثۡمَ عَلَيۡهِؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يٰٓـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡکُمُ الصِّيَامُ کَمَا كُتِبَ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ"},{"ar":"اَيَّامًا مَّعۡدُوۡدٰتٍؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَ​ؕ وَعَلَى الَّذِيۡنَ يُطِيۡقُوۡنَهٗ فِدۡيَةٌ طَعَامُ مِسۡكِيۡنٍؕ فَمَنۡ تَطَوَّعَ خَيۡرًا فَهُوَ خَيۡرٌ لَّهٗ ؕ وَاَنۡ تَصُوۡمُوۡا خَيۡرٌ لَّـکُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"شَهۡرُ رَمَضَانَ الَّذِىۡٓ اُنۡزِلَ فِيۡهِ الۡقُرۡاٰنُ هُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الۡهُدٰى وَالۡفُرۡقَانِۚ فَمَنۡ شَهِدَ مِنۡكُمُ الشَّهۡرَ فَلۡيَـصُمۡهُ ؕ وَمَنۡ کَانَ مَرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَؕ يُرِيۡدُ اللّٰهُ بِکُمُ الۡيُسۡرَ وَلَا يُرِيۡدُ بِکُمُ الۡعُسۡرَ وَلِتُکۡمِلُوا الۡعِدَّةَ وَلِتُکَبِّرُوا اللّٰهَ عَلٰى مَا هَدٰٮكُمۡ وَلَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذَا سَاَلَـكَ عِبَادِىۡ عَنِّىۡ فَاِنِّىۡ قَرِيۡبٌؕ اُجِيۡبُ دَعۡوَةَ الدَّاعِ اِذَا دَعَانِ فَلۡيَسۡتَجِيۡبُوۡا لِىۡ وَلۡيُؤۡمِنُوۡا بِىۡ لَعَلَّهُمۡ يَرۡشُدُوۡنَ"},{"ar":"اُحِلَّ لَـکُمۡ لَيۡلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَآٮِٕكُمۡ​ؕ هُنَّ لِبَاسٌ لَّـكُمۡ وَاَنۡـتُمۡ لِبَاسٌ لَّهُنَّ ؕ عَلِمَ اللّٰهُ اَنَّکُمۡ كُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنۡكُمۡۚ فَالۡـــٰٔنَ بَاشِرُوۡهُنَّ وَابۡتَغُوۡا مَا کَتَبَ اللّٰهُ لَـكُمۡ وَكُلُوۡا وَاشۡرَبُوۡا حَتّٰى يَتَبَيَّنَ لَـكُمُ الۡخَـيۡطُ الۡاَبۡيَضُ مِنَ الۡخَـيۡطِ الۡاَسۡوَدِ مِنَ الۡفَجۡرِ​ؕ ثُمَّ اَتِمُّوا الصِّيَامَ اِلَى الَّيۡلِ​ۚ وَلَا تُبَاشِرُوۡهُنَّ وَاَنۡـتُمۡ عٰكِفُوۡنَ فِى الۡمَسٰجِدِؕ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَقۡرَبُوۡهَا ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُوۡنَ"},{"ar":"وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُـکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡاَهِلَّةِ ​ؕ قُلۡ هِىَ مَوَاقِيۡتُ لِلنَّاسِ وَالۡحَجِّ ؕ وَلَيۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوا الۡبُيُوۡتَ مِنۡ ظُهُوۡرِهَا وَلٰـكِنَّ الۡبِرَّ مَنِ اتَّقٰى​ۚ وَاۡتُوا الۡبُيُوۡتَ مِنۡ اَبۡوَابِهَا وَاتَّقُوا اللّٰهَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡا ؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ"},{"ar":"وَاقۡتُلُوۡهُمۡ حَيۡثُ ثَقِفۡتُمُوۡهُمۡ وَاَخۡرِجُوۡهُمۡ مِّنۡ حَيۡثُ اَخۡرَجُوۡكُمۡ​ وَالۡفِتۡنَةُ اَشَدُّ مِنَ الۡقَتۡلِۚ وَلَا تُقٰتِلُوۡهُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَـرَامِ حَتّٰى يُقٰتِلُوۡكُمۡ فِيۡهِ​ۚ فَاِنۡ قٰتَلُوۡكُمۡ فَاقۡتُلُوۡهُمۡؕ كَذٰلِكَ جَزَآءُ الۡكٰفِرِيۡنَ"},{"ar":"فَاِنِ انۡـتَهَوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَقٰتِلُوۡهُمۡ حَتّٰى لَا تَكُوۡنَ فِتۡنَةٌ وَّيَكُوۡنَ الدِّيۡنُ لِلّٰهِ​ؕ فَاِنِ انتَهَوۡا فَلَا عُدۡوَانَ اِلَّا عَلَى الظّٰلِمِيۡنَ"},{"ar":"اَلشَّهۡرُ الۡحَـرَامُ بِالشَّهۡرِ الۡحَـرَامِ وَالۡحُرُمٰتُ قِصَاصٌ​ؕ فَمَنِ اعۡتَدٰى عَلَيۡكُمۡ فَاعۡتَدُوۡا عَلَيۡهِ بِمِثۡلِ مَا اعۡتَدٰى عَلَيۡكُمۡ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ مَعَ الۡمُتَّقِيۡنَ"},{"ar":"وَاَنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلَا تُلۡقُوۡا بِاَيۡدِيۡكُمۡ اِلَى التَّهۡلُكَةِ ۖ  ۛۚ وَاَحۡسِنُوۡا  ۛۚ اِنَّ اللّٰهَ يُحِبُّ الۡمُحۡسِنِيۡنَ"},{"ar":"وَاَتِمُّوا الۡحَجَّ وَالۡعُمۡرَةَ لِلّٰهِؕ فَاِنۡ اُحۡصِرۡتُمۡ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ وَلَا تَحۡلِقُوۡا رُءُوۡسَكُمۡ حَتّٰى يَبۡلُغَ الۡهَدۡىُ مَحِلَّهٗ ؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ بِهٖۤ اَذًى مِّنۡ رَّاۡسِهٖ فَفِدۡيَةٌ مِّنۡ صِيَامٍ اَوۡ صَدَقَةٍ اَوۡ نُسُكٍۚ فَاِذَآ اَمِنۡتُمۡ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَةِ اِلَى الۡحَجِّ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِى الۡحَجِّ وَسَبۡعَةٍ اِذَا رَجَعۡتُمۡؕ تِلۡكَ عَشَرَةٌ كَامِلَةٌ  ؕ ذٰ لِكَ لِمَنۡ لَّمۡ يَكُنۡ اَهۡلُهٗ حَاضِرِىۡ الۡمَسۡجِدِ الۡحَـرَامِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"اَلۡحَجُّ اَشۡهُرٌ مَّعۡلُوۡمٰتٌ ​ۚ فَمَنۡ فَرَضَ فِيۡهِنَّ الۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوۡقَۙ وَلَا جِدَالَ فِى الۡحَجِّ ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ يَّعۡلَمۡهُ اللّٰهُ ​ؕ وَتَزَوَّدُوۡا فَاِنَّ خَيۡرَ الزَّادِ التَّقۡوٰى وَاتَّقُوۡنِ يٰٓاُولِى الۡاَلۡبَابِ"},{"ar":"​لَيۡسَ عَلَيۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡؕ فَاِذَآ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوا اللّٰهَ عِنۡدَ الۡمَشۡعَرِ الۡحَـرَامِ وَاذۡکُرُوۡهُ کَمَا هَدٰٮکُمۡ​ۚ وَاِنۡ کُنۡتُمۡ مِّنۡ قَبۡلِهٖ لَمِنَ الضَّآ لِّيۡنَ"},{"ar":"ثُمَّ اَفِيۡضُوۡا مِنۡ حَيۡثُ اَفَاضَ النَّاسُ وَاسۡتَغۡفِرُوا اللّٰهَ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"فَاِذَا قَضَيۡتُمۡ مَّنَاسِكَکُمۡ فَاذۡکُرُوا اللّٰهَ كَذِكۡرِكُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًا ؕ فَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا وَمَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ"},{"ar":"وَمِنۡهُمۡ مَّنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا حَسَنَةً وَّفِى الۡاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ"},{"ar":"اُولٰٓٮِٕكَ لَهُمۡ نَصِيۡبٌ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ سَرِيۡعُ الۡحِسَابِ"},{"ar":"وَاذۡكُرُوا اللّٰهَ فِىۡٓ اَيَّامٍ مَّعۡدُوۡدٰتٍ​ؕ فَمَنۡ تَعَجَّلَ فِىۡ يَوۡمَيۡنِ فَلَاۤ اِثۡمَ عَلَيۡهِ ۚ وَمَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَيۡه​ِ ۙ لِمَنِ اتَّقٰى ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ اِلَيۡهِ تُحۡشَرُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يُّعۡجِبُكَ قَوۡلُهٗ فِى الۡحَيٰوةِ الدُّنۡيَا وَيُشۡهِدُ اللّٰهَ عَلٰى مَا فِىۡ قَلۡبِهٖۙ وَهُوَ اَلَدُّ الۡخِصَامِ"},{"ar":"وَاِذَا تَوَلّٰى سَعٰى فِى الۡاَرۡضِ لِيُفۡسِدَ فِيۡهَا وَيُهۡلِكَ الۡحَـرۡثَ وَالنَّسۡلَ​ؕ وَاللّٰهُ لَا يُحِبُّ الۡفَسَادَ"},{"ar":"وَاِذَا قِيۡلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتۡهُ الۡعِزَّةُ بِالۡاِثۡمِ​ فَحَسۡبُهٗ جَهَنَّمُ​ؕ وَلَبِئۡسَ الۡمِهَادُ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّشۡرِىۡ نَفۡسَهُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ​ؕ وَ اللّٰهُ رَءُوۡفٌ ۢ بِالۡعِبَادِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا ادۡخُلُوۡا فِى السِّلۡمِ کَآفَّةً  وَلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِ​ؕ اِنَّهٗ لَـکُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"فَاِنۡ زَلَـلۡتُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَيِّنٰتُ فَاعۡلَمُوۡٓا اَنَّ اللّٰهَ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"هَلۡ يَنۡظُرُوۡنَ اِلَّاۤ اَنۡ يَّاۡتِيَهُمُ اللّٰهُ فِىۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَالۡمَلٰٓٮِٕکَةُ وَقُضِىَ الۡاَمۡرُ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ"},{"ar":"سَلۡ بَنِىۡٓ اِسۡرَآءِيۡلَ كَمۡ اٰتَيۡنٰهُمۡ مِّنۡ اٰيَةٍۢ بَيِّنَةٍ ​ؕ وَمَنۡ يُّبَدِّلۡ نِعۡمَةَ اللّٰهِ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"زُيِّنَ لِلَّذِيۡنَ كَفَرُوا الۡحَيٰوةُ الدُّنۡيَا وَيَسۡخَرُوۡنَ مِنَ الَّذِيۡنَ اٰمَنُوۡا ​ ۘ وَالَّذِيۡنَ اتَّقَوۡا فَوۡقَهُمۡ يَوۡمَ الۡقِيٰمَةِ ؕ وَاللّٰهُ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ"},{"ar":"كَانَ النَّاسُ اُمَّةً وَّاحِدَةً  فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ وَاَنۡزَلَ مَعَهُمُ الۡكِتٰبَ بِالۡحَـقِّ لِيَحۡكُمَ بَيۡنَ النَّاسِ فِيۡمَا اخۡتَلَفُوۡا فِيۡهِ ​ؕ وَمَا اخۡتَلَفَ فِيۡهِ اِلَّا الَّذِيۡنَ اُوۡتُوۡهُ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ بَغۡيًا ۢ بَيۡنَهُمۡ​ۚ فَهَدَى اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِيۡهِ مِنَ الۡحَـقِّ بِاِذۡنِهٖ​ ؕ وَاللّٰهُ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ"},{"ar":"اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوا الۡجَـنَّةَ وَ لَمَّا يَاۡتِكُمۡ مَّثَلُ الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلِكُمۡؕ مَسَّتۡهُمُ الۡبَاۡسَآءُ وَالضَّرَّآءُ وَزُلۡزِلُوۡا حَتّٰى يَقُوۡلَ الرَّسُوۡلُ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ مَتٰى نَصۡرُ اللّٰهِؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰهِ قَرِيۡبٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَ ؕ قُلۡ مَآ اَنۡفَقۡتُمۡ مِّنۡ خَيۡرٍ فَلِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِ​ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"كُتِبَ عَلَيۡکُمُ الۡقِتَالُ وَهُوَ كُرۡهٌ لَّـكُمۡ​ۚ وَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡـــًٔا وَّهُوَ خَيۡرٌ لَّـکُمۡ​ۚ وَعَسٰۤى اَنۡ تُحِبُّوۡا شَيۡـــًٔا وَّهُوَ شَرٌّ لَّـكُمۡؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الشَّهۡرِ الۡحَـرَامِ قِتَالٍ فِيۡهِ​ؕ قُلۡ قِتَالٌ فِيۡهِ كَبِيۡرٌ ​ؕ وَصَدٌّ عَنۡ سَبِيۡلِ اللّٰهِ وَ کُفۡرٌ ۢ بِهٖ وَالۡمَسۡجِدِ الۡحَـرَامِ وَاِخۡرَاجُ اَهۡلِهٖ مِنۡهُ اَكۡبَرُ عِنۡدَ اللّٰهِ ​​ۚ وَالۡفِتۡنَةُ اَکۡبَرُ مِنَ الۡقَتۡلِ​ؕ وَلَا يَزَالُوۡنَ يُقَاتِلُوۡنَكُمۡ حَتّٰى يَرُدُّوۡكُمۡ عَنۡ دِيۡـنِکُمۡ اِنِ اسۡتَطَاعُوۡا ​ؕ وَمَنۡ يَّرۡتَدِدۡ مِنۡكُمۡ عَنۡ دِيۡـنِهٖ فَيَمُتۡ وَهُوَ کَافِرٌ فَاُولٰٓٮِٕكَ حَبِطَتۡ اَعۡمَالُهُمۡ فِى الدُّنۡيَا وَالۡاٰخِرَةِ ​​ۚ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَاجَرُوۡا وَجَاهَدُوۡا فِىۡ سَبِيۡلِ اللّٰهِۙ اُولٰٓٮِٕكَ يَرۡجُوۡنَ رَحۡمَتَ اللّٰهِؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡخَمۡرِ وَالۡمَيۡسِرِ​ؕ قُلۡ فِيۡهِمَآ اِثۡمٌ کَبِيۡرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثۡمُهُمَآ اَکۡبَرُ مِنۡ نَّفۡعِهِمَا ؕ وَيَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ  قُلِ الۡعَفۡوَ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّکُمۡ تَتَفَكَّرُوۡنَۙ"},{"ar":"فِى الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـــَٔلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌ ؕ وَاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ​ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ​ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"وَلَا تَنۡكِحُوا الۡمُشۡرِكٰتِ حَتّٰى يُؤۡمِنَّ​ؕ وَلَاَمَةٌ مُّؤۡمِنَةٌ خَيۡرٌ مِّنۡ مُّشۡرِكَةٍ وَّلَوۡ اَعۡجَبَتۡكُمۡ​ۚ وَلَا تُنۡكِحُوا الۡمُشۡرِكِيۡنَ حَتّٰى يُؤۡمِنُوۡا ​ؕ وَلَعَبۡدٌ مُّؤۡمِنٌ خَيۡرٌ مِّنۡ مُّشۡرِكٍ وَّلَوۡ اَعۡجَبَكُمۡؕ اُولٰٓٮِٕكَ يَدۡعُوۡنَ اِلَى النَّارِ  ۖۚ وَاللّٰهُ يَدۡعُوۡٓا اِلَى الۡجَـنَّةِ وَالۡمَغۡفِرَةِ بِاِذۡنِهٖ​ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ "},{"ar":"وَ يَسۡـــَٔلُوۡنَكَ عَنِ الۡمَحِيۡضِ​ۙ قُلۡ هُوَ اَذًى فَاعۡتَزِلُوۡا النِّسَآءَ فِى الۡمَحِيۡضِ​ۙ وَلَا تَقۡرَبُوۡهُنَّ حَتّٰى يَطۡهُرۡنَ​​ۚ فَاِذَا تَطَهَّرۡنَ فَاۡتُوۡهُنَّ مِنۡ حَيۡثُ اَمَرَكُمُ اللّٰهُ​ؕ اِنَّ اللّٰهَ يُحِبُّ التَّوَّابِيۡنَ وَيُحِبُّ الۡمُتَطَهِّرِيۡنَ"},{"ar":"نِسَآؤُكُمۡ حَرۡثٌ لَّـكُمۡ فَاۡتُوۡا حَرۡثَكُمۡ اَنّٰى شِئۡتُمۡ​  وَقَدِّمُوۡا لِاَنۡفُسِكُمۡ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ مُّلٰقُوۡهُ ​ؕ وَ بَشِّرِ الۡمُؤۡمِنِيۡنَ"},{"ar":"وَلَا تَجۡعَلُوا اللّٰهَ عُرۡضَةً لِّاَيۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَتَتَّقُوۡا وَتُصۡلِحُوۡا بَيۡنَ النَّاسِ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغۡوِ فِىۡٓ اَيۡمَانِكُمۡ وَلٰـكِنۡ يُّؤَاخِذُكُمۡ بِمَا كَسَبَتۡ قُلُوۡبُكُمۡ​ؕ وَاللّٰهُ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لِّـلَّذِيۡنَ يُؤۡلُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ تَرَبُّصُ اَرۡبَعَةِ اَشۡهُرٍ​​ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَاِنۡ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"وَالۡمُطَلَّقٰتُ يَتَرَ بَّصۡنَ بِاَنۡفُسِهِنَّ ثَلٰثَةَ قُرُوۡٓءٍ ​ؕ وَلَا يَحِلُّ لَهُنَّ اَنۡ يَّكۡتُمۡنَ مَا خَلَقَ اللّٰهُ فِىۡٓ اَرۡحَامِهِنَّ اِنۡ كُنَّ يُؤۡمِنَّ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ وَبُعُوۡلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِىۡ ذٰ لِكَ اِنۡ اَرَادُوۡٓا اِصۡلَاحًا ​ؕ وَلَهُنَّ مِثۡلُ الَّذِىۡ عَلَيۡهِنَّ بِالۡمَعۡرُوۡفِ​ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٌ ​ ؕ وَاللّٰهُ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"اَلطَّلَاقُ مَرَّتٰنِ​ فَاِمۡسَاكٌ ۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِيۡحٌ ۢ بِاِحۡسَانٍ​ ؕوَلَا يَحِلُّ لَـکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّآ اٰتَيۡتُمُوۡهُنَّ شَيۡـــًٔا اِلَّاۤ اَنۡ يَّخَافَآ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ فَاِنۡ خِفۡتُمۡ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِۙ فَلَا جُنَاحَ عَلَيۡهِمَا فِيۡمَا افۡتَدَتۡ بِهٖؕ​ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَعۡتَدُوۡهَا ​ۚ​ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"فَاِنۡ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنۡۢ بَعۡدُ حَتّٰى تَنۡكِحَ زَوۡجًا غَيۡرَهٗ ​ؕ فَاِنۡ طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ اَنۡ يَّتَرَاجَعَآ اِنۡ ظَنَّآ اَنۡ يُّقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ يُبَيِّنُهَا لِقَوۡمٍ يَّعۡلَمُوۡنَ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡهُنَّ بِمَعۡرُوۡفٍ​ وَلَا تُمۡسِكُوۡهُنَّ ضِرَارًا لِّتَعۡتَدُوۡا​ ۚ وَمَنۡ يَّفۡعَلۡ ذٰ لِكَ فَقَدۡ ظَلَمَ نَفۡسَهٗ ​ؕ وَلَا تَتَّخِذُوۡٓا اٰيٰتِ اللّٰهِ هُزُوًا​ وَّاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ وَمَآ اَنۡزَلَ عَلَيۡكُمۡ مِّنَ الۡكِتٰبِ وَالۡحِكۡمَةِ يَعِظُكُمۡ بِهٖ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَلَا تَعۡضُلُوۡهُنَّ اَنۡ يَّنۡكِحۡنَ اَزۡوَاجَهُنَّ اِذَا تَرَاضَوۡا بَيۡنَهُمۡ بِالۡمَعۡرُوۡفِ​ؕ ذٰ لِكَ يُوۡعَظُ بِهٖ مَنۡ كَانَ مِنۡكُمۡ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِؕ ذٰ لِكُمۡ اَزۡکٰى لَـكُمۡ وَاَطۡهَرُؕ​ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"وَالۡوَالِدٰتُ يُرۡضِعۡنَ اَوۡلَادَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِ​ لِمَنۡ اَرَادَ اَنۡ يُّتِمَّ الرَّضَاعَةَ ​ ؕ وَعَلَى الۡمَوۡلُوۡدِ لَهٗ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِالۡمَعۡرُوۡفِ​ؕ لَا تُكَلَّفُ نَفۡسٌ اِلَّا وُسۡعَهَا ۚ لَا تُضَآرَّ وَالِدَةٌ ۢ بِوَلَدِهَا وَلَا مَوۡلُوۡدٌ لَّهٗ بِوَلَدِهٖ وَعَلَى الۡوَارِثِ مِثۡلُ ذٰ لِكَ ۚ فَاِنۡ اَرَادَا فِصَالًا عَنۡ تَرَاضٍ مِّنۡهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيۡهِمَا ​ؕ وَاِنۡ اَرَدْتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡٓا اَوۡلَادَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ اِذَا سَلَّمۡتُمۡ مَّآ اٰتَيۡتُمۡ بِالۡمَعۡرُوۡفِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡكُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا يَّتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ اَرۡبَعَةَ اَشۡهُرٍ وَّعَشۡرًا ​​ۚ فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ بِالۡمَعۡرُوۡفِؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"وَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا عَرَّضۡتُمۡ بِهٖ مِنۡ خِطۡبَةِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِىۡٓ اَنۡفُسِكُمۡ​ؕ عَلِمَ اللّٰهُ اَنَّكُمۡ سَتَذۡكُرُوۡنَهُنَّ وَلٰـكِنۡ لَّا تُوَاعِدُوۡهُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلًا مَّعۡرُوۡفًا ​ؕ وَلَا تَعۡزِمُوۡا عُقۡدَةَ النِّکَاحِ حَتّٰى يَبۡلُغَ الۡكِتٰبُ اَجَلَهٗ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ يَعۡلَمُ مَا فِىۡٓ اَنۡفُسِكُمۡ فَاحۡذَرُوۡهُ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لَا جُنَاحَ عَلَيۡكُمۡ اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡهُنَّ اَوۡ تَفۡرِضُوۡا لَهُنَّ فَرِيۡضَةً  ۖۚ وَّمَتِّعُوۡهُنَّ ​ۚ عَلَى الۡمُوۡسِعِ قَدَرُهٗ وَ عَلَى الۡمُقۡتِرِ قَدَرُهٗ ​ۚ مَتَاعًا ۢ بِالۡمَعۡرُوۡفِ​​ۚ حَقًّا عَلَى الۡمُحۡسِنِيۡنَ"},{"ar":"وَاِنۡ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيۡضَةً فَنِصۡفُ مَا فَرَضۡتُمۡ اِلَّاۤ اَنۡ يَّعۡفُوۡنَ اَوۡ يَعۡفُوَا الَّذِىۡ بِيَدِهٖ عُقۡدَةُ النِّكَاحِ ​ؕ وَاَنۡ تَعۡفُوۡٓا اَقۡرَبُ لِلتَّقۡوٰى​ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَيۡنَكُمۡ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"حَافِظُوۡا عَلَى الصَّلَوٰتِ وَالصَّلٰوةِ الۡوُسۡطٰى وَقُوۡمُوۡا لِلّٰهِ قٰنِتِيۡنَ"},{"ar":"فَاِنۡ خِفۡتُمۡ فَرِجَالًا اَوۡ رُكۡبَانًا ​​ ۚ فَاِذَآ اَمِنۡتُمۡ فَاذۡکُرُوا اللّٰهَ کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡکُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا  ۖۚ وَّصِيَّةً لِّاَزۡوَاجِهِمۡ مَّتَاعًا اِلَى الۡحَـوۡلِ غَيۡرَ اِخۡرَاجٍ​​ ۚ فَاِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡکُمۡ فِىۡ مَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ مِنۡ مَّعۡرُوۡفٍؕ وَاللّٰهُ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"وَلِلۡمُطَلَّقٰتِ مَتَاعٌ ۢ بِالۡمَعۡرُوۡفِ ​ؕ حَقًّا عَلَى الۡمُتَّقِيۡنَ"},{"ar":"كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِيۡنَ خَرَجُوۡا مِنۡ دِيَارِهِمۡ وَهُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ فَقَالَ لَهُمُ اللّٰهُ مُوۡتُوۡا ثُمَّ اَحۡيَاھُمۡ​ؕ اِنَّ اللّٰهَ لَذُوۡ فَضۡلٍ عَلَى النَّاسِ وَلٰـكِنَّ اَکۡثَرَ النَّاسِ لَا يَشۡکُرُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضۡعَافًا کَثِيۡرَةً  ​ؕ وَاللّٰهُ يَقۡبِضُ وَيَبۡصُۜطُ وَ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الۡمَلَاِ مِنۡۢ بَنِىۡٓ اِسۡرَآءِيۡلَ مِنۡۢ بَعۡدِ مُوۡسٰى​ۘ اِذۡ قَالُوۡا لِنَبِىٍّ لَّهُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِىۡ سَبِيۡلِ اللّٰهِ​ؕ قَالَ هَلۡ عَسَيۡتُمۡ اِنۡ کُتِبَ عَلَيۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡا ؕ قَالُوۡا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِىۡ سَبِيۡلِ اللّٰهِ وَقَدۡ اُخۡرِجۡنَا مِنۡ دِيَارِنَا وَاَبۡنَآٮِٕنَا ​ؕ فَلَمَّا کُتِبَ عَلَيۡهِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا ​ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ​ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِى الۡعِلۡمِ وَ الۡجِسۡمِ​ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اٰيَةَ مُلۡکِهٖۤ اَنۡ يَّاۡتِيَکُمُ التَّابُوۡتُ فِيۡهِ سَکِيۡنَةٌ مِّنۡ رَّبِّکُمۡ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوۡسٰى وَاٰلُ هٰرُوۡنَ تَحۡمِلُهُ الۡمَلٰٓٮِٕكَةُ​ ؕ اِنَّ فِىۡ ذٰلِكَ لَاٰيَةً لَّـکُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُـنُوۡدِۙ قَالَ اِنَّ اللّٰهَ مُبۡتَلِيۡکُمۡ بِنَهَرٍ​ۚ فَمَنۡ شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّىۡ​ۚ وَمَنۡ لَّمۡ يَطۡعَمۡهُ فَاِنَّهٗ مِنِّىۡٓ اِلَّا مَنِ اغۡتَرَفَ غُرۡفَةً ۢ بِيَدِهٖ​​ۚ فَشَرِبُوۡا مِنۡهُ اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ ۙ قَالُوۡا لَا طَاقَةَ لَنَا الۡيَوۡمَ بِجَالُوۡتَ وَجُنُوۡدِهٖ​ؕ قَالَ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوا اللّٰهِۙ کَمۡ مِّنۡ فِئَةٍ قَلِيۡلَةٍ غَلَبَتۡ فِئَةً کَثِيۡرَةً ۢ بِاِذۡنِ اللّٰهِ​ؕ وَاللّٰهُ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَمَّا بَرَزُوۡا لِجَـالُوۡتَ وَجُنُوۡدِهٖ قَالُوۡا رَبَّنَآ اَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَّثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡکٰفِرِيۡنَؕ"},{"ar":"فَهَزَمُوۡهُمۡ بِاِذۡنِ اللّٰهِ ۙ وَقَتَلَ دَاوٗدُ جَالُوۡتَ وَاٰتٰٮهُ اللّٰهُ الۡمُلۡكَ وَالۡحِکۡمَةَ وَعَلَّمَهٗ مِمَّا يَشَآءُ ​ؕ وَلَوۡلَا دَفۡعُ اللّٰهِ النَّاسَ بَعۡضَهُمۡ بِبَعۡضٍ لَّفَسَدَتِ الۡاَرۡضُ وَلٰـکِنَّ اللّٰهَ ذُوۡ فَضۡلٍ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ​ؕ وَاِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَ"},{"ar":"تِلۡكَ الرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلٰى بَعۡضٍ​ۘ مِنۡهُمۡ مَّنۡ كَلَّمَ اللّٰهُ​ وَرَفَعَ بَعۡضَهُمۡ دَرَجٰتٍ​ؕ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلَ الَّذِيۡنَ مِنۡۢ بَعۡدِهِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ وَلٰـكِنِ اخۡتَلَفُوۡا فَمِنۡهُمۡ مَّنۡ اٰمَنَ وَمِنۡهُمۡ مَّنۡ كَفَرَ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلُوۡا وَلٰـكِنَّ اللّٰهَ يَفۡعَلُ مَا يُرِيۡدُ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ يَوۡمٌ لَّا بَيۡعٌ فِيۡهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ ​ ؕ وَالۡكٰفِرُوۡنَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ​ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ​ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ​ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ​​ۚ وَلَا يَـــُٔوۡدُهٗ حِفۡظُهُمَا ​ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ"},{"ar":"لَاۤ اِكۡرَاهَ فِى الدِّيۡنِ​ۙ  قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ​ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا​​ ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"اَللّٰهُ وَلِىُّ الَّذِيۡنَ اٰمَنُوۡا يُخۡرِجُهُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ  وَالَّذِيۡنَ كَفَرُوۡۤا اَوۡلِيٰٓـــُٔهُمُ الطَّاغُوۡتُۙ يُخۡرِجُوۡنَهُمۡ مِّنَ النُّوۡرِ اِلَى الظُّلُمٰتِ​ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِىۡ حَآجَّ اِبۡرٰهٖمَ فِىۡ رَبِّهٖۤ اَنۡ اٰتٰٮهُ اللّٰهُ الۡمُلۡكَ​ۘ اِذۡ قَالَ اِبۡرٰهٖمُ رَبِّىَ الَّذِىۡ يُحۡىٖ وَيُمِيۡتُۙ قَالَ اَنَا اُحۡىٖ وَاُمِيۡتُ​ؕ قَالَ اِبۡرٰهٖمُ فَاِنَّ اللّٰهَ يَاۡتِىۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِهَا مِنَ الۡمَغۡرِبِ فَبُهِتَ الَّذِىۡ كَفَرَ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ​ۚ"},{"ar":"اَوۡ كَالَّذِىۡ مَرَّ عَلٰى قَرۡيَةٍ وَّ هِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا ​ۚ قَالَ اَنّٰى يُحۡىٖ هٰذِهِ اللّٰهُ بَعۡدَ مَوۡتِهَا ​ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ ​ؕ قَالَ كَمۡ لَبِثۡتَ​ؕ قَالَ لَبِثۡتُ يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ​ؕ قَالَ بَلۡ لَّبِثۡتَ مِائَةَ عَامٍ فَانۡظُرۡ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡ​ۚ وَانْظُرۡ اِلٰى حِمَارِكَ وَلِنَجۡعَلَكَ اٰيَةً لِّلنَّاسِ​ وَانْظُرۡ اِلَى الۡعِظَامِ كَيۡفَ نُـنۡشِزُهَا ثُمَّ نَكۡسُوۡهَا لَحۡمًا ​ؕ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اَرِنِىۡ كَيۡفَ تُحۡىِ الۡمَوۡتٰى ؕ قَالَ اَوَلَمۡ تُؤۡمِنۡ​ؕ قَالَ بَلٰى وَلٰـكِنۡ لِّيَطۡمَٮِٕنَّ قَلۡبِىۡ​ؕ قَالَ فَخُذۡ اَرۡبَعَةً مِّنَ الطَّيۡرِ فَصُرۡهُنَّ اِلَيۡكَ ثُمَّ اجۡعَلۡ عَلٰى كُلِّ جَبَلٍ مِّنۡهُنَّ جُزۡءًا ثُمَّ ادۡعُهُنَّ يَاۡتِيۡنَكَ سَعۡيًا ​ؕ وَاعۡلَمۡ اَنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ​ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى​ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى​ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا ​ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡـكٰفِرِيۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ​ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"اَيَوَدُّ اَحَدُكُمۡ اَنۡ تَكُوۡنَ لَهٗ جَنَّةٌ مِّنۡ نَّخِيۡلٍ وَّاَعۡنَابٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُۙ لَهٗ فِيۡهَا مِنۡ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الۡكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَآءُ ۖۚ فَاَصَابَهَاۤ اِعۡصَارٌ فِيۡهِ نَارٌ فَاحۡتَرَقَتۡ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَتَفَكَّرُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَيِّبٰتِ مَا كَسَبۡتُمۡ وَمِمَّاۤ اَخۡرَجۡنَا لَـكُمۡ مِّنَ الۡاَرۡضِ وَلَا تَيَمَّمُوا الۡخَبِيۡثَ مِنۡهُ تُنۡفِقُوۡنَ وَلَسۡتُمۡ بِاٰخِذِيۡهِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِيۡهِ​ؕ وَاعۡلَمُوۡۤا اَنَّ اللّٰهَ غَنِىٌّ حَمِيۡدٌ"},{"ar":"اَلشَّيۡطٰنُ يَعِدُكُمُ الۡـفَقۡرَ وَيَاۡمُرُكُمۡ بِالۡفَحۡشَآءِ​ ۚ وَاللّٰهُ يَعِدُكُمۡ مَّغۡفِرَةً مِّنۡهُ وَفَضۡلًا ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌۚ  ۙۖ"},{"ar":"يُؤۡتِى الۡحِكۡمَةَ مَنۡ يَّشَآءُ​​ ۚ وَمَنۡ يُّؤۡتَ الۡحِكۡمَةَ فَقَدۡ اُوۡتِىَ خَيۡرًا كَثِيۡرًا​ ؕ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ"},{"ar":"وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗ ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ"},{"ar":"اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ​ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ​ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ​ ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ​ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡـتُمۡ لَا تُظۡلَمُوۡنَ"},{"ar":"لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِى الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ​ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ​ۚ لَا يَسۡـــَٔلُوۡنَ النَّاسَ اِلۡحَــافًا ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"اَلَّذِيۡنَ يَاۡكُلُوۡنَ الرِّبٰوا لَا يَقُوۡمُوۡنَ اِلَّا كَمَا يَقُوۡمُ الَّذِىۡ يَتَخَبَّطُهُ الشَّيۡطٰنُ مِنَ الۡمَسِّ​ؕ ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡۤا اِنَّمَا الۡبَيۡعُ مِثۡلُ الرِّبٰوا​ ۘ​ وَاَحَلَّ اللّٰهُ الۡبَيۡعَ وَحَرَّمَ الرِّبٰوا​ ؕ فَمَنۡ جَآءَهٗ مَوۡعِظَةٌ مِّنۡ رَّبِّهٖ فَانۡتَهٰى فَلَهٗ مَا سَلَفَؕ وَاَمۡرُهٗۤ اِلَى اللّٰهِ​ؕ وَمَنۡ عَادَ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِى الصَّدَقٰتِ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوۡا مَا بَقِىَ مِنَ الرِّبٰٓوا اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰهِ وَرَسُوۡلِهٖ​ۚ وَاِنۡ تُبۡتُمۡ فَلَـكُمۡ رُءُوۡسُ اَمۡوَالِكُمۡ​ۚ لَا تَظۡلِمُوۡنَ وَلَا تُظۡلَمُوۡنَ"},{"ar":"وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ ​ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ​ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا تُرۡجَعُوۡنَ فِيۡهِ اِلَى اللّٰهِ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَدَايَنۡتُمۡ بِدَيۡنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكۡتُبُوۡهُ ​ؕ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبٌۢ بِالۡعَدۡلِ​ وَلَا يَاۡبَ كَاتِبٌ اَنۡ يَّكۡتُبَ كَمَا عَلَّمَهُ اللّٰهُ​ فَلۡيَكۡتُبۡ ​ۚوَلۡيُمۡلِلِ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـــًٔا ​ؕ فَاِنۡ كَانَ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ سَفِيۡهًا اَوۡ ضَعِيۡفًا اَوۡ لَا يَسۡتَطِيۡعُ اَنۡ يُّمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهٗ بِالۡعَدۡلِ​ؕ وَاسۡتَشۡهِدُوۡا شَهِيۡدَيۡنِ مِنۡ رِّجَالِكُمۡ​ۚ فَاِنۡ لَّمۡ يَكُوۡنَا رَجُلَيۡنِ فَرَجُلٌ وَّامۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّهَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮهُمَا فَتُذَكِّرَ اِحۡدٰٮهُمَا الۡاُخۡرٰى​ؕ وَ لَا يَاۡبَ الشُّهَدَآءُ اِذَا مَا دُعُوۡا ​ؕ وَلَا تَسۡـــَٔمُوۡۤا اَنۡ تَكۡتُبُوۡهُ صَغِيۡرًا اَوۡ كَبِيۡرًا اِلٰٓى اَجَلِهٖ​ؕ ذٰ لِكُمۡ اَقۡسَطُ عِنۡدَ اللّٰهِ وَاَقۡوَمُ لِلشَّهَادَةِ وَاَدۡنٰۤى اَلَّا تَرۡتَابُوۡٓا اِلَّاۤ اَنۡ تَكُوۡنَ تِجَارَةً حَاضِرَةً تُدِيۡرُوۡنَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ اَلَّا تَكۡتُبُوۡهَا ​ؕ وَاَشۡهِدُوۡۤا اِذَا تَبَايَعۡتُمۡ وَلَا يُضَآرَّ كَاتِبٌ وَّلَا شَهِيۡدٌ  ؕ وَاِنۡ تَفۡعَلُوۡا فَاِنَّهٗ فُسُوۡقٌ ۢ بِكُمۡ ؕ وَ اتَّقُوا اللّٰهَ​ ؕ وَيُعَلِّمُكُمُ اللّٰهُ​ ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِنۡ كُنۡتُمۡ عَلٰى سَفَرٍ وَّلَمۡ تَجِدُوۡا كَاتِبًا فَرِهٰنٌ مَّقۡبُوۡضَةٌ ​ ؕ فَاِنۡ اَمِنَ بَعۡضُكُمۡ بَعۡضًا فَلۡيُؤَدِّ الَّذِى اؤۡتُمِنَ اَمَانَـتَهٗ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ​ؕ وَلَا تَكۡتُمُوا الشَّهَادَةَ ​ ؕ وَمَنۡ يَّكۡتُمۡهَا فَاِنَّهٗۤ اٰثِمٌ قَلۡبُهٗ​ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ عَلِيۡمٌ"},{"ar":"لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ وَاِنۡ تُبۡدُوۡا مَا فِىۡۤ اَنۡفُسِكُمۡ اَوۡ تُخۡفُوۡهُ يُحَاسِبۡكُمۡ بِهِ اللّٰهُ​ؕ فَيَـغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ​ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓٮِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ​ وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا​ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ"},{"ar":"لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ​ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ​ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ​ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ​​ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ​ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ"}]}};
const DEFAULT_QURAN = DEFAULT_QURAN_INDOPAK;

const STORAGE_DATA = "quran_data_v32";
const STORAGE_GAME = "quran_game_v32";
const STORAGE_META = "quran_meta_v31";
// Never bump these without migration — old keys still read below
const STORAGE_GAME_LEGACY = [
  "quran_game_v32","quran_game_v31","quran_game_v30","quran_game_v29","quran_game_v28",
  "quran_game_v27","quran_game_v26","quran_game_v25","quran_game_v24","quran_game_v23",
  "quran_game_v22","quran_game_v21","quran_game_v20","quran_game","qg_game","quranGardenGame"
];
const STORAGE_META_LEGACY = [
  "quran_meta_v31","quran_meta_v32","quran_meta_v30","quran_meta_v29","quran_meta_v28",
  "quran_meta_v27","quran_meta_v26","quran_meta_v25","quran_meta_v24","quran_meta_v23",
  "quran_meta_v22","quran_meta_v21","quran_meta_v20","quran_meta","qg_meta","quranGardenMeta"
];
const STORAGE_DATA_LEGACY = [
  "quran_data_v32","quran_data_v31","quran_data_v30","quran_data_v29","quran_data_v28",
  "quran_data","qg_data"
];

function _safeParseLS(key){
  try{
    var raw = localStorage.getItem(key);
    if(!raw) return null;
    return JSON.parse(raw);
  }catch(e){ return null; }
}
/** Load best game progress across old keys so HTML updates never wipe coins */
function loadBestGameState(){
  var best = null;
  var bestCoins = -1;
  STORAGE_GAME_LEGACY.forEach(function(k){
    var s = _safeParseLS(k);
    if(!s || typeof s !== 'object') return;
    var c = parseInt(s.coins,10)||0;
    var planted = 0;
    if(s.gardens){
      Object.keys(s.gardens).forEach(function(id){
        var p = (s.gardens[id]&&s.gardens[id].planted)||[];
        for(var i=0;i<p.length;i++) if(p[i]) planted++;
      });
    }
    var score = c * 1000 + planted;
    if(score > bestCoins){ bestCoins = score; best = s; }
  });
  if(!best) best = {coins:0, gardens:{}};
  if(typeof best.coins !== 'number') best.coins = parseInt(best.coins,10)||0;
  if(!best.gardens) best.gardens = {};
  return best;
}
function loadBestMeta(){
  var best = null;
  var bestScore = -1;
  STORAGE_META_LEGACY.forEach(function(k){
    var m = _safeParseLS(k);
    if(!m || typeof m !== 'object') return;
    var score = (m.streak||0)*10 + Object.keys(m.badges||{}).length*5 + ((m.milad&&m.milad.total)||0) + ((m.quizBoard&&m.quizBoard.length)||0)*3 + ((m.miladBoard&&m.miladBoard.length)||0)*3;
    if(m.playerName) score += 20;
    if(score >= bestScore){ bestScore = score; best = m; }
  });
  if(!best) best = {streak:0,lastPlay:null,dailyCount:0,dailyDate:null,badges:{},sound:true};
  if(!best.badges) best.badges = {};
  return best;
}
function loadBestQuranData(){
  for(var i=0;i<STORAGE_DATA_LEGACY.length;i++){
    var d = _safeParseLS(STORAGE_DATA_LEGACY[i]);
    if(d && typeof d === 'object' && Object.keys(d).length) return d;
  }
  return null;
}
const SURAH_META = [{"n":1,"ar":"سُورَةُ ٱلْفَاتِحَةِ","en":"Al-Faatiha","a":7},{"n":2,"ar":"سُورَةُ البَقَرَةِ","en":"Al-Baqara","a":286},{"n":3,"ar":"سُورَةُ آلِ عِمۡرَانَ","en":"Aal-i-Imraan","a":200},{"n":4,"ar":"سُورَةُ النِّسَاءِ","en":"An-Nisaa","a":176},{"n":5,"ar":"سُورَةُ المَائـِدَةِ","en":"Al-Maaida","a":120},{"n":6,"ar":"سُورَةُ الأَنۡعَامِ","en":"Al-An'aam","a":165},{"n":7,"ar":"سُورَةُ الأَعۡرَافِ","en":"Al-A'raaf","a":206},{"n":8,"ar":"سُورَةُ الأَنفَالِ","en":"Al-Anfaal","a":75},{"n":9,"ar":"سُورَةُ التَّوۡبَةِ","en":"At-Tawba","a":129},{"n":10,"ar":"سُورَةُ يُونُسَ","en":"Yunus","a":109},{"n":11,"ar":"سُورَةُ هُودٍ","en":"Hud","a":123},{"n":12,"ar":"سُورَةُ يُوسُفَ","en":"Yusuf","a":111},{"n":13,"ar":"سُورَةُ الرَّعۡدِ","en":"Ar-Ra'd","a":43},{"n":14,"ar":"سُورَةُ إِبۡرَاهِيمَ","en":"Ibrahim","a":52},{"n":15,"ar":"سُورَةُ الحِجۡرِ","en":"Al-Hijr","a":99},{"n":16,"ar":"سُورَةُ النَّحۡلِ","en":"An-Nahl","a":128},{"n":17,"ar":"سُورَةُ الإِسۡرَاءِ","en":"Al-Israa","a":111},{"n":18,"ar":"سُورَةُ الكَهۡفِ","en":"Al-Kahf","a":110},{"n":19,"ar":"سُورَةُ مَرۡيَمَ","en":"Maryam","a":98},{"n":20,"ar":"سُورَةُ طه","en":"Taa-Haa","a":135},{"n":21,"ar":"سُورَةُ الأَنبِيَاءِ","en":"Al-Anbiyaa","a":112},{"n":22,"ar":"سُورَةُ الحَجِّ","en":"Al-Hajj","a":78},{"n":23,"ar":"سُورَةُ المُؤۡمِنُونَ","en":"Al-Muminoon","a":118},{"n":24,"ar":"سُورَةُ النُّورِ","en":"An-Noor","a":64},{"n":25,"ar":"سُورَةُ الفُرۡقَانِ","en":"Al-Furqaan","a":77},{"n":26,"ar":"سُورَةُ الشُّعَرَاءِ","en":"Ash-Shu'araa","a":227},{"n":27,"ar":"سُورَةُ النَّمۡلِ","en":"An-Naml","a":93},{"n":28,"ar":"سُورَةُ القَصَصِ","en":"Al-Qasas","a":88},{"n":29,"ar":"سُورَةُ العَنكَبُوتِ","en":"Al-Ankaboot","a":69},{"n":30,"ar":"سُورَةُ الرُّومِ","en":"Ar-Room","a":60},{"n":31,"ar":"سُورَةُ لُقۡمَانَ","en":"Luqman","a":34},{"n":32,"ar":"سُورَةُ السَّجۡدَةِ","en":"As-Sajda","a":30},{"n":33,"ar":"سُورَةُ الأَحۡزَابِ","en":"Al-Ahzaab","a":73},{"n":34,"ar":"سُورَةُ سَبَإٍ","en":"Saba","a":54},{"n":35,"ar":"سُورَةُ فَاطِرٍ","en":"Faatir","a":45},{"n":36,"ar":"سُورَةُ يسٓ","en":"Yaseen","a":83},{"n":37,"ar":"سُورَةُ الصَّافَّاتِ","en":"As-Saaffaat","a":182},{"n":38,"ar":"سُورَةُ صٓ","en":"Saad","a":88},{"n":39,"ar":"سُورَةُ الزُّمَرِ","en":"Az-Zumar","a":75},{"n":40,"ar":"سُورَةُ غَافِرٍ","en":"Ghafir","a":85},{"n":41,"ar":"سُورَةُ فُصِّلَتۡ","en":"Fussilat","a":54},{"n":42,"ar":"سُورَةُ الشُّورَىٰ","en":"Ash-Shura","a":53},{"n":43,"ar":"سُورَةُ الزُّخۡرُفِ","en":"Az-Zukhruf","a":89},{"n":44,"ar":"سُورَةُ الدُّخَانِ","en":"Ad-Dukhaan","a":59},{"n":45,"ar":"سُورَةُ الجَاثِيَةِ","en":"Al-Jaathiya","a":37},{"n":46,"ar":"سُورَةُ الأَحۡقَافِ","en":"Al-Ahqaf","a":35},{"n":47,"ar":"سُورَةُ مُحَمَّدٍ","en":"Muhammad","a":38},{"n":48,"ar":"سُورَةُ الفَتۡحِ","en":"Al-Fath","a":29},{"n":49,"ar":"سُورَةُ الحُجُرَاتِ","en":"Al-Hujuraat","a":18},{"n":50,"ar":"سُورَةُ قٓ","en":"Qaaf","a":45},{"n":51,"ar":"سُورَةُ الذَّارِيَاتِ","en":"Adh-Dhaariyat","a":60},{"n":52,"ar":"سُورَةُ الطُّورِ","en":"At-Tur","a":49},{"n":53,"ar":"سُورَةُ النَّجۡمِ","en":"An-Najm","a":62},{"n":54,"ar":"سُورَةُ القَمَرِ","en":"Al-Qamar","a":55},{"n":55,"ar":"سُورَةُ الرَّحۡمَٰن","en":"Ar-Rahmaan","a":78},{"n":56,"ar":"سُورَةُ الوَاقِعَةِ","en":"Al-Waaqia","a":96},{"n":57,"ar":"سُورَةُ الحَدِيدِ","en":"Al-Hadid","a":29},{"n":58,"ar":"سُورَةُ المُجَادلَةِ","en":"Al-Mujaadila","a":22},{"n":59,"ar":"سُورَةُ الحَشۡرِ","en":"Al-Hashr","a":24},{"n":60,"ar":"سُورَةُ المُمۡتَحنَةِ","en":"Al-Mumtahana","a":13},{"n":61,"ar":"سُورَةُ الصَّفِّ","en":"As-Saff","a":14},{"n":62,"ar":"سُورَةُ الجُمُعَةِ","en":"Al-Jumu'a","a":11},{"n":63,"ar":"سُورَةُ المُنَافِقُونَ","en":"Al-Munaafiqoon","a":11},{"n":64,"ar":"سُورَةُ التَّغَابُنِ","en":"At-Taghaabun","a":18},{"n":65,"ar":"سُورَةُ الطَّلَاقِ","en":"At-Talaaq","a":12},{"n":66,"ar":"سُورَةُ التَّحۡرِيمِ","en":"At-Tahrim","a":12},{"n":67,"ar":"سُورَةُ المُلۡكِ","en":"Al-Mulk","a":30},{"n":68,"ar":"سُورَةُ القَلَمِ","en":"Al-Qalam","a":52},{"n":69,"ar":"سُورَةُ الحَاقَّةِ","en":"Al-Haaqqa","a":52},{"n":70,"ar":"سُورَةُ المَعَارِجِ","en":"Al-Ma'aarij","a":44},{"n":71,"ar":"سُورَةُ نُوحٍ","en":"Nooh","a":28},{"n":72,"ar":"سُورَةُ الجِنِّ","en":"Al-Jinn","a":28},{"n":73,"ar":"سُورَةُ المُزَّمِّلِ","en":"Al-Muzzammil","a":20},{"n":74,"ar":"سُورَةُ المُدَّثِّرِ","en":"Al-Muddaththir","a":56},{"n":75,"ar":"سُورَةُ القِيَامَةِ","en":"Al-Qiyaama","a":40},{"n":76,"ar":"سُورَةُ الإِنسَانِ","en":"Al-Insaan","a":31},{"n":77,"ar":"سُورَةُ المُرۡسَلَاتِ","en":"Al-Mursalaat","a":50},{"n":78,"ar":"سُورَةُ النَّبَإِ","en":"An-Naba","a":40},{"n":79,"ar":"سُورَةُ النَّازِعَاتِ","en":"An-Naazi'aat","a":46},{"n":80,"ar":"سُورَةُ عَبَسَ","en":"Abasa","a":42},{"n":81,"ar":"سُورَةُ التَّكۡوِيرِ","en":"At-Takwir","a":29},{"n":82,"ar":"سُورَةُ الانفِطَارِ","en":"Al-Infitaar","a":19},{"n":83,"ar":"سُورَةُ المُطَفِّفِينَ","en":"Al-Mutaffifin","a":36},{"n":84,"ar":"سُورَةُ الانشِقَاقِ","en":"Al-Inshiqaaq","a":25},{"n":85,"ar":"سُورَةُ البُرُوجِ","en":"Al-Burooj","a":22},{"n":86,"ar":"سُورَةُ الطَّارِقِ","en":"At-Taariq","a":17},{"n":87,"ar":"سُورَةُ الأَعۡلَىٰ","en":"Al-A'laa","a":19},{"n":88,"ar":"سُورَةُ الغَاشِيَةِ","en":"Al-Ghaashiya","a":26},{"n":89,"ar":"سُورَةُ الفَجۡرِ","en":"Al-Fajr","a":30},{"n":90,"ar":"سُورَةُ البَلَدِ","en":"Al-Balad","a":20},{"n":91,"ar":"سُورَةُ الشَّمۡسِ","en":"Ash-Shams","a":15},{"n":92,"ar":"سُورَةُ اللَّيۡلِ","en":"Al-Lail","a":21},{"n":93,"ar":"سُورَةُ الضُّحَىٰ","en":"Ad-Dhuhaa","a":11},{"n":94,"ar":"سُورَةُ الشَّرۡحِ","en":"Ash-Sharh","a":8},{"n":95,"ar":"سُورَةُ التِّينِ","en":"At-Tin","a":8},{"n":96,"ar":"سُورَةُ العَلَقِ","en":"Al-Alaq","a":19},{"n":97,"ar":"سُورَةُ القَدۡرِ","en":"Al-Qadr","a":5},{"n":98,"ar":"سُورَةُ البَيِّنَةِ","en":"Al-Bayyina","a":8},{"n":99,"ar":"سُورَةُ الزَّلۡزَلَةِ","en":"Az-Zalzala","a":8},{"n":100,"ar":"سُورَةُ العَادِيَاتِ","en":"Al-Aadiyaat","a":11},{"n":101,"ar":"سُورَةُ القَارِعَةِ","en":"Al-Qaari'a","a":11},{"n":102,"ar":"سُورَةُ التَّكَاثُرِ","en":"At-Takaathur","a":8},{"n":103,"ar":"سُورَةُ العَصۡرِ","en":"Al-Asr","a":3},{"n":104,"ar":"سُورَةُ الهُمَزَةِ","en":"Al-Humaza","a":9},{"n":105,"ar":"سُورَةُ الفِيلِ","en":"Al-Fil","a":5},{"n":106,"ar":"سُورَةُ قُرَيۡشٍ","en":"Quraish","a":4},{"n":107,"ar":"سُورَةُ المَاعُونِ","en":"Al-Maa'un","a":7},{"n":108,"ar":"سُورَةُ الكَوۡثَرِ","en":"Al-Kawthar","a":3},{"n":109,"ar":"سُورَةُ الكَافِرُونَ","en":"Al-Kaafiroon","a":6},{"n":110,"ar":"سُورَةُ النَّصۡرِ","en":"An-Nasr","a":3},{"n":111,"ar":"سُورَةُ المَسَدِ","en":"Al-Masad","a":5},{"n":112,"ar":"سُورَةُ الإِخۡلَاصِ","en":"Al-Ikhlaas","a":4},{"n":113,"ar":"سُورَةُ الفَلَقِ","en":"Al-Falaq","a":5},{"n":114,"ar":"سُورَةُ النَّاسِ","en":"An-Naas","a":6}];

let QURAN_DATA, state, meta, currentSurah = null, quizMode = "next", currentAudio = null, showMeaning = true;

const AudioFX = {
  ctx: null,
  enabled: true,
  init(){
    if(!this.ctx){
      try{ this.ctx = new (window.AudioContext||window.webkitAudioContext)(); }catch(e){}
    }
    if(this.ctx && this.ctx.state === 'suspended'){
      try{ this.ctx.resume(); }catch(e){}
    }
  },
  _beep(freq, dur, type, vol, slideTo){
    if(!this.enabled) return;
    try{
      this.init();
      if(!this.ctx) return;
      const t = this.ctx.currentTime;
      const o = this.ctx.createOscillator();
      const g = this.ctx.createGain();
      o.type = type || 'sine';
      o.frequency.setValueAtTime(freq, t);
      if(slideTo) o.frequency.exponentialRampToValueAtTime(Math.max(40, slideTo), t + dur);
      g.gain.setValueAtTime(Math.max(0.001, vol || 0.12), t);
      g.gain.exponentialRampToValueAtTime(0.001, t + dur);
      o.connect(g); g.connect(this.ctx.destination);
      o.start(t); o.stop(t + dur + 0.02);
    }catch(e){}
  },
  playCorrect(){
    if(!this.enabled) return;
    this._beep(523, 0.12, 'sine', 0.14, 780);
    setTimeout(()=>{ this._beep(880, 0.16, 'sine', 0.12); }, 90);
  },
  playWrong(){
    if(!this.enabled) return;
    this._beep(180, 0.18, 'sawtooth', 0.1, 90);
  },
  playClick(){
    if(!this.enabled) return;
    this._beep(420, 0.05, 'triangle', 0.07);
  },
  playTap(){ this.playClick(); },
  playFlip(){
    if(!this.enabled) return;
    this._beep(320, 0.08, 'triangle', 0.08, 520);
  },
  playMatch(){
    if(!this.enabled) return;
    this._beep(600, 0.1, 'sine', 0.12, 900);
    setTimeout(()=>{ this._beep(1000, 0.14, 'sine', 0.1); }, 80);
  },
  playCoin(){
    if(!this.enabled) return;
    this._beep(980, 0.07, 'square', 0.05);
    setTimeout(()=>{ this._beep(1320, 0.1, 'square', 0.04); }, 60);
  },
  playWhoosh(){
    if(!this.enabled) return;
    this._beep(240, 0.12, 'triangle', 0.06, 120);
  },
  playNav(){
    if(!this.enabled) return;
    this._beep(520, 0.07, 'sine', 0.12, 720);
    setTimeout(()=>{ this._beep(780, 0.08, 'sine', 0.09); }, 55);
  },
  playSuccess(){
    if(!this.enabled) return;
    this._beep(523, 0.1, 'sine', 0.12);
    setTimeout(()=>{ this._beep(659, 0.1, 'sine', 0.12); }, 100);
    setTimeout(()=>{ this._beep(784, 0.18, 'sine', 0.12); }, 200);
  },
  playLock(){
    if(!this.enabled) return;
    this._beep(140, 0.15, 'square', 0.06);
  },
  playPop(){
    if(!this.enabled) return;
    this._beep(700, 0.06, 'triangle', 0.08, 1100);
  },
  playSoft(){
    if(!this.enabled) return;
    this._beep(360, 0.07, 'sine', 0.05);
  },
  playStart(){
    if(!this.enabled) return;
    this._beep(440, 0.08, 'sine', 0.1, 660);
    setTimeout(()=>{ this._beep(880, 0.12, 'sine', 0.09); }, 100);
  },
  playTick(){
    if(!this.enabled) return;
    this._beep(900, 0.03, 'square', 0.035);
  },
  playToggle(){
    if(!this.enabled) return;
    this._beep(480, 0.05, 'triangle', 0.07, 620);
  },
  playBismillah(){
    // Real qira'at — opening splash ONLY (once)
    if(window.__bismillahPlayed || window.__bismillahPlaying) return;
    try{
      this.stopBismillah();
      var a = document.getElementById('bismillahAudioTag');
      if(!a){
        a = new Audio('audio/bismillah.mp3');
      }
      try{ a.currentTime = 0; }catch(e){}
      a.volume = 1.0;
      a.muted = false;
      this._bismillahAudio = a;
      window.__bismillahPlaying = true;
      var p = a.play();
      if(p && p.then){
        p.then(function(){ window.__bismillahPlayed = true; })
         .catch(function(){
           window.__bismillahPlaying = false;
           try{
             var b = new Audio('audio/bismillah.mp3');
             b.volume = 1;
             AudioFX._bismillahAudio = b;
             b.play().then(function(){ window.__bismillahPlayed = true; }).catch(function(){});
           }catch(e2){}
         });
      }
      a.onended = function(){ window.__bismillahPlaying = false; };
    }catch(e){ window.__bismillahPlaying = false; }
  },
  stopBismillah(){
    try{
      if(this._bismillahAudio){
        this._bismillahAudio.pause();
        try{ this._bismillahAudio.currentTime = 0; }catch(e){}
        this._bismillahAudio = null;
      }
      window.__bismillahPlaying = false;
    }catch(e){}
  }
};



function loadAll(){
  try { QURAN_DATA = JSON.parse(localStorage.getItem(STORAGE_DATA)) || structuredClone(DEFAULT_QURAN); }
  catch(e){ QURAN_DATA = structuredClone(DEFAULT_QURAN); }
  // Always sync Arabic text + ayah count from embedded defaults (fixes old/wrong cache)
  try {
    const src = (typeof currentScript !== 'undefined' && currentScript === 'uthmani')
      ? DEFAULT_QURAN_UTHMANI : DEFAULT_QURAN_INDOPAK;
    Object.keys(src).forEach(function(id){
      const def = src[id];
      if(!def || !def.ayat) return;
      if(!QURAN_DATA[id]) {
        QURAN_DATA[id] = structuredClone(def);
      } else {
        // preserve progress length; refresh text
        QURAN_DATA[id].nameAr = def.nameAr || QURAN_DATA[id].nameAr;
        QURAN_DATA[id].nameTa = def.nameTa || QURAN_DATA[id].nameTa;
        QURAN_DATA[id].surahNum = def.surahNum;
        QURAN_DATA[id].ayat = def.ayat.map(function(a){ return { ar: a.ar }; });
      }
    });
  } catch(e){}
  try {
    state = loadBestGameState();
  } catch(e){ state = {coins:0, gardens:{}}; }
  Object.keys(QURAN_DATA).forEach(id=>{
    const need = QURAN_DATA[id].ayat.length;
    if(!state.gardens[id]) state.gardens[id] = {planted: Array(need).fill(false)};
    else if(state.gardens[id].planted.length !== need){
      const old = state.gardens[id].planted;
      state.gardens[id].planted = Array.from({length:need}, (_,i)=>!!old[i]);
    }
  });
  try { meta = loadBestMeta(); }
  catch(e){ meta = {streak:0,lastPlay:null,dailyCount:0,dailyDate:null,badges:{},sound:true}; }
  AudioFX.enabled = meta.sound !== false;
  // Persist recovered progress into current keys (survives future HTML uploads)
  try{ localStorage.setItem(STORAGE_GAME, JSON.stringify(state)); }catch(e){}
  try{ localStorage.setItem(STORAGE_META, JSON.stringify(meta)); }catch(e){}
}
function saveData(){
  try{ localStorage.setItem(STORAGE_DATA, JSON.stringify(QURAN_DATA)); }catch(e){ console.warn('saveData', e); }
}
function saveGame(){
  try{
    if(!state) state = {coins:0, gardens:{}};
    localStorage.setItem(STORAGE_GAME, JSON.stringify(state));
    // mirror stable alias so future key bumps still find coins
    localStorage.setItem('quran_game_stable', JSON.stringify(state));
  }catch(e){ console.warn('saveGame', e); }
}
function saveMeta(){
  try{
    if(!meta) meta = {};
    if(meta.playerName){
      try{ localStorage.setItem('qg_player_name', meta.playerName); }catch(e2){}
    }
    localStorage.setItem(STORAGE_META, JSON.stringify(meta));
    localStorage.setItem('quran_meta_stable', JSON.stringify(meta));
  }catch(e){ console.warn('saveMeta', e); }
}
function saveAllProgress(){
  try{ saveData(); }catch(e){}
  try{ saveGame(); }catch(e){}
  try{ saveMeta(); }catch(e){}
}

function todayStr(){ return new Date().toISOString().slice(0,10); }
function updateStreak(){
  const t = todayStr();
  if(meta.lastPlay === t) return;
  const y = new Date(); y.setDate(y.getDate()-1);
  if(meta.lastPlay === y.toISOString().slice(0,10)) meta.streak = (meta.streak||0)+1;
  else meta.streak = 1;
  meta.lastPlay = t;
  saveMeta();
}
function addDaily(){
  const t = todayStr();
  if(meta.dailyDate !== t){ meta.dailyCount=0; meta.dailyDate=t; }
  meta.dailyCount = (meta.dailyCount||0)+1;
  if(meta.dailyCount === 5){ state.coins += 25; saveGame(); alert(_('msg_daily_goal')); }
  saveMeta();
  updateDailyUI();
}
function updateDailyUI(){
  const c = meta.dailyCount||0;
  document.getElementById('dailyLabel').textContent = c + ' / 5';
  document.getElementById('dailyFill').style.width = Math.min(100, c/5*100) + '%';
}
function updateHeader(){
  document.getElementById('coinCount').textContent = state.coins;
  try{
    document.querySelectorAll('.coin-spin').forEach(function(el){
      el.classList.add('fast');
      setTimeout(function(){ el.classList.remove('fast'); }, 900);
    });
    try{ if(typeof AudioFX!=='undefined'&&AudioFX.playCoin) AudioFX.playCoin(); }catch(e){}
  }catch(e){}
  document.getElementById('streakCount').textContent = meta.streak||0;
  (function(){var sb=document.getElementById('soundBtn');if(sb){var on=meta.sound!==false;sb.innerHTML='<img src="icons/sound.png" alt="" class="header-sound-icon" style="opacity:'+(on?'1':'0.35')+'">';sb.title=on?'சப்தம் ON':'சப்தம் OFF';}})();
}

function shuffle(a){ const x=a.slice(); for(let i=x.length-1;i>0;i--){const j=Math.floor(Math.random()*(i+1));[x[i],x[j]]=[x[j],x[i]];} return x; }


/* ===== Home Hub (new UI) ===== */

/* Keep back buttons as icon — I18N must not replace them */
function ensureBackIcons(){
  var iconHtml = '<img src="icons/back.png" alt="Back" class="back-ico">';
  var nodes = document.querySelectorAll(
    'button.back-btn, button.back-btn-ico, button.home-back-hub, button[id*="Back"], button[id*="back"]'
  );
  nodes.forEach(function(btn){
    if(btn.id === 'gameQuitBtn') return; // not a back icon
    // skip if not a navigation back
    var id = (btn.id||'');
    var cls = (btn.className||'');
    if(id.indexOf('ack') === -1 && id.indexOf('Back') === -1 && cls.indexOf('back') === -1) return;
    if(btn.querySelector && btn.querySelector('img.back-ico')) {
      // still strip text
      Array.prototype.slice.call(btn.childNodes).forEach(function(n){
        if(n.nodeType === 3) n.textContent = '';
      });
      return;
    }
    btn.innerHTML = iconHtml;
    btn.setAttribute('aria-label', 'Back');
    btn.classList.add('back-btn-ico');
    if(btn.hasAttribute('data-i18n')) btn.removeAttribute('data-i18n');
  });
}


/* Settings screen tiles */
function updateSettingsSoundUI(){
  var st = document.getElementById('settingsSoundState');
  if(!st) return;
  var on = (typeof meta==='undefined' || meta.sound !== false);
  st.textContent = on ? 'ON' : 'OFF';
  st.style.color = on ? '#86efac' : '#fca5a5';
}

function isAppFullscreen(){
  return !!(document.fullscreenElement || document.webkitFullscreenElement || document.msFullscreenElement);
}
function updateFsUI(){
  var st = document.getElementById('settingsFsState');
  if(!st) return;
  var on = isAppFullscreen();
  st.textContent = on ? 'ON' : 'OFF';
  st.style.color = on ? '#86efac' : '#fca5a5';
}
function toggleAppFullscreen(){
  try{
    if(isAppFullscreen()){
      var exit = document.exitFullscreen || document.webkitExitFullscreen || document.msExitFullscreen;
      if(exit) exit.call(document);
    } else {
      var el = document.documentElement;
      var req = el.requestFullscreen || el.webkitRequestFullscreen || el.msRequestFullscreen;
      if(req) req.call(el);
      else {
        alert('இந்த browser Full Screen support பண்ணாது');
        return;
      }
    }
  }catch(e){
    console.warn('fs', e);
    alert('Full Screen fail: ' + (e && e.message ? e.message : e));
  }
  setTimeout(updateFsUI, 200);
}
document.addEventListener('fullscreenchange', function(){ try{ updateFsUI(); }catch(e){} });
document.addEventListener('webkitfullscreenchange', function(){ try{ updateFsUI(); }catch(e){} });

function initSettingsScreen(){
  updateSettingsSoundUI();
  try{ if(typeof renderThemeGrid==='function') renderThemeGrid(); }catch(e){}
  if(window.__settingsBound) return;
  window.__settingsBound = true;
  document.addEventListener('click', function(ev){
    var tile = ev.target.closest && ev.target.closest('.settings-tile');
    if(!tile) return;
    var set = tile.getAttribute('data-set');
    if(set==='font'){
      try{ if(typeof switchScreen==='function') switchScreen('screenFont'); }catch(e){}
      return;
    }
    if(set==='themes'){
      var p = document.getElementById('settingsThemesPanel');
      if(p) p.scrollIntoView({behavior:'smooth', block:'start'});
      try{ if(typeof renderThemeGrid==='function') renderThemeGrid(); }catch(e){}
      return;
    }
    if(set==='about'){
      try{
        var ov = document.getElementById('adminOverlay');
        if(ov) ov.classList.add('active');
      }catch(e){}
      return;
    }
    if(set==='sound'){
      try{
        if(typeof meta!=='undefined'){
          meta.sound = !(meta.sound !== false);
          if(typeof AudioFX!=='undefined') AudioFX.enabled = meta.sound;
          if(typeof saveMeta==='function') saveMeta();
          if(typeof updateHeader==='function') updateHeader();
        }
        updateSettingsSoundUI();
      }catch(e){}
      return;
    }
    if(set==='lang'){
      try{
        if(typeof I18N!=='undefined' && typeof I18N.toggle==='function') I18N.toggle();
        else {
          var hb = document.getElementById('headerLangBtn');
          if(hb) hb.click();
        }
      }catch(e){}
      return;
    }
    if(set==='fullscreen'){
      try{ toggleAppFullscreen(); }catch(e){}
      return;
    }
  }, true);
}

function showHomeHub(showHub){
  var hub = document.getElementById('homeHub');
  var levels = document.getElementById('homeLevels');
  if(!hub || !levels) return;
  if(showHub){
    hub.style.display = '';
    levels.style.display = 'none';
  } else {
    hub.style.display = 'none';
    levels.style.display = '';
    try{ if(typeof renderPlotsGrid==='function') renderPlotsGrid(); }catch(e){}
    try{ if(typeof renderHomeHadiths==='function') renderHomeHadiths(); }catch(e){}
    try{ if(typeof renderLevelBar==='function') renderLevelBar(); }catch(e){}
  }
}
function syncHomeDaily(){
  var el = document.getElementById('homeDailyLabel');
  if(!el) return;
  var c = (typeof meta!=='undefined' && meta.dailyCount) ? meta.dailyCount : 0;
  el.textContent = c + ' / 5';
  try{
    var dl = document.getElementById('dailyLabel');
    if(dl && dl.textContent) el.textContent = dl.textContent;
  }catch(e){}
}
function routeHomeGo(go){
  if(!go) return;
  if(go === 'garden'){
    showHomeHub(false);
    return;
  }
  if(go === 'lang'){
    try{
      if(typeof I18N!=='undefined' && typeof I18N.toggle==='function') I18N.toggle();
      else {
        var hb = document.getElementById('headerLangBtn');
        if(hb) hb.click();
      }
    }catch(e){}
    return;
  }
  if(go === 'sound'){
    try{
      if(typeof meta!=='undefined'){
        meta.sound = !(meta.sound !== false);
        if(typeof AudioFX!=='undefined') AudioFX.enabled = meta.sound;
        if(typeof saveMeta==='function') saveMeta();
        if(typeof updateHeader==='function') updateHeader();
      }
    }catch(e){}
    return;
  }
  if(go === 'about'){
    try{
      if(typeof closeSideMenu==='function') closeSideMenu();
      var ov = document.getElementById('adminOverlay');
      if(ov) ov.classList.add('active');
    }catch(e){}
    return;
  }
  // Open real screens (same as side menu)
  if(typeof switchScreen === 'function'){
    try{ switchScreen(go); }catch(e){ console.warn('switch', go, e); }
  }
  try{
    if(go==='screenSalawat' && typeof initSalawat==='function') initSalawat();
    if(go==='screenQuiz' && typeof initQuiz==='function') initQuiz();
    if(go==='screenDuel' && typeof initDuel==='function') initDuel();
    if(go==='screenMilad' && typeof initMilad==='function') initMilad();
    if(go==='screenDhikr' && typeof initDhikr==='function') initDhikr();
    if(go==='screenDua' && typeof initDua==='function') initDua();
    if(go==='screenNabiDua' && typeof initNabiDua==='function') initNabiDua();
    if(go==='screenHadees' && typeof renderHadeesScreen==='function') renderHadeesScreen();
    if(go==='screenJuz'){
      if(typeof initJuzFilterUI==='function') initJuzFilterUI();
      if(typeof renderJuzSettingsList==='function') renderJuzSettingsList();
    }
    if(go==='screenPrayer' && typeof initPrayerTimes==='function') initPrayerTimes();
    if(go==='screenProfile' && typeof renderThemeGrid==='function') renderThemeGrid();
    if(go==='screenFont'){ try{ if(typeof updateScriptUI==='function') updateScriptUI(); if(typeof updateTamilFontUI==='function') updateTamilFontUI(); if(typeof updateArabicFontUI==='function') updateArabicFontUI(); }catch(e){} }
    if(go==='screenBadges' && typeof renderBadges==='function') renderBadges();
  }catch(e){ console.warn('init after nav', e); }
}

function initHomeHub(){
  // Document-level delegation so it always works
  if(!window.__homeHubClickBound){
    window.__homeHubClickBound = true;
    document.addEventListener('click', function(ev){
      var tile = ev.target.closest && ev.target.closest('.home-tile');
      if(tile){
        ev.preventDefault();
        var go = tile.getAttribute('data-go');
        routeHomeGo(go);
        return;
      }
      var back = ev.target.closest && ev.target.closest('#homeBackHub');
      if(back){
        ev.preventDefault();
        showHomeHub(true);
        if(typeof switchScreen==='function') switchScreen('screenSelect');
        return;
      }
      var play = ev.target.closest && ev.target.closest('#homeDailyPlay');
      if(play){
        ev.preventDefault();
        routeHomeGo('screenGames');
        return;
      }
      var bn = ev.target.closest && ev.target.closest('.hbn-item');
      if(bn){
        ev.preventDefault();
        var id = bn.getAttribute('data-bn');
        var nav = document.getElementById('homeBottomNav');
        if(nav) nav.querySelectorAll('.hbn-item').forEach(function(b){ b.classList.toggle('active', b===bn); });
        if(id==='home'){
          if(typeof switchScreen==='function') switchScreen('screenSelect');
          showHomeHub(true);
          return;
        }
        if(id==='settings'){
          try{ routeHomeGo('screenProfile'); }catch(e){
            try{ if(typeof switchScreen==='function') switchScreen('screenProfile'); }catch(e2){}
          }
          return;
        }
        routeHomeGo(id);
      }
    }, true);
  }
  syncHomeDaily();
  showHomeHub(true);
  try{ document.body.classList.add('on-home'); }catch(e){}
}

function switchScreen(id){
  try{ if(id==='screenPrayerLog' && typeof window.initPrayerLog==='function') window.initPrayerLog(); }catch(e){}

  try{ if(id==='screenPrayer' && typeof window.initPrayer==='function') window.initPrayer(); }catch(e){}

  try{
    document.body.classList.toggle('on-home', id === 'screenSelect');
    if(id === 'screenSelect'){
      try{ syncHomeDaily(); }catch(e){}
      try{ showHomeHub(true); }catch(e){}
    }
  }catch(e){}

  if(id !== 'screenGarden'){ /* keep quiz only on garden if needed */ }
  document.querySelectorAll('.screen').forEach(s=>s.classList.remove('active'));
  const scr = document.getElementById(id);
  if(scr) scr.classList.add('active');
  if(id==='screenBadges') renderBadges();
  if(id==='screenDhikr') initDhikr();
  if(id==='screenDua') initDua();
  if(id==='screenNabiDua') initNabiDua();
  if(id==='screenHadees' && typeof renderHadeesScreen==='function') renderHadeesScreen();
  if(id==='screenFinder') initFinder();
  if(id==='screenJuzPlayer'){ /* juz audio menu removed */ }
  if(id==='screenProfile'){
    try{ renderThemeGrid(); }catch(e){}
    try{ initSettingsScreen(); }catch(e){}
  }
  if(id==='screenFont'){
    try{ if(typeof updateScriptUI==='function') updateScriptUI(); if(typeof updateTamilFontUI==='function') updateTamilFontUI(); if(typeof updateArabicFontUI==='function') updateArabicFontUI(); }catch(e){}
  }
  if(id==='screenJuz'){
    try{ if(typeof initJuzFilterUI==='function') initJuzFilterUI(); }catch(e){}
  }
  if(id==='screenPrayer'){
    try{ if(typeof initPrayerTimes==='function') initPrayerTimes(); }catch(e){}
  }
  if(id==='screenDuel'){
    try{ if(typeof initDuel==='function') initDuel(); }catch(e){}
  }
  try{ setTimeout(ensureBackIcons, 0); }catch(e){}
}

function surahIdForNum(n){
  if(n===1){
    if(QURAN_DATA.fatiha) return 'fatiha';
  }
  const key = 's'+n;
  if(QURAN_DATA[key]) return key;
  // find by surahNum
  for(const id of Object.keys(QURAN_DATA)){
    if(QURAN_DATA[id].surahNum===n) return id;
  }
  return key;
}


/* ===== Juz filter (Settings + Home) ===== */
const JUZ_FILTER_KEY = 'quran_juz_filter_v1';
let selectedJuz = 0; // 0 = all

/* ===== Full 30 Juz — traditional names + Madinah coverage ===== */
// Opening-phrase names (common Hifz / Indo-Pak naming)
const JUZ_META = {
  /* Juz = 30 parts split by AYAH, not by Surah name.
     start/end = {s: surahNum, a: ayahNum} */
  1:  { name: "Alif-Lam-Meem",      start: {s:1,a:1},   end: {s:2,a:141},  surahs: [1,2] },
  2:  { name: "Sayaqool",           start: {s:2,a:142}, end: {s:2,a:252},  surahs: [2] },
  3:  { name: "Tilka 'r-Rusul",     start: {s:2,a:253}, end: {s:3,a:92},   surahs: [2,3] },
  4:  { name: "Lan Tana Lu",        start: {s:3,a:93},  end: {s:4,a:23},   surahs: [3,4] },
  5:  { name: "Wa'l-Muhsanat",      start: {s:4,a:24},  end: {s:4,a:147},  surahs: [4] },
  6:  { name: "La Yuhibbu-llah",    start: {s:4,a:148}, end: {s:5,a:81},   surahs: [4,5] },
  7:  { name: "Wa Iza Sami'u",      start: {s:5,a:82},  end: {s:6,a:110},  surahs: [5,6] },
  8:  { name: "Wa Lau Annana",      start: {s:6,a:111}, end: {s:7,a:87},   surahs: [6,7] },
  9:  { name: "Qal al-Mala'u",      start: {s:7,a:88},  end: {s:8,a:40},   surahs: [7,8] },
  10: { name: "Wa'lamu",            start: {s:8,a:41},  end: {s:9,a:92},   surahs: [8,9] },
  11: { name: "Ya'tadhiruna",       start: {s:9,a:93},  end: {s:11,a:5},   surahs: [9,10,11] },
  12: { name: "Wa Ma Min Dabbah",   start: {s:11,a:6},  end: {s:12,a:52},  surahs: [11,12] },
  13: { name: "Wa Ma Ubri'u",       start: {s:12,a:53}, end: {s:14,a:52},  surahs: [12,13,14] },
  14: { name: "Rubama",             start: {s:15,a:1},  end: {s:16,a:128}, surahs: [15,16] },
  15: { name: "Subhan-alladhi",     start: {s:17,a:1},  end: {s:18,a:74},  surahs: [17,18] },
  16: { name: "Qal Alam",           start: {s:18,a:75}, end: {s:20,a:135}, surahs: [18,19,20] },
  17: { name: "Iqtaraba li-n-Nas",  start: {s:21,a:1},  end: {s:22,a:78},  surahs: [21,22] },
  18: { name: "Qad Aflaha",         start: {s:23,a:1},  end: {s:25,a:20},  surahs: [23,24,25] },
  19: { name: "Wa Qal alladhina",   start: {s:25,a:21}, end: {s:27,a:55},  surahs: [25,26,27] },
  20: { name: "A'man Khalaq",       start: {s:27,a:56}, end: {s:29,a:45},  surahs: [27,28,29] },
  21: { name: "Utlu Ma Uhiya",      start: {s:29,a:46}, end: {s:33,a:30},  surahs: [29,30,31,32,33] },
  22: { name: "Wa Man Yaqnut",      start: {s:33,a:31}, end: {s:36,a:27},  surahs: [33,34,35,36] },
  23: { name: "Wa Mali",            start: {s:36,a:28}, end: {s:39,a:31},  surahs: [36,37,38,39] },
  24: { name: "Faman Azlamu",       start: {s:39,a:32}, end: {s:41,a:46},  surahs: [39,40,41] },
  25: { name: "Ilaihi Yuraddu",     start: {s:41,a:47}, end: {s:45,a:37},  surahs: [41,42,43,44,45] },
  26: { name: "Ha' Meem",           start: {s:46,a:1},  end: {s:50,a:45},  surahs: [46,47,48,49,50] },
  27: { name: "Qala Fama Khatbukum",start: {s:51,a:1},  end: {s:57,a:29},  surahs: [51,52,53,54,55,56,57] },
  28: { name: "Qad Sami'a-llah",    start: {s:58,a:1},  end: {s:66,a:12},  surahs: [58,59,60,61,62,63,64,65,66] },
  29: { name: "Tabarak alladhi",    start: {s:67,a:1},  end: {s:77,a:50},  surahs: [67,68,69,70,71,72,73,74,75,76,77] },
  30: { name: "'Amma (Juz Amma)",   start: {s:78,a:1},  end: {s:114,a:6}, surahs: [78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114] }
};

// Derived maps (old JUZ_FIRST / bare arrays removed)
const JUZ_SURAHS = {};
const JUZ_FIRST_SURAH = [];
for (let __j = 1; __j <= 30; __j++) {
  JUZ_SURAHS[__j] = (JUZ_META[__j].surahs || []).slice();
  JUZ_FIRST_SURAH[__j - 1] = JUZ_SURAHS[__j][0];
}

function juzName(j){
  const m = JUZ_META[j];
  return m ? m.name : ('Juz ' + j);
}
function surahEn(n){
  const m = (typeof SURAH_META !== 'undefined') ? SURAH_META.find(function(x){ return x.n === n; }) : null;
  return m ? m.en : ('Surah ' + n);
}
/** Ayah-based range text: "Al-Baqarah 2:142 → Al-Baqarah 2:252" */
function juzRange(j){
  const m = JUZ_META[j];
  if(!m || !m.start || !m.end) return '';
  return surahEn(m.start.s) + ' ' + m.start.s + ':' + m.start.a +
    '  →  ' + surahEn(m.end.s) + ' ' + m.end.s + ':' + m.end.a;
}
function juzStartLabel(j){
  const m = JUZ_META[j];
  if(!m || !m.start) return '';
  return surahEn(m.start.s) + ' · ஆயத்து ' + m.start.a;
}
function juzEndLabel(j){
  const m = JUZ_META[j];
  if(!m || !m.end) return '';
  return surahEn(m.end.s) + ' · ஆயத்து ' + m.end.a;
}

function getSurahNumsForJuz(j){
  if(!j || j < 1 || j > 30) return null;
  const list = JUZ_SURAHS[j];
  return list ? list.slice() : null;
}

/** Primary juz for a surah (first juz that contains it) */
function primaryJuzForSurah(surahNum){
  const n = parseInt(surahNum, 10) || 0;
  for(let j = 1; j <= 30; j++){
    const list = JUZ_SURAHS[j] || [];
    if(list.indexOf(n) >= 0) return j;
  }
  return 0;
}

function allJuzForSurah(surahNum){
  const n = parseInt(surahNum, 10) || 0;
  const out = [];
  for(let j = 1; j <= 30; j++){
    if((JUZ_SURAHS[j]||[]).indexOf(n) >= 0) out.push(j);
  }
  return out;
}

function loadJuzFilter(){
  try {
    const v = parseInt(localStorage.getItem(JUZ_FILTER_KEY) || '0', 10);
    selectedJuz = (v >= 0 && v <= 30) ? v : 0;
  } catch(e){ selectedJuz = 0; }
}

function saveJuzFilter(){
  try { localStorage.setItem(JUZ_FILTER_KEY, String(selectedJuz)); } catch(e){}
}

function juzFilterLabelText(){
  if(!selectedJuz) return 'எல்லா ஜுஸ்வு · 114 சூரா';
  const nm = juzName(selectedJuz);
  const rg = juzRange(selectedJuz);
  const nums = getSurahNumsForJuz(selectedJuz) || [];
  return 'ஜுஸ்வு ' + selectedJuz + ' · ' + nm + (rg ? ' · ' + rg : '') + ' · ' + nums.length + ' சூரா';
}

function setJuzFilter(j){
  selectedJuz = j;
  saveJuzFilter();
  document.querySelectorAll('.juz-chip, .juz-pill').forEach(function(c){
    const v = parseInt(c.getAttribute('data-juz') || '0', 10);
    c.classList.toggle('active', v === selectedJuz);
  });
  const lab = document.getElementById('juzFilterLabel');
  if(lab) lab.textContent = juzFilterLabelText();
  if(typeof renderPlotsGrid === 'function') renderPlotsGrid();
  try{ if(typeof renderHomeHadiths==='function') renderHomeHadiths(); }catch(e){}
  if(typeof renderJuzSettingsList === 'function') {
    try { renderJuzSettingsList(); } catch(e){}
  }
}

function buildJuzChips(container, compact){
  if(!container) return;
  container.innerHTML = '';
  if(compact){
    container.classList.add('home-juz-scroll');
    container.style.overflowX = 'auto';
    container.style.webkitOverflowScrolling = 'touch';
    container.style.touchAction = 'pan-x';
    const wrap = document.createElement('div');
    wrap.className = 'juz-pill-track';
    const all = document.createElement('button');
    all.type = 'button';
    all.className = 'juz-pill juz-pill-all' + (selectedJuz === 0 ? ' active' : '');
    all.setAttribute('data-juz', '0');
    all.textContent = 'எல்லாம்';
    all.onclick = function(){ setJuzFilter(0); };
    wrap.appendChild(all);
    for(let j = 1; j <= 30; j++){
      const b = document.createElement('button');
      b.type = 'button';
      b.className = 'juz-pill' + (selectedJuz === j ? ' active' : '');
      b.setAttribute('data-juz', String(j));
      b.textContent = String(j);
      if(j === 30) b.title = 'Juz Amma';
      b.onclick = function(){ setJuzFilter(j); };
      wrap.appendChild(b);
    }
    container.appendChild(wrap);
    return;
  }
  const all = document.createElement('button');
  all.type = 'button';
  all.className = 'juz-chip juz-chip-all' + (selectedJuz === 0 ? ' active' : '');
  all.setAttribute('data-juz', '0');
  all.textContent = _('msg_all_juz');
  all.onclick = function(){ setJuzFilter(0); };
  container.appendChild(all);
  for(let j = 1; j <= 30; j++){
    const b = document.createElement('button');
    b.type = 'button';
    b.className = 'juz-chip' + (selectedJuz === j ? ' active' : '');
    b.setAttribute('data-juz', String(j));
    b.textContent = (typeof isEnLang==='function' && isEnLang() ? 'Juz ' : 'ஜுஸ் ') + j;
    if(j === 30) b.title = 'Juz Amma';
    b.onclick = function(){ setJuzFilter(j); };
    container.appendChild(b);
  }
}

function renderJuzSettingsList(){
  const host = document.getElementById('juzSettingsList');
  if(!host) return;
  let h = '<div class="juz-icon-grid">';
  for(let j = 1; j <= 30; j++){
    const iconHtml = (j <= 20)
      ? '<img class="juz-big-icon" src="icons/juz-'+j+'.png" alt="Juz '+j+'" loading="lazy">'
      : '<span class="juz-big-fallback">'+j+'</span>';
    h += '<button type="button" class="juz-icon-btn" data-juz="'+j+'" title="Juz '+j+'">' +
      iconHtml +
      '</button>';
  }
  h += '</div>';
  host.innerHTML = h;
  host.querySelectorAll('.juz-icon-btn').forEach(function(btn){
    btn.onclick = function(){
      const jn = parseInt(btn.getAttribute('data-juz'),10);
      openJuzReading(jn);
    };
  });
}

/** Juz detail — defined by START AYAH → END AYAH */
function openJuzDetail(j){
  const host = document.getElementById('juzSettingsList');
  if(!host) return;
  const m = JUZ_META[j];
  if(!m) return;
  let h = '<button type="button" class="back-btn" id="juzDetailBack">⬅ 30 ஜுஸ் பட்டியல்</button>';
  h += '<div class="juz-detail-card">';
  h += '<div class="jd-title">ஜுஸ்வு '+j+'</div>';
  h += '<div class="jd-name">'+juzName(j)+'</div>';
  h += '<div class="jd-ayah-box">';
  h += '<div class="jd-ayah-row"><span>▶️ தொடக்கம் (ஆயத்து)</span><strong>'+juzStartLabel(j)+'</strong></div>';
  h += '<div class="jd-ayah-row"><span>⏹️ முடிவு (ஆயத்து)</span><strong>'+juzEndLabel(j)+'</strong></div>';
  h += '</div>';
  h += '<button type="button" class="submit-btn" id="juzStartReadBtn" style="margin:10px 0;background:linear-gradient(135deg,#10b981,#059669)">▶️ இந்த ஆயத்திலிருந்து தொடங்கு</button>';
  h += '<p class="jd-note">ஜுஸ் <b>சூரா பெயரால் அல்ல</b> — <b>ஆயத்து எண்ணால்</b> பிரிக்கப்படும். '+
    'ஒரே சூரா (எ.கா. பகரா) பல ஜுஸ்களில் பரவும்.</p>';
  h += '<div class="jd-sub">இந்த ஆயத்து வரம்புக்குள் தொடர்புடைய சூராக்கள்</div>';
  h += '<div class="jd-surahs">';
  (m.surahs || []).forEach(function(n){
    const sm = SURAH_META.find(function(x){ return x.n === n; });
    const en = sm ? sm.en : ('Surah '+n);
    const ar = sm ? sm.ar : '';
    let tip = '';
    if(m.start.s === n && m.end.s === n) tip = 'ஆயத்து '+m.start.a+' – '+m.end.a;
    else if(m.start.s === n) tip = 'ஆயத்து '+m.start.a+' முதல் சூரா முடிவு வரை (இந்த ஜுஸில்)';
    else if(m.end.s === n) tip = 'சூரா தொடக்கம் முதல் ஆயத்து '+m.end.a+' வரை (இந்த ஜுஸில்)';
    else tip = 'முழு சூரா இந்த ஜுஸுக்குள்';
    h += '<button type="button" class="jd-surah-btn" data-n="'+n+'">' +
      '<span class="jd-n">சூரா '+n+'</span>' +
      '<span class="jd-ar" dir="rtl">'+ar+'</span>' +
      '<span class="jd-en">'+en+'</span>' +
      '<span class="jd-tip">'+tip+'</span></button>';
  });
  h += '</div></div>';
  host.innerHTML = h;
  const back = document.getElementById('juzDetailBack');
  if(back) back.onclick = function(){ renderJuzSettingsList(); };
  const startBtn = document.getElementById('juzStartReadBtn');
  if(startBtn) startBtn.onclick = function(){ openJuzReading(j); };
  host.querySelectorAll('.jd-surah-btn').forEach(function(b){
    b.onclick = function(){
      const n = parseInt(b.getAttribute('data-n'),10);
      if(typeof openGardenByNum === 'function') openGardenByNum(n);
    };
  });
}

function initJuzFilterUI(){
  loadJuzFilter();
  // Home page: NO juz number chips (user request)
  const homeBar = document.getElementById('homeJuzBar');
  if(homeBar){ homeBar.innerHTML = ''; homeBar.style.display = 'none'; }
  // Settings only: full juz list
  buildJuzChips(document.getElementById('juzFilterGrid'), false);
  const lab = document.getElementById('juzFilterLabel');
  if(lab) lab.textContent = juzFilterLabelText();
  renderJuzSettingsList();
  const allBtn = document.getElementById('juzFilterAllBtn');
  if(allBtn) allBtn.onclick = function(){ setJuzFilter(0); };
}




/* ===== Surah Level System: 12 levels × ~10 surahs, ranks, leaderboard ===== */
var SURAH_LEVEL_COUNT = 12; // 10 surahs each (last level has 4: 111-114)
var selectedSurahLevel = 1;

function getSurahLevelDef(level){
  // Level 1: 1-10, Level 2: 11-20, ... Level 11: 101-110, Level 12: 111-114
  var start = (level - 1) * 10 + 1;
  var end = Math.min(level * 10, 114);
  return { level: level, start: start, end: end, count: end - start + 1 };
}

function ensureLevelMeta(){
  if(!meta.levelProgress){
    meta.levelProgress = {
      unlocked: 1,
      selected: 1,
      ranks: {},
      completedAt: {},
      playerName: meta.playerName || 'வீரர்'
    };
  }
  if(!meta.leaderboard) meta.leaderboard = [];
  if(!meta.playerName) meta.playerName = meta.levelProgress.playerName || 'வீரர்';
  selectedSurahLevel = meta.levelProgress.selected || 1;
}

function isSurahDone(n){
  var id = surahIdForNum(n);
  var surah = QURAN_DATA[id];
  if(!surah || !surah.ayat || !surah.ayat.length) return false;
  var g = state.gardens[id] || {planted:[]};
  var P = g.planted.filter(Boolean).length;
  return P >= surah.ayat.length;
}

function surahStars(n){
  var id = surahIdForNum(n);
  var surah = QURAN_DATA[id];
  if(!surah || !surah.ayat || !surah.ayat.length) return 0;
  var g = state.gardens[id] || {planted:[]};
  var total = surah.ayat.length;
  var P = g.planted.filter(Boolean).length;
  if(P >= total && total > 0) return 3;
  if(P > 0) return Math.max(1, Math.round(P / total * 3));
  return 0;
}

function levelStats(level){
  var def = getSurahLevelDef(level);
  var done = 0, stars = 0;
  for(var n = def.start; n <= def.end; n++){
    if(isSurahDone(n)) done++;
    stars += surahStars(n);
  }
  var maxStars = def.count * 3;
  return { done: done, total: def.count, stars: stars, maxStars: maxStars, complete: done >= def.count };
}

function rankForLevel(st){
  if(!st.complete) return null;
  var pct = st.maxStars ? (st.stars / st.maxStars) : 0;
  if(pct >= 0.95) return 'diamond';
  if(pct >= 0.80) return 'platinum';
  if(pct >= 0.60) return 'gold';
  return 'silver';
}

var RANK_LABEL = {
  silver: '🥈 Silver',
  gold: '🥇 Gold',
  platinum: '💠 Platinum',
  diamond: '💎 Diamond'
};
var RANK_ORDER = { silver: 1, gold: 2, platinum: 3, diamond: 4 };

function isLevelUnlocked(level){
  ensureLevelMeta();
  if(level <= 1) return true;
  if(level <= (meta.levelProgress.unlocked || 1)) return true;
  // also unlock if previous is complete
  var prev = levelStats(level - 1);
  return prev.complete;
}

function checkLevelCompletions(){
  ensureLevelMeta();
  var changed = false;
  for(var lv = 1; lv <= SURAH_LEVEL_COUNT; lv++){
    var st = levelStats(lv);
    if(st.complete){
      if(!meta.levelProgress.ranks[lv]){
        var rank = rankForLevel(st);
        meta.levelProgress.ranks[lv] = rank;
        meta.levelProgress.completedAt[lv] = Date.now();
        // leaderboard entry
        meta.leaderboard.push({
          name: meta.playerName || 'வீரர்',
          level: lv,
          rank: rank,
          stars: st.stars,
          maxStars: st.maxStars,
          at: Date.now()
        });
        // keep last 100
        if(meta.leaderboard.length > 100) meta.leaderboard = meta.leaderboard.slice(-100);
        changed = true;
      }
      if(lv >= (meta.levelProgress.unlocked || 1) && lv < SURAH_LEVEL_COUNT){
        meta.levelProgress.unlocked = Math.max(meta.levelProgress.unlocked || 1, lv + 1);
        changed = true;
      }
    }
  }
  if(changed) saveMeta();
  return changed;
}

function setSurahLevel(lv){
  ensureLevelMeta();
  if(!isLevelUnlocked(lv)){
    alert(_('msg_finish_prev_level').replace('{n}', String(lv-1)).replace('{c}', String(getSurahLevelDef(lv-1).count)));
    return;
  }
  selectedSurahLevel = lv;
  meta.levelProgress.selected = lv;
  saveMeta();
  renderPlotsGrid();
}

function renderLevelBar(){
  ensureLevelMeta();
  checkLevelCompletions();
  var bar = document.getElementById('surahLevelBar');
  if(!bar) return;
  var h = '';
  for(var lv = 1; lv <= SURAH_LEVEL_COUNT; lv++){
    var def = getSurahLevelDef(lv);
    var st = levelStats(lv);
    var unlocked = isLevelUnlocked(lv);
    var rank = meta.levelProgress.ranks[lv];
    var cls = 'slv-chip';
    if(!unlocked) cls += ' locked';
    else if(st.complete) cls += ' done';
    else if(lv === selectedSurahLevel) cls += ' active';
    var rankIcon = rank ? ({silver:'🥈',gold:'🥇',platinum:'💠',diamond:'💎'}[rank] || '') : '';
    h += '<button type="button" class="' + cls + '" data-slv="' + lv + '"' + (unlocked ? '' : ' disabled') + '>' +
      '<span class="slv-num">L' + lv + '</span>' +
      '<span class="slv-range">' + def.start + '-' + def.end + '</span>' +
      (rankIcon ? '<span class="slv-rank">' + rankIcon + '</span>' : '') +
      (unlocked && !st.complete ? '<span class="slv-prog">' + st.done + '/' + st.total + '</span>' : '') +
      (!unlocked ? '<span class="slv-lock">🔒</span>' : '') +
    '</button>';
  }
  bar.innerHTML = h;
  bar.querySelectorAll('[data-slv]').forEach(function(btn){
    btn.onclick = function(){ setSurahLevel(parseInt(btn.getAttribute('data-slv'), 10)); };
  });
}

function renderLevelLeaderboard(level){
  ensureLevelMeta();
  var box = document.getElementById('levelLeaderboard');
  if(!box) return;
  var entries = (meta.leaderboard || []).filter(function(e){ return e.level === level; });
  entries.sort(function(a,b){ return (a.at||0) - (b.at||0); });
  var h = '<div class="llb-title">🏆 Level ' + level + ' Leaderboard</div>';
  if(!entries.length){
    h += '<div class="llb-empty">இன்னும் யாரும் முடிக்கவில்லை — நீங்களே முதல் இடம் பிடிக்கலாம்!</div>';
  } else {
    h += '<div class="llb-list">';
    entries.slice(0, 10).forEach(function(e, i){
      var place = i + 1;
      var medal = place === 1 ? '🥇' : place === 2 ? '🥈' : place === 3 ? '🥉' : place + '.';
      h += '<div class="llb-row' + (place===1?' first':'') + '">' +
        '<span class="llb-place">' + medal + '</span>' +
        '<span class="llb-name">' + (e.name||'வீரர்') + '</span>' +
        '<span class="llb-rank">' + (RANK_LABEL[e.rank]||e.rank) + '</span>' +
        '<span class="llb-stars">⭐' + (e.stars||0) + '</span>' +
      '</div>';
    });
    h += '</div>';
  }
  box.innerHTML = h;
}



function renderHomeHadiths(){
  var host = document.getElementById('homeHadithBox');
  if(!host) return;
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var HADITHS = isEn ? [
    {t:'The best of you', ar:'خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ', body:'“The best of you are those who learn the Qur’an and teach it.”', ref:'Sahih al-Bukhari 5027'},
    {t:'Intercession', ar:'اقْرَؤُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ', body:'“Recite the Qur’an, for it will come on the Day of Judgment as an intercessor for its companions.”', ref:'Sahih Muslim 804'},
    {t:'Reward per letter', ar:'مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ', body:'“Whoever recites a letter from the Book of Allah will receive a good deed for it — and a good deed is multiplied tenfold.”', ref:'Jami\' at-Tirmidhi 2910'},
    {t:'Skilled reciter', ar:'', body:'“The one who recites the Qur’an skillfully is with the noble, righteous angels; and the one who recites with difficulty gets a double reward.”', ref:'Bukhari 4937 · Muslim 798'},
    {t:'Spring of the heart', ar:'', body:'“O Allah, make the Qur’an the spring of my heart and the light of my chest.”', ref:'Musnad Ahmad 3712'},
    {t:'Do not abandon it', ar:'', body:'“Keep refreshing your knowledge of the Qur’an, for by the One in Whose Hand is my soul, it escapes faster than a camel from its rope.”', ref:'Sahih al-Bukhari 5033'},
    {t:'Parents honoured', ar:'', body:'“The parents of one who learns the Qur’an and acts upon it will be crowned with light on the Day of Judgment.”', ref:'Sunan Abu Dawud 1453'},
    {t:'People of Allah', ar:'إِنَّ لِلَّهِ أَهْلِينَ مِنَ النَّاسِ · هُمْ أَهْلُ الْقُرْآنِ، أَهْلُ اللَّهِ وَخَاصَّتُهُ', body:'“Allah has special people among mankind.” The Companions asked who they are. He ﷺ said: “They are the people of the Qur’an — the people of Allah and His chosen ones.”', ref:'Sunan Ibn Majah 215'}
  ] : [
    {t:'கற்றல் · கற்பித்தல்', ar:'خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ', body:'“உங்களில் சிறந்தவர் குர்ஆனை கற்று அதை பிறருக்குக் கற்பிப்பவராவார்.”', ref:'ஸஹீஹ் புகாரி 5027'},
    {t:'பரிந்துரை', ar:'اقْرَؤُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ', body:'“குர்ஆனை ஓதுங்கள். அது மறுமை நாளில் தன் தோழர்களுக்காக பரிந்துரை செய்யும்.”', ref:'ஸஹீஹ் முஸ்லிம் 804'},
    {t:'ஒரு எழுத்துக்கு நன்மை', ar:'مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ', body:'“அல்லாஹ்வின் வேதத்திலிருந்து ஒரு எழுத்தை ஓதுபவருக்கு ஒரு நன்மை; ஒரு நன்மை பத்து மடங்காகும்.”', ref:'ஜாமிஉத் திர்மிதி 2910'},
    {t:'திறமையான ஓதுதல்', ar:'', body:'“குர்ஆனை நன்கு ஓதுபவர் கண்ணியமான மலக்குகளுடன் இருப்பார்; சிரமப்பட்டு ஓதுபவருக்கு இரண்டு நன்மைகள் உண்டு.”', ref:'புகாரி 4937 · முஸ்லிம் 798'},
    {t:'உள்ளத்தின் வசந்தம்', ar:'', body:'“அல்லாஹ்வே! குர்ஆனை என் உள்ளத்தின் வசந்தமாகவும், என் நெஞ்சின் ஒளியாகவும் ஆக்குவாயாக.”', ref:'முஸ்னத் அஹ்மத் 3712'},
    {t:'விட்டுவிடாதீர்கள்', ar:'', body:'“குர்ஆனை தொடர்ந்து ஓதுங்கள்; ஒட்டகம் கட்டிலிருந்து தப்பிச் செல்வதை விட குர்ஆன் மனதில் இருந்து வேகமாக நீங்கிவிடும்.”', ref:'ஸஹீஹ் புகாரி 5033'},
    {t:'பெற்றோர் கௌரவம்', ar:'', body:'“குர்ஆனை கற்று அதன்படி செயல்பட்டவரின் பெற்றோருக்கு மறுமையில் ஒளி நிறைந்த கிரீடம் அணிவிக்கப்படும்.”', ref:'ஸுனன் அபூ தாவூத் 1453'},
    {t:'அல்லாஹ்வின் அஹ்லுல் குர்ஆன்', ar:'إِنَّ لِلَّهِ أَهْلِينَ مِنَ النَّاسِ · هُمْ أَهْلُ الْقُرْآنِ، أَهْلُ اللَّهِ وَخَاصَّتُهُ', body:'“அல்லாஹ்விற்கு மனிதர்களில் சில விசேஷமான மக்கள் இருக்கின்றனர்.” ஸஹாபாக்கள்: “அவர்கள் யார்?” நபி ﷺ: “அவர்கள் குர்ஆன் உடையவர்கள்; அல்லாஹ்வின் விசேஷமான அடியார்கள்.”', ref:'ஸுனன் இப்னு மாஜா 215'}
  ];
  var dua = isEn
    ? '<p class="juz-hadith-dua">اللَّهُمَّ اجْعَلْنَا مِنْ أَهْلِ الْقُرْآنِ<br><span>“O Allah, make us among the people of the Qur’an.” Āmīn.</span></p>'
    : '<p class="juz-hadith-dua">اللَّهُمَّ اجْعَلْنَا مِنْ أَهْلِ الْقُرْآنِ<br><span>“யா அல்லாஹ்! எங்களை குர்ஆனுடைய மக்களாக ஆக்குவாயாக.” ஆமீன்.</span></p>';
  var title = isEn ? 'Hadith about the Qur’an' : 'குர்ஆன் பற்றிய ஹதீஸ்கள்';
  var h = '<div class="juz-hadith-box home-hadith"><div class="juz-hadith-title">📖 '+title+'</div>';
  HADITHS.forEach(function(x, i){
    h += '<div class="juz-hadith-item"><div class="juz-hadith-num">'+(i+1)+'. '+x.t+'</div>';
    if(x.ar) h += '<div class="juz-hadith-ar">'+x.ar+'</div>';
    h += '<div class="juz-hadith-body">'+x.body+'</div>';
    h += '<div class="juz-hadith-ref">— '+x.ref+'</div></div>';
  });
  h += dua + '</div>';
  host.innerHTML = h;
}


var BUKHARI_SECTIONS = [
  {id:1,en:"Revelation",ta:"வஹீ (வேத அறிவிப்பு)",first:1,last:7},
  {id:2,en:"Belief",ta:"ஈமான் (நம்பிக்கை)",first:8,last:58},
  {id:3,en:"Knowledge",ta:"அறிவு",first:59,last:134},
  {id:4,en:"Ablutions (Wudu')",ta:"உளூ (அழுக்கு நீக்கம்)",first:135,last:247},
  {id:5,en:"Bathing (Ghusl)",ta:"குஸ்ல் (குளியல்)",first:248,last:293},
  {id:6,en:"Menstrual Periods",ta:"மாதவிடாய்",first:294,last:333},
  {id:7,en:"Rubbing hands and feet with dust (Tayammum)",ta:"தயம்மும்",first:334,last:348},
  {id:8,en:"Prayers (Salat)",ta:"தொழுகை (ஸலாத்)",first:349,last:520},
  {id:9,en:"Times of the Prayers",ta:"தொழுகை நேரங்கள்",first:522,last:602},
  {id:10,en:"Call to Prayers (Adhaan)",ta:"பாங்கு (அதான்)",first:603,last:875},
  {id:11,en:"Friday Prayer",ta:"ஜும்ஆ தொழுகை",first:876,last:941},
  {id:12,en:"Fear Prayer",ta:"பயத் தொழுகை",first:942,last:947},
  {id:13,en:"The Two Festivals (Eids)",ta:"இரண்டு பெருநாட்கள் (ஈத்)",first:948,last:989},
  {id:14,en:"Witr Prayer",ta:"வித்ர் தொழுகை",first:990,last:1004},
  {id:15,en:"Invoking Allah for Rain (Istisqaa)",ta:"மழை வேண்டித் தொழுகை (இஸ்திஸ்கா)",first:1005,last:1039},
  {id:16,en:"Eclipses",ta:"சூரிய / சந்திர கிரகணம்",first:1040,last:1066},
  {id:17,en:"Prostration During Recital of Qur'an",ta:"குர்ஆன் ஓதும்போது ஸஜ்தா",first:1067,last:1079},
  {id:18,en:"Shortening the Prayers (At-Taqseer)",ta:"தொழுகையைச் சுருக்குதல் (கஸர்)",first:1080,last:1119},
  {id:19,en:"Prayer at Night (Tahajjud)",ta:"இரவுத் தொழுகை (தஹஜ்ஜுத்)",first:1120,last:1187},
  {id:20,en:"Virtues of Prayer at Masjid Makkah and Madinah",ta:"மக்கா · மதீனா பள்ளிவாசல் சிறப்புகள்",first:1188,last:1197},
  {id:21,en:"Actions while Praying",ta:"தொழுகையில் செய்யும் செயல்கள்",first:1198,last:1223},
  {id:22,en:"Forgetfulness in Prayer",ta:"தொழுகையில் மறதி",first:1224,last:1236},
  {id:23,en:"Funerals (Al-Janaa'iz)",ta:"ஜனாஸா (இறுதிச் சடங்கு)",first:1237,last:1394},
  {id:24,en:"Obligatory Charity Tax (Zakat)",ta:"ஜகாத்",first:1395,last:1512},
  {id:25,en:"Hajj (Pilgrimage)",ta:"ஹஜ்",first:1513,last:1772},
  {id:26,en:"`Umrah (Minor pilgrimage)",ta:"உம்ரா",first:1773,last:1805},
  {id:27,en:"Pilgrims Prevented from Completing the Pilgrimage",ta:"ஹஜ் தடைபடுதல்",first:1806,last:1820},
  {id:28,en:"Penalty of Hunting while on Pilgrimage",ta:"ஹஜ்ஜில் வேட்டைத் தண்டனை",first:1821,last:1866},
  {id:29,en:"Virtues of Madinah",ta:"மதீனாவின் சிறப்புகள்",first:1867,last:1890},
  {id:30,en:"Fasting",ta:"நோன்பு",first:1891,last:2007},
  {id:31,en:"Praying at Night in Ramadaan (Taraweeh)",ta:"ரமளான் இரவுத் தொழுகை (தராவீஹ்)",first:2008,last:2013},
  {id:32,en:"Virtues of the Night of Qadr",ta:"லைலத்துல் கத்ரின் சிறப்பு",first:2014,last:2024},
  {id:33,en:"Retiring to a Mosque for Remembrance of Allah (I'tikaf)",ta:"இஃதிகாஃப்",first:2025,last:2046},
  {id:34,en:"Sales and Trade",ta:"வியாபாரம் · வர்த்தகம்",first:2047,last:2238},
  {id:35,en:"Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",ta:"சலம் (முன்பண வியாபாரம்)",first:2239,last:2256},
  {id:36,en:"Shuf'a",ta:"ஷுஃஆ (அண்டை உரிமை)",first:2257,last:2259},
  {id:37,en:"Hiring",ta:"கூலி · வாடகை",first:2260,last:2286},
  {id:38,en:"Transferance of a Debt from One Person to Another (Al-Hawaala)",ta:"கடன் மாற்றம் (ஹவாலா)",first:2287,last:2289},
  {id:39,en:"Kafalah",ta:"காஃபலா (உத்தரவாதம்)",first:2290,last:2298},
  {id:40,en:"Representation, Authorization, Business by Proxy",ta:"பிரதிநிதித்துவம் · அதிகாரம்",first:2299,last:2319},
  {id:41,en:"Agriculture",ta:"விவசாயம்",first:2320,last:2350},
  {id:42,en:"Distribution of Water",ta:"நீர் பங்கீடு",first:2351,last:2383},
  {id:43,en:"Loans, Payment of Loans, Freezing of Property, Bankruptcy",ta:"கடன் · திவால்",first:2385,last:2409},
  {id:44,en:"Khusoomaat",ta:"வழக்குகள் (குஸூமாத்)",first:2410,last:2425},
  {id:45,en:"Lost Things Picked up by Someone (Luqatah)",ta:"காணாமல் போன பொருள் (லுகதா)",first:2426,last:2439},
  {id:46,en:"Oppressions",ta:"அநீதிகள்",first:2440,last:2482},
  {id:47,en:"Partnership",ta:"கூட்டாண்மை",first:2483,last:2507},
  {id:48,en:"Mortgaging",ta:"அடமானம்",first:2508,last:2515},
  {id:49,en:"Manumission of Slaves",ta:"அடிமைகளை விடுதலை செய்தல்",first:2517,last:2559},
  {id:50,en:"Makaatib",ta:"முகத்தப் (எழுத்து ஒப்பந்தம்)",first:2560,last:2565},
  {id:51,en:"Gifts",ta:"பரிசுகள்",first:2566,last:2636},
  {id:52,en:"Witnesses",ta:"சாட்சிகள்",first:2637,last:2689},
  {id:53,en:"Peacemaking",ta:"சமாதானம்",first:2690,last:2710},
  {id:54,en:"Conditions",ta:"நிபந்தனைகள்",first:2712,last:2737},
  {id:55,en:"Wills and Testaments (Wasaayaa)",ta:"உயில் (வஸிய்யத்)",first:2738,last:2781},
  {id:56,en:"Fighting for the Cause of Allah (Jihaad)",ta:"ஜிஹாத் (அல்லாஹ்வின் பாதையில் போர்)",first:2782,last:3090},
  {id:57,en:"One-fifth of Booty to the Cause of Allah (Khumus)",ta:"போர்ச் செல்வத்தில் ஐந்தில் ஒரு பங்கு (குமுஸ்)",first:3091,last:3155},
  {id:58,en:"Jizyah and Mawaada'ah",ta:"ஜிஸ்யா · ஒப்பந்தம்",first:3157,last:3189},
  {id:59,en:"Beginning of Creation",ta:"படைப்பின் தொடக்கம்",first:3190,last:3325},
  {id:60,en:"Prophets",ta:"நபிமார்கள்",first:3326,last:3488},
  {id:61,en:"Virtues and Merits of the Prophet (pbuh) and his Companions",ta:"நபி (ஸல்) மற்றும் ஸஹாபாக்களின் சிறப்புகள்",first:3489,last:3648},
  {id:62,en:"Companions of the Prophet",ta:"நபியின் தோழர்கள் (ஸஹாபா)",first:3649,last:3775},
  {id:63,en:"Merits of the Helpers in Madinah (Ansaar)",ta:"அன்சாரிகளின் சிறப்புகள்",first:3776,last:3948},
  {id:64,en:"Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)",ta:"நபியின் போர்த்தொடர்கள் (மகாஸி)",first:3949,last:4473},
  {id:65,en:"Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))",ta:"குர்ஆன் விளக்கம் (தஃப்ஸீர்)",first:4474,last:4977},
  {id:66,en:"Virtues of the Qur'an",ta:"குர்ஆனின் சிறப்புகள்",first:4979,last:5062},
  {id:67,en:"Wedlock, Marriage (Nikaah)",ta:"திருமணம் (நிகாஹ்)",first:5063,last:5250},
  {id:68,en:"Divorce",ta:"விவாகரத்து",first:5251,last:5350},
  {id:69,en:"Supporting the Family",ta:"குடும்பப் பொறுப்பு",first:5351,last:5372},
  {id:70,en:"Food, Meals",ta:"உணவு",first:5373,last:5466},
  {id:71,en:"Sacrifice on Occasion of Birth (`Aqiqa)",ta:"அகீகா",first:5467,last:5474},
  {id:72,en:"Hunting, Slaughtering",ta:"வேட்டை · அறுத்தல்",first:5475,last:5544},
  {id:73,en:"Al-Adha Festival Sacrifice (Adaahi)",ta:"குர்பானி (அள்ஹா)",first:5545,last:5574},
  {id:74,en:"Drinks",ta:"பானங்கள்",first:5575,last:5639},
  {id:75,en:"Patients",ta:"நோயாளிகள்",first:5640,last:5677},
  {id:76,en:"Medicine",ta:"மருத்துவம்",first:5678,last:5782},
  {id:77,en:"Dress",ta:"ஆடை",first:5783,last:5969},
  {id:78,en:"Good Manners and Form (Al-Adab)",ta:"நல்லொழுக்கம் (அதப்)",first:5970,last:6226},
  {id:79,en:"Asking Permission",ta:"அனுமதி கேட்டல்",first:6227,last:6303},
  {id:80,en:"Invocations",ta:"துஆக்கள்",first:6304,last:6411},
  {id:81,en:"To make the Heart Tender (Ar-Riqaq)",ta:"இதயத்தை மென்மையாக்குதல் (ரிகாக்)",first:6412,last:6593},
  {id:82,en:"Divine Will (Al-Qadar)",ta:"தெய்வீக விதி (கதர்)",first:6594,last:6620},
  {id:83,en:"Oaths and Vows",ta:"சத்தியம் · நேர்ச்சை",first:6621,last:6707},
  {id:84,en:"Expiation for Unfulfilled Oaths",ta:"நிறைவேறாத சத்தியத்திற்கான பரிகாரம்",first:6708,last:6722},
  {id:85,en:"Laws of Inheritance (Al-Faraa'id)",ta:"வாரிசுரிமை (ஃபராஇத்)",first:6723,last:6771},
  {id:86,en:"Limits and Punishments set by Allah (Hudood)",ta:"ஹுதூத் (தண்டனைகள்)",first:6772,last:6860},
  {id:87,en:"Blood Money (Ad-Diyat)",ta:"இரத்தப்பணம் (தியத்)",first:6861,last:6917},
  {id:88,en:"Apostates",ta:"மதத்தை விட்டு விலகுதல்",first:6918,last:6939},
  {id:89,en:"(Statements made under) Coercion",ta:"வற்புறுத்தல்",first:6940,last:6952},
  {id:90,en:"Tricks",ta:"தந்திரங்கள்",first:6953,last:6981},
  {id:91,en:"Interpretation of Dreams",ta:"கனவு விளக்கம்",first:6982,last:7047},
  {id:92,en:"Afflictions and the End of the World",ta:"சோதனைகள் · உலகின் முடிவு",first:7048,last:7136},
  {id:93,en:"Judgments (Ahkaam)",ta:"தீர்ப்புகள் (அஹ்காம்)",first:7137,last:7225},
  {id:94,en:"Wishes",ta:"ஆசைகள்",first:7226,last:7245},
  {id:95,en:"Accepting Information Given by a Truthful Person",ta:"உண்மையாளரின் தகவலை ஏற்றல்",first:7246,last:7267},
  {id:96,en:"Holding Fast to the Qur'an and Sunnah",ta:"குர்ஆன் · சுன்னாவைப் பற்றிப் பிடித்தல்",first:7268,last:7370},
  {id:97,en:"Oneness, Uniqueness of Allah (Tawheed)",ta:"தவ்ஹீத் (அல்லாஹ்வின் ஒருமை)",first:7371,last:7563}
];

var ABUDAWUD_SECTIONS = [
  {id:1,num:1,en:'Purification (Kitab Al-Taharah)',ta:'தூய்மை (தஹாரா)',ar:'كتاب الطهارة',first:1,last:390},
  {id:2,num:2,en:'Prayer (Kitab Al-Salat)',ta:'தொழுகை (ஸலாத்)',ar:'كتاب الصلاة',first:391,last:1160},
  {id:3,num:3,en:'The Book Of The Prayer For Rain (Kitab al-Istisqa\')',ta:'மழை வேண்டித் தொழுகை (இஸ்திஸ்கா)',ar:'كتاب الاستسقاء',first:1161,last:1197},
  {id:4,num:4,en:'Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey',ta:'பயணத் தொழுகை',ar:'كتاب صلاة السفر',first:1198,last:1249},
  {id:5,num:5,en:'Prayer (Kitab Al-Salat): Voluntary Prayers',ta:'சுன்னத் தொழுகைகள்',ar:'كتاب التطوع',first:1250,last:1370},
  {id:6,num:6,en:'Prayer (Kitab Al-Salat): Detailed Injunctions about Ramadan',ta:'ரமளான் தொழுகை விதிகள்',ar:'كتاب رمضان',first:1371,last:1400},
  {id:7,num:7,en:'Prayer (Kitab Al-Salat): Prostration while reciting the Qur\'an',ta:'குர்ஆன் ஓதும்போது ஸஜ்தா',ar:'كتاب سجود القرآن',first:1401,last:1415},
  {id:8,num:8,en:'Prayer (Kitab Al-Salat): Detailed Injunctions about Witr',ta:'வித்ர் தொழுகை',ar:'كتاب الوتر',first:1416,last:1555},
  {id:9,num:9,en:'Zakat (Kitab Al-Zakat)',ta:'ஜகாத்',ar:'كتاب الزكاة',first:1556,last:1700},
  {id:10,num:10,en:'The Book of Lost and Found Items',ta:'காணாமல் போன பொருள் (லுகதா)',ar:'كتاب اللقطة',first:1701,last:1720},
  {id:11,num:11,en:'The Rites of Hajj (Kitab Al-Manasik Wa\'l-Hajj)',ta:'ஹஜ் · மனாஸிக்',ar:'كتاب المناسك',first:1721,last:2045},
  {id:12,num:12,en:'Marriage (Kitab Al-Nikah)',ta:'திருமணம் (நிகாஹ்)',ar:'كتاب النكاح',first:2046,last:2174},
  {id:13,num:13,en:'Divorce (Kitab Al-Talaq)',ta:'விவாகரத்து (தலாக்)',ar:'كتاب الطلاق',first:2175,last:2312},
  {id:14,num:14,en:'Fasting (Kitab Al-Siyam)',ta:'நோன்பு (ஸியாம்)',ar:'كتاب الصيام',first:2313,last:2476},
  {id:15,num:15,en:'Jihad (Kitab Al-Jihad)',ta:'ஜிஹாத்',ar:'كتاب الجهاد',first:2477,last:2787},
  {id:16,num:16,en:'Sacrifice (Kitab Al-Dahaya)',ta:'குர்பானி (தஹாயா)',ar:'كتاب الضحايا',first:2788,last:2843},
  {id:17,num:17,en:'Game (Kitab Al-Said)',ta:'வேட்டை (ஸைத்)',ar:'كتاب الصيد',first:2844,last:2861},
  {id:18,num:18,en:'Wills (Kitab Al-Wasaya)',ta:'உயில் (வஸாயா)',ar:'كتاب الوصايا',first:2862,last:2884},
  {id:19,num:19,en:'Shares of Inheritance (Kitab Al-Fara\'id)',ta:'வாரிசுரிமை (ஃபராஇத்)',ar:'كتاب الفرائض',first:2885,last:2927},
  {id:20,num:20,en:'Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai\' Wal-Imarah)',ta:'கராஜ் · ஃபை · ஆட்சி',ar:'كتاب الخراج',first:2928,last:3088},
  {id:21,num:21,en:'Funerals (Kitab Al-Jana\'iz)',ta:'ஜனாஸா',ar:'كتاب الجنائز',first:3089,last:3241},
  {id:22,num:22,en:'Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur)',ta:'சத்தியம் · நேர்ச்சை',ar:'كتاب الأيمان والنذور',first:3242,last:3325},
  {id:23,num:23,en:'Commercial Transactions (Kitab Al-Buyu)',ta:'வியாபாரம் (புயூஉ)',ar:'كتاب البيوع',first:3326,last:3415},
  {id:24,num:24,en:'Wages (Kitab Al-Ijarah)',ta:'கூலி (இஜாரா)',ar:'كتاب الإجارة',first:3416,last:3570},
  {id:25,num:25,en:'The Office of the Judge (Kitab Al-Aqdiyah)',ta:'நீதிபதி அலுவல் (அக்ளியா)',ar:'كتاب الأقضية',first:3571,last:3640},
  {id:26,num:26,en:'Knowledge (Kitab Al-Ilm)',ta:'அறிவு (இல்ம்)',ar:'كتاب العلم',first:3641,last:3668},
  {id:27,num:27,en:'Drinks (Kitab Al-Ashribah)',ta:'பானங்கள்',ar:'كتاب الأشربة',first:3669,last:3735},
  {id:28,num:28,en:'Foods (Kitab Al-At\'imah)',ta:'உணவுகள்',ar:'كتاب الأطعمة',first:3736,last:3854},
  {id:29,num:29,en:'Medicine (Kitab Al-Tibb)',ta:'மருத்துவம் (திப்)',ar:'كتاب الطب',first:3855,last:3903},
  {id:30,num:30,en:'Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)',ta:'குறி சொல்லல் · தீய சகுனம்',ar:'كتاب الكهانة والتطير',first:3904,last:3925},
  {id:31,num:31,en:'The Book of Manumission of Slaves',ta:'அடிமை விடுதலை',ar:'كتاب العتق',first:3926,last:3968},
  {id:32,num:32,en:'Dialects and Readings of the Qur\'an (Kitab Al-Huruf Wa Al-Qira\'at)',ta:'குர்ஆன் எழுத்து · கிராஅத்',ar:'كتاب الحروف والقراءات',first:3969,last:4008},
  {id:33,num:33,en:'Hot Baths (Kitab Al-Hammam)',ta:'சூடான குளியல் (ஹம்மாம்)',ar:'كتاب الحمام',first:4009,last:4019},
  {id:34,num:34,en:'Clothing (Kitab Al-Libas)',ta:'ஆடை (லிபாஸ்)',ar:'كتاب اللباس',first:4020,last:4158},
  {id:35,num:35,en:'Combing the Hair (Kitab Al-Tarajjul)',ta:'முடி சீவுதல் (தரஜ்ஜுல்)',ar:'كتاب الترجل',first:4159,last:4213},
  {id:36,num:36,en:'Signet-Rings (Kitab Al-Khatam)',ta:'மோதிரம் (காதம்)',ar:'كتاب الخاتم',first:4214,last:4239},
  {id:37,num:37,en:'Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)',ta:'குழப்பங்கள் · போர்கள் (ஃபிதன்)',ar:'كتاب الفتن والملاحم',first:4240,last:4278},
  {id:38,num:38,en:'The Promised Deliverer (Kitab Al-Mahdi)',ta:'மஹ்தி (வாக்குறுதியளிக்கப்பட்டவர்)',ar:'كتاب المهدي',first:4279,last:4290},
  {id:39,num:39,en:'Battles (Kitab Al-Malahim)',ta:'போர்கள் (மலாஹிம்)',ar:'كتاب الملاحم',first:4291,last:4350},
  {id:40,num:40,en:'Prescribed Punishments (Kitab Al-Hudud)',ta:'ஹுதூத் (தண்டனைகள்)',ar:'كتاب الحدود',first:4351,last:4493},
  {id:41,num:41,en:'Types of Blood-Wit (Kitab Al-Diyat)',ta:'தியத் (இரத்தப்பணம்)',ar:'كتاب الديات',first:4494,last:4595},
  {id:42,num:42,en:'Model Behavior of the Prophet (Kitab Al-Sunnah)',ta:'நபி வழி (சுன்னா)',ar:'كتاب السنة',first:4596,last:4772},
  {id:43,num:43,en:'General Behavior (Kitab Al-Adab)',ta:'பொது ஒழுக்கம் (அதப்)',ar:'كتاب الأدب',first:4773,last:5274},
];

var TIRMIDHI_SECTIONS = [
  {id:1,num:1,en:'The Book on Purification',ta:'தூய்மை',ar:'كتاب الطهارة',first:1,last:148},
  {id:2,num:2,en:'The Book on Salat (Prayer)',ta:'தொழுகை',ar:'كتاب الصلاة',first:149,last:451},
  {id:3,num:3,en:'The Book on Al-Witr',ta:'வித்ர்',ar:'كتاب الوتر',first:452,last:487},
  {id:4,num:4,en:'The Book on the Day of Friday',ta:'ஜும்ஆ',ar:'كتاب الجمعة',first:488,last:529},
  {id:5,num:5,en:'The Book on the Two Eids',ta:'இரண்டு ஈத்',ar:'كتاب العيدين',first:530,last:543},
  {id:6,num:6,en:'The Book on Traveling',ta:'பயணம்',ar:'كتاب السفر',first:544,last:616},
  {id:7,num:7,en:'The Book on Zakat',ta:'ஜகாத்',ar:'كتاب الزكاة',first:617,last:681},
  {id:8,num:8,en:'The Book on Fasting',ta:'நோன்பு',ar:'كتاب الصوم',first:682,last:808},
  {id:9,num:9,en:'The Book on Hajj',ta:'ஹஜ்',ar:'كتاب الحج',first:809,last:964},
  {id:10,num:10,en:'The Book on Jana\'\'iz (Funerals)',ta:'ஜனாஸா',ar:'كتاب الجنائز',first:965,last:1079},
  {id:11,num:11,en:'The Book on Marriage',ta:'திருமணம்',ar:'كتاب النكاح',first:1080,last:1145},
  {id:12,num:12,en:'The Book on Suckling',ta:'பாலூட்டல்',ar:'كتاب الرضاع',first:1146,last:1174},
  {id:13,num:13,en:'The Book on Divorce and Li\'an',ta:'விவாகரத்து · லியான்',ar:'كتاب الطلاق واللعان',first:1175,last:1204},
  {id:14,num:14,en:'The Book on Business',ta:'வியாபாரம்',ar:'كتاب البيوع',first:1205,last:1321},
  {id:15,num:15,en:'The Chapters On Judgements From The Messenger of Allah',ta:'தீர்ப்புகள்',ar:'كتاب الأحكام',first:1322,last:1385},
  {id:16,num:16,en:'The Book on Blood Money',ta:'தியத்',ar:'كتاب الديات',first:1386,last:1422},
  {id:17,num:17,en:'The Book on Legal Punishments (Al-Hudud)',ta:'ஹுதூத்',ar:'كتاب الحدود',first:1423,last:1463},
  {id:18,num:18,en:'The Book on Hunting',ta:'வேட்டை',ar:'كتاب الصيد',first:1464,last:1492},
  {id:19,num:19,en:'The Book on Sacrifices',ta:'குர்பானி',ar:'كتاب الأضاحي',first:1493,last:1523},
  {id:20,num:20,en:'The Book on Vows and Oaths',ta:'நேர்ச்சை · சத்தியம்',ar:'كتاب النذور والأيمان',first:1524,last:1547},
  {id:21,num:21,en:'The Book on Military Expeditions',ta:'போர்த்தொடர்',ar:'كتاب السير',first:1548,last:1618},
  {id:22,num:22,en:'The Book on Virtues of Jihad',ta:'ஜிஹாத் சிறப்பு',ar:'كتاب فضائل الجهاد',first:1619,last:1669},
  {id:23,num:23,en:'The Book on Jihad',ta:'ஜிஹாத்',ar:'كتاب الجهاد',first:1670,last:1719},
  {id:24,num:24,en:'The Book on Clothing',ta:'ஆடை',ar:'كتاب اللباس',first:1720,last:1787},
  {id:25,num:25,en:'The Book on Food',ta:'உணவு',ar:'كتاب الأطعمة',first:1788,last:1860},
  {id:26,num:26,en:'The Book on Drinks',ta:'பானங்கள்',ar:'كتاب الأشربة',first:1861,last:1896},
  {id:27,num:27,en:'Chapters on Righteousness And Maintaining Good Relations With Relatives',ta:'நல்லொழுக்கம் · உறவுகள்',ar:'كتاب البر والصلة',first:1897,last:2035},
  {id:28,num:28,en:'Chapters on Medicine',ta:'மருத்துவம்',ar:'كتاب الطب',first:2036,last:2089},
  {id:29,num:29,en:'Chapters On Inheritance',ta:'வாரிசு',ar:'كتاب الفرائض',first:2090,last:2115},
  {id:30,num:30,en:'Chapters On Wasaya (Wills and Testament)',ta:'உயில்',ar:'كتاب الوصايا',first:2116,last:2124},
  {id:31,num:31,en:'Chapters On Wala\' And Gifts',ta:'வலா · பரிசு',ar:'كتاب الولاء والهبة',first:2125,last:2132},
  {id:32,num:32,en:'Chapters On Al-Qadar',ta:'கதர் (விதி)',ar:'كتاب القدر',first:2133,last:2298},
  {id:33,num:33,en:'Chapters On Al-Fitan',ta:'ஃபிதன் (குழப்பம்)',ar:'كتاب الفتن',first:2158,last:2269},
  {id:34,num:34,en:'Chapters On Dreams',ta:'கனவுகள்',ar:'كتاب الرؤيا',first:2270,last:2294},
  {id:35,num:35,en:'Chapters On Witnesses',ta:'சாட்சிகள்',ar:'كتاب الشهادات',first:2295,last:2303},
  {id:36,num:36,en:'Chapters On Zuhd',ta:'ஸுஹ்த் (துறவு)',ar:'كتاب الزهد',first:2304,last:2414},
  {id:37,num:37,en:'Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara\'',ta:'மறுமை நாள்',ar:'كتاب صفة القيامة',first:2415,last:2522},
  {id:38,num:38,en:'Chapters on the description of Paradise',ta:'சொர்க்கம்',ar:'كتاب صفة الجنة',first:2523,last:2735},
  {id:39,num:39,en:'The Book on the Description of Hellfire',ta:'நரகம்',ar:'كتاب صفة جهنم',first:2573,last:2795},
  {id:40,num:40,en:'The Book on Faith',ta:'ஈமான்',ar:'كتاب الإيمان',first:2606,last:2644},
  {id:41,num:41,en:'Chapters on Knowledge',ta:'அறிவு',ar:'كتاب العلم',first:2645,last:2687},
  {id:42,num:42,en:'Chapters on Seeking Permission',ta:'அனுமதி கேட்டல்',ar:'كتاب الاستئذان',first:2688,last:2734},
  {id:43,num:43,en:'Chapters on Manners',ta:'ஒழுக்கம் (அதப்)',ar:'كتاب الأدب',first:2736,last:2858},
  {id:44,num:44,en:'Chapters on Parables',ta:'உவமைகள்',ar:'كتاب الأمثال',first:2859,last:2874},
  {id:45,num:45,en:'Chapters on The Virtues of the Qur\'an',ta:'குர்ஆன் சிறப்பு',ar:'كتاب فضائل القرآن',first:2875,last:2926},
  {id:46,num:46,en:'Chapters on Recitation',ta:'கிராஅத்',ar:'كتاب القراءات',first:2927,last:2949},
  {id:47,num:47,en:'Chapters on Tafsir',ta:'தஃப்ஸீர்',ar:'كتاب التفسير',first:2950,last:3723},
  {id:48,num:48,en:'Chapters on Supplication',ta:'துஆ',ar:'كتاب الدعوات',first:3370,last:3604},
  {id:49,num:49,en:'Chapters on Virtues',ta:'சிறப்புகள் (ஃபளாயில்)',ar:'كتاب المناقب',first:3605,last:3956},
];

var NASAI_SECTIONS = [
  {id:1,num:1,en:'The Book of Purification',ta:'தூய்மை',ar:'كتاب الطهارة',first:1,last:324},
  {id:2,num:2,en:'The Book of Water',ta:'நீர்',ar:'كتاب المياه',first:325,last:347},
  {id:3,num:3,en:'The Book of Menstruation and Istihadah',ta:'மாதவிடாய் · இஸ்திஹாதா',ar:'كتاب الحيض والاستحاضة',first:348,last:395},
  {id:4,num:4,en:'The Book of Ghusl and Tayammum',ta:'குஸ்ல் · தயம்மும்',ar:'كتاب الغسل والتيمم',first:396,last:447},
  {id:5,num:5,en:'The Book of Salah',ta:'தொழுகை',ar:'كتاب الصلاة',first:448,last:493},
  {id:6,num:6,en:'The Book of the Times (of Prayer)',ta:'தொழுகை நேரங்கள்',ar:'كتاب المواقيت',first:494,last:625},
  {id:7,num:7,en:'The Book of the Adhan (The Call to Prayer)',ta:'அதான்',ar:'كتاب الأذان',first:626,last:687},
  {id:8,num:8,en:'The Book of the Masjids',ta:'பள்ளிவாசல்கள்',ar:'كتاب المساجد',first:688,last:741},
  {id:9,num:9,en:'The Book of the Qiblah',ta:'கிப்லா',ar:'كتاب القبلة',first:742,last:776},
  {id:10,num:10,en:'The Book of Leading the Prayer (Al-Imamah)',ta:'இமாமத்',ar:'كتاب الإمامة',first:777,last:875},
  {id:11,num:11,en:'The Book of the Commencement of the Prayer',ta:'தொழுகை தொடக்கம்',ar:'كتاب الافتتاح',first:876,last:1028},
  {id:12,num:12,en:'The Book of The At-Tatbiq (Clasping One\'s Hands Together)',ta:'அத்-தத்பீக்',ar:'كتاب التطبيق',first:1029,last:1178},
  {id:13,num:13,en:'The Book of Forgetfulness (In Prayer)',ta:'மறதி (ஸஹ்வ்)',ar:'كتاب السهو',first:1179,last:1366},
  {id:14,num:14,en:'The Book of Jumu\'ah (Friday Prayer)',ta:'ஜும்ஆ',ar:'كتاب الجمعة',first:1367,last:1432},
  {id:15,num:15,en:'The Book of Shortening the Prayer When Traveling',ta:'பயணத்தில் சுருக்குதல்',ar:'كتاب تقصير الصلاة',first:1433,last:1458},
  {id:16,num:16,en:'The Book of Eclipses',ta:'கிரகணம்',ar:'كتاب الكسوف',first:1459,last:1503},
  {id:17,num:17,en:'The Book of Praying for Rain (Al-Istisqa\')',ta:'மழை வேண்டல்',ar:'كتاب الاستسقاء',first:1504,last:1528},
  {id:18,num:18,en:'The Book of the Fear Prayer',ta:'பயத் தொழுகை',ar:'كتاب صلاة الخوف',first:1529,last:1555},
  {id:19,num:19,en:'The Book of the Prayer for the Two \'Eids',ta:'ஈத் தொழுகைகள்',ar:'كتاب صلاة العيدين',first:1556,last:1597},
  {id:20,num:20,en:'The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day',ta:'இரவுத் தொழுகை · சுன்னத்',ar:'كتاب قيام الليل',first:1598,last:1817},
  {id:21,num:21,en:'The Book of Funerals',ta:'ஜனாஸா',ar:'كتاب الجنائز',first:1818,last:2089},
  {id:22,num:22,en:'The Book of Fasting',ta:'நோன்பு',ar:'كتاب الصيام',first:2090,last:2434},
  {id:23,num:23,en:'The Book of Zakah',ta:'ஜகாத்',ar:'كتاب الزكاة',first:2435,last:2618},
  {id:24,num:24,en:'The Book of Hajj',ta:'ஹஜ்',ar:'كتاب الحج',first:2619,last:3084},
  {id:25,num:25,en:'The Book of Jihad',ta:'ஜிஹாத்',ar:'كتاب الجهاد',first:3085,last:3195},
  {id:26,num:26,en:'The Book of Marriage',ta:'திருமணம்',ar:'كتاب النكاح',first:3196,last:3388},
  {id:27,num:27,en:'The Book of Divorce',ta:'விவாகரத்து',ar:'كتاب الطلاق',first:3389,last:3560},
  {id:28,num:28,en:'The Book of Horses, Races and Shooting',ta:'குதிரை · போட்டி',ar:'كتاب الخيل',first:3561,last:3593},
  {id:29,num:29,en:'The Book of Endowments',ta:'வக்ஃப்',ar:'كتاب الأحباس',first:3594,last:3610},
  {id:30,num:30,en:'The Book of Wills',ta:'உயில்',ar:'كتاب الوصايا',first:3611,last:3671},
  {id:31,num:31,en:'The Book of Presents',ta:'பரிசுகள்',ar:'كتاب النحل',first:3672,last:3687},
  {id:32,num:32,en:'The Book of Gifts',ta:'கொடைகள்',ar:'كتاب الهبة',first:3688,last:3705},
  {id:33,num:33,en:'The Book of ar-Ruqba',ta:'ருக்பா',ar:'كتاب الرقبى',first:3706,last:3719},
  {id:34,num:34,en:'The Book of \'Umra',ta:'உம்ரா',ar:'كتاب العمرى',first:3720,last:3760},
  {id:35,num:35,en:'The Book of Agriculture',ta:'விவசாயம்',ar:'كتاب المزارعة',first:3761,last:3856},
  {id:36,num:36,en:'The Book of the Kind Treatment of Women',ta:'பெண்களிடம் நல்லொழுக்கம்',ar:'كتاب عشرة النساء',first:3939,last:3965},
  {id:37,num:37,en:'The Book of Fighting [The Prohibition of Bloodshed]',ta:'போர் · இரத்தம் தடை',ar:'كتاب تحريم الدم',first:3966,last:4132},
  {id:38,num:38,en:'The Book of Distribution of Al-Fay\'',ta:'ஃபை பங்கீடு',ar:'كتاب قسم الفيء',first:4133,last:4148},
  {id:39,num:39,en:'The Book of al-Bay\'ah',ta:'பைஅத்',ar:'كتاب البيعة',first:4149,last:4211},
  {id:40,num:40,en:'The Book of al-\'Aqiqah',ta:'அகீகா',ar:'كتاب العقيقة',first:4212,last:4221},
  {id:41,num:41,en:'The Book of al-Fara\' and al-\'Atirah',ta:'ஃபரா · அதீரா',ar:'كتاب الفرع والعتيرة',first:4222,last:4262},
  {id:42,num:42,en:'The Book of Hunting and Slaughtering',ta:'வேட்டை · அறுத்தல்',ar:'كتاب الصيد والذبائح',first:4263,last:4360},
  {id:43,num:43,en:'The Book of ad-Dahaya (Sacrifices)',ta:'குர்பானி',ar:'كتاب الضحايا',first:4361,last:4448},
  {id:44,num:44,en:'The Book of Financial Transactions',ta:'வியாபாரம்',ar:'كتاب البيوع',first:4449,last:4705},
  {id:45,num:45,en:'The Book of Oaths (qasamah), Retaliation and Blood Money',ta:'சத்தியம் · கிசாஸ் · தியத்',ar:'كتاب القسامة',first:4706,last:4869},
  {id:46,num:46,en:'The Book of Cutting off the Hand of the Thief',ta:'திருடனின் கை வெட்டுதல்',ar:'كتاب قطع السارق',first:4870,last:4984},
  {id:47,num:47,en:'The Book Of Faith and its Signs',ta:'ஈமான் · அடையாளங்கள்',ar:'كتاب الإيمان',first:4985,last:5039},
  {id:48,num:48,en:'The Book of Adornment',ta:'அலங்காரம்',ar:'كتاب الزينة',first:5040,last:5378},
  {id:49,num:49,en:'The Book of the Etiquette of Judges',ta:'நீதிபதி ஒழுக்கம்',ar:'كتاب آداب القضاة',first:5379,last:5427},
  {id:50,num:50,en:'The Book of Seeking Refuge with Allah',ta:'அல்லாஹ்விடம் அடைக்கலம்',ar:'كتاب الاستعاذة',first:5428,last:5539},
  {id:51,num:51,en:'The Book of Drinks',ta:'பானங்கள்',ar:'كتاب الأشربة',first:5540,last:5758},
];

var IBNMAJAH_SECTIONS = [
  {id:0,num:1,en:'The Book of the Sunnah',ta:'சுன்னா',ar:'كتاب السنة',first:1,last:266},
  {id:1,num:2,en:'The Book of Purification and its Sunnah',ta:'தூய்மை · சுன்னா',ar:'كتاب الطهارة وسننها',first:267,last:666},
  {id:2,num:3,en:'The Book of the Prayer',ta:'தொழுகை',ar:'كتاب الصلاة',first:667,last:705},
  {id:3,num:4,en:'The Book of the Adhan and the Sunnah Regarding It',ta:'அதான்',ar:'كتاب الأذان والسنة فيها',first:706,last:734},
  {id:4,num:5,en:'The Book On The Mosques And The Congregations',ta:'பள்ளிவாசல்கள் · ஜமாஅத்',ar:'كتاب المساجد والجماعات',first:735,last:802},
  {id:5,num:6,en:'Establishing the Prayer and the Sunnah Regarding Them',ta:'தொழுகை நிலைநாட்டுதல்',ar:'كتاب إقامة الصلاة والسنة فيها',first:803,last:1432},
  {id:6,num:7,en:'Chapters Regarding Funerals',ta:'ஜனாஸா',ar:'كتاب الجنائز',first:1433,last:1637},
  {id:7,num:8,en:'Fasting',ta:'நோன்பு',ar:'كتاب الصيام',first:1638,last:1782},
  {id:8,num:9,en:'The Chapters Regarding Zakat',ta:'ஜகாத்',ar:'كتاب الزكاة',first:1783,last:1844},
  {id:9,num:10,en:'The Chapters on Marriage',ta:'திருமணம்',ar:'كتاب النكاح',first:1845,last:2015},
  {id:10,num:11,en:'The Chapters on Divorce',ta:'விவாகரத்து',ar:'كتاب الطلاق',first:2016,last:2477},
  {id:11,num:12,en:'The Chapters on Expiation',ta:'பரிகாரம் (கஃபாரா)',ar:'كتاب الكفارات',first:2090,last:2136},
  {id:12,num:13,en:'The Chapters on Business Transactions',ta:'வியாபாரம்',ar:'كتاب التجارات',first:2137,last:2307},
  {id:13,num:14,en:'The Chapters on Rulings',ta:'தீர்ப்புகள்',ar:'كتاب الأحكام',first:2308,last:2374},
  {id:14,num:15,en:'The Chapters on Gifts',ta:'பரிசுகள்',ar:'كتاب الهبات',first:2375,last:2389},
  {id:15,num:16,en:'The Chapters on Charity',ta:'தர்மம்',ar:'كتاب الصدقات',first:2390,last:2528},
  {id:16,num:17,en:'The Chapters on Pawning',ta:'அடமானம்',ar:'كتاب الرهون',first:2436,last:2491},
  {id:17,num:18,en:'The Chapters on Pre-emption',ta:'ஷுஃஆ',ar:'كتاب الشفعة',first:2492,last:2501},
  {id:18,num:19,en:'The Chapters on Lost Property',ta:'லுகதா',ar:'كتاب اللقطة',first:2502,last:2511},
  {id:19,num:20,en:'The Chapters on Manumission (of Slaves)',ta:'அடிமை விடுதலை',ar:'كتاب العتق',first:2512,last:2532},
  {id:20,num:21,en:'The Chapters on Legal Punishments',ta:'ஹுதூத்',ar:'كتاب الحدود',first:2533,last:2614},
  {id:21,num:22,en:'The Chapters on Blood Money',ta:'தியத்',ar:'كتاب الديات',first:2615,last:2694},
  {id:22,num:23,en:'The Chapters on Wills',ta:'உயில்',ar:'كتاب الوصايا',first:2695,last:2718},
  {id:23,num:24,en:'Chapters on Shares of Inheritance',ta:'வாரிசு பங்கு',ar:'كتاب الفرائض',first:2719,last:2752},
  {id:24,num:25,en:'The Chapters on Jihad',ta:'ஜிஹாத்',ar:'كتاب الجهاد',first:2753,last:2881},
  {id:25,num:26,en:'Chapters on Hajj Rituals',ta:'ஹஜ்',ar:'كتاب المناسك',first:2882,last:3119},
  {id:26,num:27,en:'Chapters on Sacrifices',ta:'குர்பானி',ar:'كتاب الأضاحي',first:3120,last:3161},
  {id:27,num:28,en:'Chapters on Slaughtering',ta:'அறுத்தல்',ar:'كتاب الذبائح',first:3162,last:3199},
  {id:28,num:29,en:'Chapters on Hunting',ta:'வேட்டை',ar:'كتاب الصيد',first:3200,last:3250},
  {id:29,num:30,en:' Chapters on Food',ta:'உணவு',ar:'كتاب الأطعمة',first:3251,last:3370},
  {id:30,num:31,en:'Chapters on Drinks',ta:'பானங்கள்',ar:'كتاب الأشربة',first:3371,last:3435},
  {id:31,num:32,en:'Chapters on Medicine',ta:'மருத்துவம்',ar:'كتاب الطب',first:3436,last:3549},
  {id:32,num:33,en:'Chapters on Dress',ta:'ஆடை',ar:'كتاب اللباس',first:3550,last:3656},
  {id:33,num:34,en:'Etiquette',ta:'ஒழுக்கம் (அதப்)',ar:'كتاب الأدب',first:3657,last:3826},
  {id:34,num:35,en:'Supplication',ta:'துஆ',ar:'كتاب الدعاء',first:3827,last:3892},
  {id:35,num:36,en:'Interpretation of Dreams',ta:'கனவு விளக்கம்',ar:'كتاب تعبير الرؤيا',first:3893,last:3926},
  {id:36,num:37,en:'Tribulations',ta:'ஃபிதன் (குழப்பம்)',ar:'كتاب الفتن',first:3927,last:4099},
  {id:37,num:38,en:'Zuhd',ta:'ஸுஹ்த் (துறவு)',ar:'كتاب الزهد',first:4100,last:4341},
];

var MUSLIM_SECTIONS = [
  {id:0,num:1,en:"Introduction",ta:"முன்னுரை · அறிமுகம்",ar:"المقدمة",first:1,last:92},
  {id:1,num:2,en:"The Book of Faith",ta:"ஈமான்",ar:"كتاب الإيمان",first:93,last:533},
  {id:2,num:3,en:"The Book of Purification",ta:"தூய்மை (தஹாரா)",ar:"كتاب الطهارة",first:534,last:678},
  {id:3,num:4,en:"The Book of Menstruation",ta:"மாதவிடாய்",ar:"كتاب الحيض",first:679,last:836},
  {id:4,num:5,en:"The Book of Prayer",ta:"தொழுகை",ar:"كتاب الصلاة",first:837,last:1160},
  {id:5,num:6,en:"The Book of Mosques and Places of Prayer",ta:"பள்ளிவாசல்கள் · தொழுமிடங்கள்",ar:"كتاب المساجد ومواضع الصلاة",first:1161,last:1569},
  {id:6,num:7,en:"The Book of Prayer for Travellers",ta:"பயணத் தொழுகை",ar:"كتاب صلاة المسافرين وقصرها",first:1570,last:1950},
  {id:7,num:8,en:"The Book of Friday Prayer",ta:"ஜும்ஆ தொழுகை",ar:"كتاب الجمعة",first:1951,last:2043},
  {id:8,num:9,en:"The Book of the Two Eids",ta:"இரண்டு ஈத் தொழுகைகள்",ar:"كتاب العيدين",first:2044,last:2069},
  {id:9,num:10,en:"The Book of Prayer for Rain",ta:"மழை வேண்டித் தொழுகை",ar:"كتاب الاستسقاء",first:2070,last:2088},
  {id:10,num:11,en:"The Book of the Eclipse",ta:"கிரகணத் தொழுகை",ar:"كتاب الكسوف",first:2089,last:2122},
  {id:11,num:12,en:"The Book of Funerals",ta:"ஜனாஸா",ar:"كتاب الجنائز",first:2123,last:2262},
  {id:12,num:13,en:"The Book of Zakat",ta:"ஜகாத்",ar:"كتاب الزكاة",first:2263,last:2494},
  {id:13,num:14,en:"The Book of Fasting",ta:"நோன்பு",ar:"كتاب الصيام",first:2495,last:2779},
  {id:14,num:15,en:"The Book of I'tikaf",ta:"இஃதிகாஃப்",ar:"كتاب الاعتكاف",first:2780,last:2790},
  {id:15,num:16,en:"The Book of Pilgrimage",ta:"ஹஜ்",ar:"كتاب الحج",first:2791,last:3397},
  {id:16,num:17,en:"The Book of Marriage",ta:"திருமணம்",ar:"كتاب النكاح",first:388,last:3567},
  {id:17,num:18,en:"The Book of Suckling",ta:"பாலூட்டல்",ar:"كتاب الرضاع",first:3568,last:3651},
  {id:18,num:19,en:"The Book of Divorce",ta:"விவாகரத்து",ar:"كتاب الطلاق",first:3652,last:3742},
  {id:19,num:20,en:"The Book of Invoking Curses",ta:"லியான்",ar:"كتاب اللعان",first:3743,last:3769},
  {id:20,num:21,en:"The Book of Emancipation",ta:"அடிமை விடுதலை",ar:"كتاب العتق",first:3770,last:3800},
  {id:21,num:22,en:"The Book of Transactions",ta:"வியாபாரம்",ar:"كتاب البيوع",first:3801,last:3961},
  {id:22,num:23,en:"The Book of Musaqat",ta:"முஸாகா",ar:"كتاب المساقاة",first:3962,last:4139},
  {id:23,num:24,en:"The Book of Inheritance",ta:"வாரிசுரிமை",ar:"كتاب الفرائض",first:4140,last:4162},
  {id:24,num:25,en:"The Book of Gifts",ta:"பரிசுகள்",ar:"كتاب الهبات",first:4163,last:4203},
  {id:25,num:26,en:"The Book of Wills",ta:"உயில் (வஸிய்யத்)",ar:"كتاب الوصية",first:4204,last:4234},
  {id:26,num:27,en:"The Book of Vows",ta:"நேர்ச்சைகள்",ar:"كتاب النذر",first:4235,last:4253},
  {id:27,num:28,en:"The Book of Oaths",ta:"சத்தியங்கள்",ar:"كتاب الأيمان",first:4254,last:4341},
  {id:28,num:29,en:"The Book of Oaths, Qisas and Diyat",ta:"சத்தியம் · கிசாஸ் · தியத்",ar:"كتاب الأيمان والقصاص والديات",first:4342,last:4397},
  {id:29,num:30,en:"The Book of Legal Punishments",ta:"ஹுதூத்",ar:"كتاب الحدود",first:4398,last:4469},
  {id:30,num:31,en:"The Book of Judicial Decisions",ta:"நீதித் தீர்ப்புகள்",ar:"كتاب الأقضية",first:4470,last:4497},
  {id:31,num:32,en:"The Book of Lost Property",ta:"காணாமல் போன பொருள்",ar:"كتاب اللقطة",first:4498,last:4518},
  {id:32,num:33,en:"The Book of Jihad and Expeditions",ta:"ஜிஹாத் · போர்த்தொடர்",ar:"كتاب الجهاد والسير",first:4519,last:4700},
  {id:33,num:34,en:"The Book of Government",ta:"ஆட்சி · அரசு",ar:"كتاب الإمارة",first:4701,last:4967},
  {id:34,num:35,en:"The Book of Hunting, Slaughter and Food",ta:"வேட்டை · அறுத்தல் · உணவு",ar:"كتاب الصيد والذبائح",first:4972,last:5063},
  {id:35,num:36,en:"The Book of Sacrifices",ta:"குர்பானி",ar:"كتاب الأضاحي",first:5064,last:5126},
  {id:36,num:37,en:"The Book of Drinks",ta:"பானங்கள்",ar:"كتاب الأشربة",first:5114,last:5383},
  {id:37,num:38,en:"The Book of Clothing and Adornment",ta:"ஆடை · அலங்காரம்",ar:"كتاب اللباس والزينة",first:5385,last:5585},
  {id:38,num:39,en:"The Book of Manners and Etiquette",ta:"மரியாதை · ஒழுக்கம்",ar:"كتاب الأدب",first:5586,last:5645},
  {id:39,num:40,en:"The Book of Greetings",ta:"சலாம்",ar:"كتاب السلام",first:5646,last:5861},
  {id:40,num:41,en:"The Book of Words and Their Usage",ta:"சரியான சொற்கள்",ar:"كتاب الألفاظ",first:5862,last:5884},
  {id:41,num:42,en:"The Book of Poetry",ta:"கவிதை",ar:"كتاب الشعر",first:5887,last:5896},
  {id:42,num:43,en:"The Book of Dreams",ta:"கனவுகள்",ar:"كتاب الرؤيا",first:5897,last:5937},
  {id:43,num:44,en:"The Book of Virtues",ta:"சிறப்புகள்",ar:"كتاب الفضائل",first:384,last:6168},
  {id:44,num:45,en:"The Book of the Virtues of the Companions",ta:"ஸஹாபாக்களின் சிறப்புகள்",ar:"كتاب فضائل الصحابة",first:6169,last:6499},
  {id:45,num:46,en:"The Book of Righteousness and Maintaining Ties",ta:"நல்லொழுக்கம் · உறவுகள்",ar:"كتاب البر والصلة والآداب",first:6500,last:6722},
  {id:46,num:47,en:"The Book of Destiny",ta:"விதி (கதர்)",ar:"كتاب القدر",first:6723,last:6774},
  {id:47,num:48,en:"The Book of Knowledge",ta:"அறிவு",ar:"كتاب العلم",first:6775,last:6804},
  {id:48,num:49,en:"The Book of Remembrance, Supplication and Repentance",ta:"திக்ர் · துஆ · தவ்பா",ar:"كتاب الذكر والدعاء والتوبة",first:6805,last:6936},
  {id:49,num:50,en:"The Book of Heart-Melting Traditions",ta:"இதய மென்மை",ar:"كتاب الرقائق",first:6937,last:6951},
  {id:50,num:51,en:"The Book of Repentance",ta:"தவ்பா",ar:"كتاب التوبة",first:6952,last:7023},
  {id:51,num:52,en:"The Book of Hypocrisy",ta:"முனாஃபிக்குகளின் பண்புகள்",ar:"كتاب صفات المنافقين",first:7024,last:7044},
  {id:52,num:53,en:"The Book of the Day of Judgment, Paradise and Hell",ta:"மறுமை · சொர்க்கம் · நரகம்",ar:"كتاب صفة القيامة والجنة والنار",first:7045,last:7129},
  {id:53,num:54,en:"The Book of Paradise and Its Delights",ta:"சொர்க்கம் · அதன் சிறப்புகள்",ar:"كتاب صفة الجنة ونعيمها",first:7130,last:7234},
  {id:54,num:55,en:"The Book of Tribulations and Signs of the Hour",ta:"குழப்பங்கள் · இறுதி அடையாளங்கள்",ar:"كتاب الفتن وأشراط الساعة",first:7235,last:7416},
  {id:55,num:56,en:"The Book of Asceticism and Heart-Softening",ta:"துறவறம் · ரிகாக்",ar:"كتاب الزهد والرقائق",first:7417,last:7522},
  {id:56,num:57,en:"The Book of Tafsir",ta:"குர்ஆன் விளக்கம் (தஃப்ஸீர்)",ar:"كتاب التفسير",first:7523,last:7563}
];



var __hadeesState = { kitab: 'bukhari', section: null, cursor: 0, pageSize: 15, loading: false, cache: {} };
var HADITH_CDN = 'https://cdn.jsdelivr.net/gh/fawazahmed0/hadith-api@1/editions';

function getHadeesSections(){
  if(__hadeesState.kitab === 'muslim' && typeof MUSLIM_SECTIONS !== 'undefined') return MUSLIM_SECTIONS;
  if(__hadeesState.kitab === 'abudawud' && typeof ABUDAWUD_SECTIONS !== 'undefined') return ABUDAWUD_SECTIONS;
  if(__hadeesState.kitab === 'tirmidhi' && typeof TIRMIDHI_SECTIONS !== 'undefined') return TIRMIDHI_SECTIONS;
  if(__hadeesState.kitab === 'nasai' && typeof NASAI_SECTIONS !== 'undefined') return NASAI_SECTIONS;
  if(__hadeesState.kitab === 'ibnmajah' && typeof IBNMAJAH_SECTIONS !== 'undefined') return IBNMAJAH_SECTIONS;
  return (typeof BUKHARI_SECTIONS !== 'undefined') ? BUKHARI_SECTIONS : [];
}
function getHadeesLocalPath(){
  if(__hadeesState.kitab === 'muslim') return 'data/muslim';
  if(__hadeesState.kitab === 'abudawud') return 'data/abudawud';
  if(__hadeesState.kitab === 'tirmidhi') return 'data/tirmidhi';
  if(__hadeesState.kitab === 'nasai') return 'data/nasai';
  if(__hadeesState.kitab === 'ibnmajah') return 'data/ibnmajah';
  return 'data/bukhari';
}
function getHadeesCdnPrefix(){
  if(__hadeesState.kitab === 'muslim') return 'muslim';
  if(__hadeesState.kitab === 'abudawud') return 'abudawud';
  if(__hadeesState.kitab === 'tirmidhi') return 'tirmidhi';
  if(__hadeesState.kitab === 'nasai') return 'nasai';
  if(__hadeesState.kitab === 'ibnmajah') return 'ibnmajah';
  return 'bukhari';
}
function getHadeesLabel(){
  if(__hadeesState.kitab === 'muslim') return 'முஸ்லிம்';
  if(__hadeesState.kitab === 'abudawud') return 'அபூ தாவூத்';
  if(__hadeesState.kitab === 'tirmidhi') return 'திர்மிதி';
  if(__hadeesState.kitab === 'nasai') return 'நஸாயி';
  if(__hadeesState.kitab === 'ibnmajah') return 'இப்னு மாஜா';
  return 'புகாரி';
}
function getHadeesLabelEn(){
  if(__hadeesState.kitab === 'muslim') return 'Muslim';
  if(__hadeesState.kitab === 'abudawud') return 'Abu Dawud';
  if(__hadeesState.kitab === 'tirmidhi') return 'Tirmidhi';
  if(__hadeesState.kitab === 'nasai') return "Nasa'i";
  if(__hadeesState.kitab === 'ibnmajah') return 'Ibn Majah';
  return 'Bukhari';
}

function gunzipJson(arrayBuffer){
  if(typeof DecompressionStream === 'undefined'){
    return Promise.reject(new Error('no DecompressionStream'));
  }
  var ds = new DecompressionStream('gzip');
  var stream = new Response(arrayBuffer).body.pipeThrough(ds);
  return new Response(stream).text().then(function(t){ return JSON.parse(t); });
}

function loadOfflineSection(secId){
  var cacheKey = __hadeesState.kitab + ':' + secId;
  if(__hadeesState.cache[cacheKey]) return Promise.resolve(__hadeesState.cache[cacheKey]);
  var url = getHadeesLocalPath() + '/s' + secId + '.json.gz';
  return fetch(url).then(function(r){
    if(!r.ok) throw new Error('offline miss');
    return r.arrayBuffer();
  }).then(gunzipJson).then(function(data){
    __hadeesState.cache[cacheKey] = data || {};
    return __hadeesState.cache[cacheKey];
  });
}

function findSectionForNumber(n){
  var secs = getHadeesSections();
  for(var i=0;i<secs.length;i++){
    var s = secs[i];
    if(n >= s.first && n <= s.last) return s;
  }
  return null;
}

function loadMuslimOverride(){
  if(__hadeesState._muslimOverride) return Promise.resolve(__hadeesState._muslimOverride);
  var url = 'data/muslim/override-1-92.json.gz';
  return fetch(url).then(function(r){
    if(!r.ok) throw new Error('no override');
    return r.arrayBuffer();
  }).then(gunzipJson).then(function(data){
    __hadeesState._muslimOverride = data || {};
    return __hadeesState._muslimOverride;
  }).catch(function(){
    __hadeesState._muslimOverride = {};
    return {};
  });
}

function fetchHadithOffline(n){
  // Prefer user-provided Tamil for Muslim 1–92
  if(__hadeesState.kitab === 'muslim' && n >= 1 && n <= 92){
    return loadMuslimOverride().then(function(ov){
      var e = ov[String(n)] || ov[n];
      if(e && (e.ar || e.ta)){
        return { n: n, ar: e.ar || '', ta: e.ta || '', en: '', grade: e.grade || 'Sahih', book: 0, hadith: null };
      }
      return fetchHadithOfflineSection(n);
    });
  }
  return fetchHadithOfflineSection(n);
}

function fetchHadithOfflineSection(n){
  var sec = findSectionForNumber(n);
  if(!sec) return Promise.resolve(null);
  return loadOfflineSection(sec.id).then(function(data){
    var e = data[String(n)] || data[n];
    if(!e) return null;
    return { n: n, ar: e.ar || '', ta: e.ta || '', en: e.en || '', grade: e.grade || '', book: sec.id, hadith: null };
  }).catch(function(){ return null; });
}

function fetchHadithOnline(n){
  var pref = getHadeesCdnPrefix();
  var engUrl = HADITH_CDN + '/eng-' + pref + '/' + n + '.json';
  var araUrl = HADITH_CDN + '/ara-' + pref + '/' + n + '.json';
  var tamUrl = HADITH_CDN + '/tam-' + pref + '/' + n + '.json';
  return Promise.all([
    fetch(engUrl).then(function(r){ return r.ok ? r.json() : null; }).catch(function(){ return null; }),
    fetch(araUrl).then(function(r){ return r.ok ? r.json() : null; }).catch(function(){ return null; }),
    fetch(tamUrl).then(function(r){ return r.ok ? r.json() : null; }).catch(function(){ return null; })
  ]).then(function(pair){
    var eng = pair[0], ara = pair[1], tam = pair[2];
    var engH = eng && eng.hadiths && eng.hadiths[0];
    var araH = ara && ara.hadiths && ara.hadiths[0];
    var tamH = tam && tam.hadiths && tam.hadiths[0];
    if(!engH && !araH && !tamH) return null;
    var grade = '';
    if(engH && engH.grades && engH.grades.length){
      for(var gi=0; gi<engH.grades.length; gi++){
        var gn = engH.grades[gi];
        if(gn && gn.name && String(gn.name).indexOf('Albani')>=0){ grade = gn.grade || ''; break; }
      }
      if(!grade && engH.grades[0]) grade = engH.grades[0].grade || '';
    }
    if(!grade && (pref==='bukhari' || pref==='muslim')) grade = 'Sahih';
    return {
      n: n,
      en: engH ? engH.text : '',
      ar: araH ? araH.text : '',
      ta: tamH ? tamH.text : '',
      grade: grade,
      book: engH && engH.reference ? engH.reference.book : null,
      hadith: engH && engH.reference ? engH.reference.hadith : null
    };
  });
}

function fetchHadithPair(n){
  return fetchHadithOffline(n).then(function(h){
    if(h && (h.ar || h.ta)) return h;
    return fetchHadithOnline(n);
  });
}

function loadSectionHadithsOffline(sec){
  var base = loadOfflineSection(sec.id);
  var withOv = (__hadeesState.kitab === 'muslim')
    ? Promise.all([base, loadMuslimOverride()]).then(function(pair){ return { data: pair[0], ov: pair[1] }; })
    : base.then(function(data){ return { data: data, ov: {} }; });
  return withOv.then(function(pack){
    var data = pack.data || {};
    var ov = pack.ov || {};
    // Merge override 1-92 into data for Muslim intro / any section that has those nums
    Object.keys(ov).forEach(function(k){
      var n = parseInt(k, 10);
      if(n >= 1 && n <= 92){
        if(sec.id === 0 || (data[k] || data[n])){
          data[k] = { ar: (ov[k].ar || (data[k]&&data[k].ar) || ''), ta: (ov[k].ta || (data[k]&&data[k].ta) || ''), grade: (ov[k].grade || (data[k]&&data[k].grade) || 'Sahih') };
        }
      }
    });
    if(sec.id === 0){
      // Ensure all 1-92 present for Introduction
      Object.keys(ov).forEach(function(k){
        data[k] = { ar: ov[k].ar || '', ta: ov[k].ta || '', grade: ov[k].grade || 'Sahih' };
      });
    }
    var list = [];
    var keys = Object.keys(data).map(Number).filter(function(x){ return !isNaN(x); }).sort(function(a,b){ return a-b; });
    // For intro book, prefer only 1-92 ordered
    if(sec.id === 0){
      keys = keys.filter(function(n){ return n >= 1 && n <= 92; });
    }
    keys.forEach(function(n){
      var e = data[String(n)] || data[n];
      if(!e) return;
      list.push({ n: n, ar: e.ar || '', ta: e.ta || '', en: e.en || '', grade: e.grade || ((__hadeesState.kitab==='bukhari'||__hadeesState.kitab==='muslim')?'Sahih':''), book: sec.id, hadith: null });
    });
    return list;
  });
}

function fixTamilSpacing(text){
  if(!text) return text;
  var s = String(text);
  // stem + கள்… suffixes
  s = s.replace(/([\u0B80-\u0BFF]{2,})\s+(கள்(?:உடன்|இன்|உம்|ஐ|உக்கு|ஆன|ஆக)?[\u0B80-\u0BFF]*)/g, '$1$2');
  s = s.replace(/மனித\s+(ரு[\u0B80-\u0BFF]*)/g, 'மனித$1');
  s = s.replace(/(தங்க|உங்க|எங்க|நம்)\s+(ளுக்கு)/g, '$1$2');
  s = s.replace(/([\u0B80-\u0BFF]{2,})க்\s+க(ிற|ின்ற|ாட்)/g, '$1க்க$2');
  s = s.replace(/([\u0B80-\u0BFF]{2,})த்\s+த(ான்|ும்)/g, '$1த்த$2');
  s = s.replace(/\s+([\u0BBE-\u0BCC\u0BD7])/g, '$1');
  s = s.replace(/மாகக்கொண்டு/g, 'மாகக் கொண்டு');
  s = s.replace(/க்கொண்டுள்ள/g, 'க் கொண்டுள்ள');
  s = s.replace(/ {2,}/g, ' ');
  return s.trim();
}

function hadeesGradeClass(g){
  if(!g) return 'grade-other';
  var s=String(g).toLowerCase();
  if(s.indexOf('daif')>=0 || s.indexOf("da'if")>=0 || s.indexOf('weak')>=0 || s.indexOf('mawdu')>=0 || s.indexOf('daeef')>=0) return 'grade-daif';
  if(s.indexOf('hasan')>=0 && s.indexOf('sahih')<0) return 'grade-hasan';
  if(s.indexOf('sahih')>=0) return 'grade-sahih';
  return 'grade-other';
}
function hadeesGradeTa(g){
  if(!g) return '';
  var s=String(g).toLowerCase();
  if(s.indexOf('mawdu')>=0 || s.indexOf('fabricat')>=0) return '🔴 பொய்யானது (மவ்தூஉ)';
  if(s.indexOf('daif')>=0 || s.indexOf("da'if")>=0 || s.indexOf('weak')>=0 || s.indexOf('daeef')>=0) return '🔴 பலவீனம் (ளயீஃப்)';
  if(s.indexOf('hasan sahih')>=0 || s.indexOf('sahih hasan')>=0) return '🟢 ஹஸன் ஸஹீஹ்';
  if(s.indexOf('hasan')>=0) return '🔵 நல்லது (ஹஸன்)';
  if(s.indexOf('sahih')>=0) return '🟢 ஸஹீஹ் (உண்மையானது)';
  if(s.indexOf('unknown')>=0) return '⚪ தரம் தெரியவில்லை';
  return '⚪ '+g;
}
function hadeesSunnahUrl(n){
  var map={bukhari:'bukhari',muslim:'muslim',abudawud:'abudawud',tirmidhi:'tirmidhi',nasai:'nasai',ibnmajah:'ibnmajah'};
  var c=map[__hadeesState.kitab]||'bukhari';
  return 'https://sunnah.com/'+c+':'+n;
}
function hadeesCardHtml(h){
  var html = '<div class="hadees-card"><div class="hadees-card-num">'+getHadeesLabel()+' #'+h.n;
  if(h.book) html += ' · Book '+h.book;
  html += '</div>';
  if(h.ar) html += '<div class="hadees-card-ar">'+h.ar+'</div>';
  if(h.ta) html += '<div class="hadees-card-ta">'+fixTamilSpacing(h.ta)+'</div>';
  if(h.en) html += '<div class="hadees-card-en">'+h.en+'</div>';
  var grade = h.grade || '';
  if(!grade && (__hadeesState.kitab==='bukhari' || __hadeesState.kitab==='muslim')) grade = 'Sahih';
  if(grade){
    html += '<div class="hadees-card-grade '+hadeesGradeClass(grade)+'"><span class="grade-badge">'+hadeesGradeTa(grade)+'</span>';
    if(grade && grade !== 'Sahih') html += ' <span class="grade-en">'+grade+'</span>';
    html += '</div>';
  }
  var collLabel = (__hadeesState.kitab === 'abudawud' || __hadeesState.kitab === 'nasai' || __hadeesState.kitab === 'ibnmajah') ? 'Sunan' : (__hadeesState.kitab === 'tirmidhi') ? 'Jami' : 'Sahih';
  html += '<div class="hadees-card-ref">— '+collLabel+' '+getHadeesLabelEn()+' '+h.n;
  html += ' · <a class="hadees-sunnah-link" href="'+hadeesSunnahUrl(h.n)+'" target="_blank" rel="noopener">sunnah.com</a>';
  html += '</div>';
  html += '<button type="button" class="hadees-exp-btn" data-hadith-n="'+h.n+'">📖 விளக்கம்</button>';
  html += '<div class="hadees-exp-body" id="hadees-exp-'+h.n+'" hidden></div>';
  html += '</div>';
  return html;
}
function toggleHadeesExplanation(n, btn){
  var body = document.getElementById('hadees-exp-'+n);
  if(!body) return;
  if(!body.hidden && body.getAttribute('data-loaded')){
    body.hidden = true;
    if(btn) btn.textContent = '📖 விளக்கம்';
    return;
  }
  body.hidden = false;
  if(btn) btn.textContent = '📖 விளக்கம் மறை';
  if(body.getAttribute('data-loaded')) return;
  body.innerHTML = '<div class="hadees-exp-loading">ஏற்றுகிறது...</div>';
  // Build brief explanation from grade + sunnah link (Ahlus Sunnah)
  var kit = __hadeesState.kitab;
  var gradeNote = '';
  if(kit==='bukhari' || kit==='muslim'){
    gradeNote = 'இது <b>ஸஹீஹ்</b> ஹதீஸ் — புகாரி/முஸ்லிம் நூல்களில் உள்ளவை அனைத்தும் உண்மையானவை என அறிஞர்கள் ஏற்றுள்ளனர்.';
  } else {
    gradeNote = 'ஹதீஸ் தரம் (அல்-அல்பானி மற்றும் பிற அறிஞர்கள்) மேலே காட்டப்பட்டுள்ளது. விரிவான விளக்கத்திற்கு sunnah.com பார்க்கவும்.';
  }
  var html = '<div class="hadees-exp-text">'+gradeNote+'</div>';
  html += '<div class="hadees-exp-links"><a href="'+hadeesSunnahUrl(n)+'" target="_blank" rel="noopener">🔗 sunnah.com-ல் முழு விவரம்</a></div>';
  html += '<div class="hadees-exp-note">ஆதாரம்: குதுப் அஸ்-ஸித்தா (ஸுன்னத் ஜமாஅத்)</div>';
  body.innerHTML = html;
  body.setAttribute('data-loaded','1');
}
document.addEventListener('click', function(ev){
  var btn = ev.target.closest && ev.target.closest('.hadees-exp-btn');
  if(!btn) return;
  var n = btn.getAttribute('data-hadith-n');
  if(n) toggleHadeesExplanation(n, btn);
});

function renderHadeesFeatured(){
  var host = document.getElementById('hadeesList');
  if(!host) return;
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var HADITHS = getQuranHadiths();
  var dua = isEn
    ? '<p class="juz-hadith-dua">اللَّهُمَّ اجْعَلْنَا مِنْ أَهْلِ الْقُرْآنِ<br><span>“O Allah, make us among the people of the Qur’an.” Āmīn.</span></p>'
    : '<p class="juz-hadith-dua">اللَّهُمَّ اجْعَلْنَا مِنْ أَهْلِ الْقُرْآنِ<br><span>“யா அல்லாஹ்! எங்களை குர்ஆனுடைய மக்களாக ஆக்குவாயாக.” ஆமீன்.</span></p>';
  var title = isEn ? 'Hadith about the Qur’an' : 'குர்ஆன் பற்றிய ஹதீஸ்கள்';
  var h = '<div class="juz-hadith-box home-hadith"><div class="juz-hadith-title">📖 '+title+'</div>';
  HADITHS.forEach(function(x, i){
    h += '<div class="juz-hadith-item"><div class="juz-hadith-num">'+(i+1)+'. '+x.t+'</div>';
    if(x.ar) h += '<div class="juz-hadith-ar">'+x.ar+'</div>';
    h += '<div class="juz-hadith-body">'+x.body+'</div>';
    h += '<div class="juz-hadith-ref">— '+x.ref+'</div></div>';
  });
  h += dua + '</div>';
  host.innerHTML = h;
}

function renderHadeesBooksList(){
  var host = document.getElementById('hadeesBooksList');
  var secs = getHadeesSections();
  if(!host || !secs.length) return;
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var html = '';
  secs.forEach(function(s){
    var count = (s.last - s.first + 1);
    var dispNum = (typeof s.num === 'number') ? s.num : s.id;
    var name = isEn ? (s.en || s.ta) : (s.ta || s.en);
    var subParts = [];
    if(s.ar) subParts.push(s.ar);
    if(isEn){ if(s.ta) subParts.push(s.ta); }
    else { if(s.en) subParts.push(s.en); }
    html += '<button type="button" class="hadees-book-btn" data-sec="'+s.id+'">';
    html += '<span class="hadees-book-num">'+dispNum+'</span>';
    html += '<span><div class="hadees-book-name">'+name+'</div>';
    if(subParts.length) html += '<div class="hadees-book-en">'+subParts.join(' · ')+'</div>';
    html += '<div class="hadees-book-meta">#'+s.first+' – '+s.last+(isEn?' · hadiths':' · ஹதீஸ்')+'</div></span></button>';
  });
  host.innerHTML = html;
}

function showHadeesPanel(name){
  ['Books','Featured','Search'].forEach(function(p){
    var el = document.getElementById('hadeesPanel'+p);
    if(el) el.style.display = (p.toLowerCase()===name) ? '' : 'none';
  });
  document.querySelectorAll('.hadees-tab').forEach(function(t){
    t.classList.toggle('active', t.getAttribute('data-htab')===name);
  });
}

function openHadeesSection(secId){
  var sec = null;
  var secs = getHadeesSections();
  for(var i=0;i<secs.length;i++){
    if(secs[i].id===secId){ sec = secs[i]; break; }
  }
  if(!sec) return;
  __hadeesState.section = sec;
  __hadeesState.cursor = sec.first;
  __hadeesState._secList = null;
  var books = document.getElementById('hadeesBooksList');
  var view = document.getElementById('hadeesHadithView');
  if(books) books.style.display = 'none';
  if(view) view.style.display = '';
  var title = document.getElementById('hadeesSecTitle');
  if(title){
    var isEn = (typeof isEnLang==='function' && isEnLang());
    var name = isEn ? (sec.en || sec.ta) : (sec.ta || sec.en);
    var dn = (typeof sec.num === 'number') ? sec.num : sec.id;
    var prefix = dn + '. ';
    title.textContent = prefix + name + (sec.ar ? ' — ' + sec.ar : '');
  }
  var list = document.getElementById('hadeesHadithList');
  if(list) list.innerHTML = '<div class="hadees-loading">ஏற்றுகிறது…</div>';
  var more = document.getElementById('hadeesLoadMore');
  if(more) more.style.display = 'none';
  loadMoreHadees(true);
}

function backHadeesSections(){
  __hadeesState.section = null;
  var books = document.getElementById('hadeesBooksList');
  var view = document.getElementById('hadeesHadithView');
  if(books) books.style.display = '';
  if(view) view.style.display = 'none';
}

function appendHadeesResults(results, list, reset){
  if(reset && list) list.innerHTML = '';
  var any = false;
  results.forEach(function(h){
    if(!h) return;
    any = true;
    var wrap = document.createElement('div');
    wrap.innerHTML = hadeesCardHtml(h);
    if(list && wrap.firstChild) list.appendChild(wrap.firstChild);
  });
  return any;
}

function loadMoreHadees(reset){
  var sec = __hadeesState.section;
  if(!sec || __hadeesState.loading) return;
  __hadeesState.loading = true;
  var list = document.getElementById('hadeesHadithList');
  var more = document.getElementById('hadeesLoadMore');

  // Prefer full offline section load once, then paginate in memory
  if(reset || !__hadeesState._secList){
    loadSectionHadithsOffline(sec).then(function(all){
      if(all && all.length){
        __hadeesState._secList = all;
        __hadeesState.cursor = 0;
        var page = all.slice(0, __hadeesState.pageSize);
        __hadeesState.cursor = page.length;
        __hadeesState.loading = false;
        appendHadeesResults(page, list, true);
        if(more) more.style.display = (__hadeesState.cursor < all.length) ? '' : 'none';
        return;
      }
      // fallback online page
      loadMoreHadeesOnline(reset, list, more, sec);
    }).catch(function(){
      loadMoreHadeesOnline(reset, list, more, sec);
    });
    return;
  }

  var all = __hadeesState._secList || [];
  var page = all.slice(__hadeesState.cursor, __hadeesState.cursor + __hadeesState.pageSize);
  __hadeesState.cursor += page.length;
  __hadeesState.loading = false;
  appendHadeesResults(page, list, false);
  if(more) more.style.display = (__hadeesState.cursor < all.length) ? '' : 'none';
}

function loadMoreHadeesOnline(reset, list, more, sec){
  var start = reset ? sec.first : __hadeesState.cursor;
  var end = Math.min(start + __hadeesState.pageSize - 1, sec.last);
  var nums = [];
  for(var n=start; n<=end; n++) nums.push(n);
  Promise.all(nums.map(fetchHadithPair)).then(function(results){
    __hadeesState.loading = false;
    var any = appendHadeesResults(results, list, reset);
    __hadeesState.cursor = end + 1;
    if(more) more.style.display = (__hadeesState.cursor <= sec.last) ? '' : 'none';
    if(reset && !any && list){
      list.innerHTML = '<div class="hadees-error">ஹதீஸ் ஏற்ற முடியவில்லை.</div>';
    }
  }).catch(function(){
    __hadeesState.loading = false;
    if(reset && list) list.innerHTML = '<div class="hadees-error">ஹதீஸ் ஏற்ற முடியவில்லை.</div>';
  });
}

function searchHadeesByNumber(){
  var inp = document.getElementById('hadeesNumInput');
  var host = document.getElementById('hadeesSearchResult');
  if(!inp || !host) return;
  var n = parseInt(inp.value, 10);
  if(!n || n<1 || n>7563){
    host.innerHTML = '<div class="hadees-error">1 முதல் 7563 வரை எண்ணை உள்ளிடுங்கள்</div>';
    return;
  }
  host.innerHTML = '<div class="hadees-loading">ஏற்றுகிறது…</div>';
  fetchHadithPair(n).then(function(h){
    if(!h){
      host.innerHTML = '<div class="hadees-error">ஹதீஸ் #'+n+' கிடைக்கவில்லை (சில எண்கள் தவிர்க்கப்பட்டிருக்கலாம்)</div>';
      return;
    }
    host.innerHTML = hadeesCardHtml(h);
  }).catch(function(){
    host.innerHTML = '<div class="hadees-error">ஏற்ற முடியவில்லை. Internet தேவை.</div>';
  });
}

function updateHadeesKitabUI(){
  document.querySelectorAll('.hadees-kitab').forEach(function(b){
    b.classList.toggle('active', b.getAttribute('data-kitab') === __hadeesState.kitab);
  });
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var title = document.getElementById('hadeesTitle');
  var sub = document.getElementById('hadeesSub');
  if(__hadeesState.kitab === 'muslim'){
    if(title) title.textContent = isEn ? '📖 Sahih Muslim' : '📖 ஸஹீஹ் முஸ்லிம்';
    if(sub) sub.textContent = isEn ? 'Imam Muslim · 56 books · 7500+ hadiths' : 'இமாம் முஸ்லிம் · 56 புத்தகங்கள் · 7500+ ஹதீஸ்';
  } else {
    if(title) title.textContent = isEn ? '📖 Sahih al-Bukhari' : '📖 ஸஹீஹ் புகாரி';
    if(sub) sub.textContent = isEn ? 'Imam Bukhari · 97 books · 7500+ hadiths' : 'இமாம் புகாரி · 97 புத்தகங்கள் · 7500+ ஹதீஸ்';
  }
  var inp = document.getElementById('hadeesNumInput');
  if(inp){
    inp.placeholder = isEn ? 'Hadith number (1–7563)' : 'ஹதீஸ் எண் (1–7563)';
  }
}

function setHadeesKitab(kitab){
  if(kitab !== 'bukhari' && kitab !== 'muslim' && kitab !== 'abudawud' && kitab !== 'tirmidhi' && kitab !== 'nasai' && kitab !== 'ibnmajah') return;
  __hadeesState.kitab = kitab;
  __hadeesState.section = null;
  __hadeesState._secList = null;
  updateHadeesKitabUI();
  backHadeesSections();
  renderHadeesBooksList();
  showHadeesPanel('books');
}

function initHadeesUI(){
  if(window.__hadeesUIBound) return;
  window.__hadeesUIBound = true;
  document.addEventListener('click', function(ev){
    var kitabBtn = ev.target.closest && ev.target.closest('.hadees-kitab');
    if(kitabBtn){
      setHadeesKitab(kitabBtn.getAttribute('data-kitab'));
      return;
    }
    var tab = ev.target.closest && ev.target.closest('.hadees-tab');
    if(tab){
      var name = tab.getAttribute('data-htab');
      showHadeesPanel(name);
      if(name==='featured') renderHadeesFeatured();
      if(name==='books'){
        backHadeesSections();
        renderHadeesBooksList();
      }
      return;
    }
    var book = ev.target.closest && ev.target.closest('.hadees-book-btn');
    if(book){
      var id = parseInt(book.getAttribute('data-sec'), 10);
      openHadeesSection(id);
      return;
    }
    if(ev.target.id==='hadeesBackSec' || (ev.target.closest && ev.target.closest('#hadeesBackSec'))){
      backHadeesSections();
      return;
    }
    if(ev.target.id==='hadeesMoreBtn' || (ev.target.closest && ev.target.closest('#hadeesMoreBtn'))){
      loadMoreHadees(false);
      return;
    }
    if(ev.target.id==='hadeesNumGo' || (ev.target.closest && ev.target.closest('#hadeesNumGo'))){
      searchHadeesByNumber();
      return;
    }
  });
  var numInp = document.getElementById('hadeesNumInput');
  if(numInp){
    numInp.addEventListener('keydown', function(e){
      if(e.key==='Enter'){ e.preventDefault(); searchHadeesByNumber(); }
    });
  }
}

function renderHadeesScreen(){
  initHadeesUI();
  updateHadeesKitabUI();
  renderHadeesBooksList();
  renderHadeesFeatured();
  showHadeesPanel('books');
  backHadeesSections();
}


function getQuranHadiths(){
  var isEn = (typeof isEnLang==='function' && isEnLang());
  if(isEn){
    return [
      {t:'The best of you', ar:'خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ', body:'“The best of you are those who learn the Qur’an and teach it.”', ref:'Sahih al-Bukhari 5027'},
      {t:'Intercession', ar:'اقْرَؤُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ', body:'“Recite the Qur’an, for it will come on the Day of Judgment as an intercessor for its companions.”', ref:'Sahih Muslim 804'},
      {t:'Reward per letter', ar:'مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ', body:'“Whoever recites a letter from the Book of Allah will receive a good deed for it — and a good deed is multiplied tenfold.”', ref:'Jami\' at-Tirmidhi 2910'},
      {t:'Skilled reciter', ar:'', body:'“The one who recites the Qur’an skillfully is with the noble, righteous angels; and the one who recites with difficulty gets a double reward.”', ref:'Bukhari 4937 · Muslim 798'},
      {t:'Spring of the heart', ar:'', body:'“O Allah, make the Qur’an the spring of my heart and the light of my chest.”', ref:'Musnad Ahmad 3712'},
      {t:'Do not abandon it', ar:'', body:'“Keep refreshing your knowledge of the Qur’an, for by the One in Whose Hand is my soul, it escapes faster than a camel from its rope.”', ref:'Sahih al-Bukhari 5033'},
      {t:'Parents honoured', ar:'', body:'“The parents of one who learns the Qur’an and acts upon it will be crowned with light on the Day of Judgment.”', ref:'Sunan Abu Dawud 1453'},
      {t:'People of Allah', ar:'إِنَّ لِلَّهِ أَهْلِينَ مِنَ النَّاسِ · هُمْ أَهْلُ الْقُرْآنِ، أَهْلُ اللَّهِ وَخَاصَّتُهُ', body:'“Allah has special people among mankind.” The Companions asked who they are. He ﷺ said: “They are the people of the Qur’an — the people of Allah and His chosen ones.”', ref:'Sunan Ibn Majah 215'}
    ];
  }
  return [
    {t:'கற்றல் · கற்பித்தல்', ar:'خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ', body:'“உங்களில் சிறந்தவர் குர்ஆனை கற்று அதை பிறருக்குக் கற்பிப்பவராவார்.”', ref:'ஸஹீஹ் புகாரி 5027'},
    {t:'பரிந்துரை', ar:'اقْرَؤُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ', body:'“குர்ஆனை ஓதுங்கள். அது மறுமை நாளில் தன் தோழர்களுக்காக பரிந்துரை செய்யும்.”', ref:'ஸஹீஹ் முஸ்லிம் 804'},
    {t:'ஒரு எழுத்துக்கு நன்மை', ar:'مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ', body:'“அல்லாஹ்வின் வேதத்திலிருந்து ஒரு எழுத்தை ஓதியவருக்கு ஒரு நன்மை உண்டு — ஒரு நன்மை பத்து மடங்கு ஆகும்.”', ref:'ஜாமி உத் திர்மிதி 2910'},
    {t:'திறமையான ஓதுபவர்', ar:'', body:'“குர்ஆனை நன்கு ஓதுபவர் கண்ணியமான மலக்குகளுடன் இருப்பார்; சிரமப்பட்டு ஓதுபவருக்கு இரண்டு நன்மைகள் உண்டு.”', ref:'புகாரி 4937 · முஸ்லிம் 798'},
    {t:'உள்ளத்தின் வசந்தம்', ar:'', body:'“அல்லாஹ்வே! குர்ஆனை என் உள்ளத்தின் வசந்தமாகவும், என் நெஞ்சின் ஒளியாகவும் ஆக்குவாயாக.”', ref:'முஸ்னத் அஹ்மத் 3712'},
    {t:'விட்டுவிடாதீர்கள்', ar:'', body:'“குர்ஆனை தொடர்ந்து ஓதுங்கள்; ஒட்டகம் கட்டிலிருந்து தப்பிச் செல்வதை விட குர்ஆன் மனதில் இருந்து வேகமாக நீங்கிவிடும்.”', ref:'ஸஹீஹ் புகாரி 5033'},
    {t:'பெற்றோர் கௌரவம்', ar:'', body:'“குர்ஆனை கற்று அதன்படி செயல்பட்டவரின் பெற்றோருக்கு மறுமையில் ஒளி நிறைந்த கிரீடம் அணிவிக்கப்படும்.”', ref:'ஸுனன் அபூ தாவூத் 1453'},
    {t:'அல்லாஹ்வின் அஹ்லுல் குர்ஆன்', ar:'إِنَّ لِلَّهِ أَهْلِينَ مِنَ النَّاسِ · هُمْ أَهْلُ الْقُرْآنِ، أَهْلُ اللَّهِ وَخَاصَّتُهُ', body:'“அல்லாஹ்விற்கு மனிதர்களில் சில விசேஷமான மக்கள் இருக்கின்றனர்.” ஸஹாபாக்கள்: “அவர்கள் யார்?” நபி ﷺ: “அவர்கள் குர்ஆன் உடையவர்கள்; அல்லாஹ்வின் விசேஷமான அடியார்கள்.”', ref:'ஸுனன் இப்னு மாஜா 215'}
  ];
}


function renderPlotsGrid(){
  const grid = document.getElementById('plotsGrid');
  if(!grid) return;
  const _si = document.getElementById('surahSearchInput');
  const q = ((_si && _si.value)||'').trim().toLowerCase();
  // SURAH list only — Juz is a separate feature (not a surah filter)
  ensureLevelMeta();
  checkLevelCompletions();
  renderLevelBar();
  var def = getSurahLevelDef(selectedSurahLevel);
  let list = SURAH_META.filter(m=>{
    if(m.n < def.start || m.n > def.end) return false;
    if(!q) return true;
    return (m.en||'').toLowerCase().includes(q) || (m.ar||'').includes(q) || String(m.n).includes(q);
  });
  let currentId = null;
  for(const m of list){
    const id = surahIdForNum(m.n);
    const s = QURAN_DATA[id];
    if(!s || !s.ayat || !s.ayat.length){ if(!currentId) currentId = id; continue; }
    const g = state.gardens[id]||{planted:[]};
    const total = s.ayat.length;
    if(g.planted.filter(Boolean).length < total){ currentId = id; break; }
  }
  let totalStars=0, maxStars=list.length*3;
  var stLv = levelStats(selectedSurahLevel);
  var rankNow = meta.levelProgress.ranks[selectedSurahLevel];
  var unlockTxt = isLevelUnlocked(selectedSurahLevel)
    ? (stLv.complete
        ? ('✅ ' + _('msg_done_short') + ' ' + (RANK_LABEL[rankNow]||''))
        : (stLv.done + '/' + stLv.total + ' ' + _('lbl_surah')))
    : ('🔒 ' + _('lbl_locked'));
  let h = '<div class="level-map-title"><img src="icons/tree-64.png" class="title-tree" alt=""> Level ' + selectedSurahLevel + ' · ' + _('lbl_surah') + ' ' + def.start + '–' + def.end + ' <span class="slv-status">' + unlockTxt + '</span></div><div class="level-grid">';
  list.forEach(m=>{
    const id = surahIdForNum(m.n);
    const surah = QURAN_DATA[id];
    const hasData = !!(surah && surah.ayat && surah.ayat.length);
    const g = state.gardens[id]||{planted:[]};
    const total = hasData ? surah.ayat.length : (m.a||0);
    const P = hasData ? g.planted.filter(Boolean).length : 0;
    const done = hasData && total>0 && P>=total;
    const started = P>0;
    const isCurrent = id===currentId;
    let stars = done ? 3 : (P>0 ? Math.max(1, Math.round(P/total*3)) : 0);
    totalStars += stars;
    let cls = 'level-tile';
    if(done) cls += ' done';
    else if(isCurrent) cls += ' current';
    else if(started) cls += ' progress';
    else if(!hasData) cls += ' locked';
    else cls += ' locked';
    const num = m.n;
    const enName = String(m.en || ('Surah ' + num));
    let arName = String(m.ar || '');
    if(arName.indexOf('سُورَةُ') === 0) arName = arName.slice(6).trim();
    else if(arName.indexOf('سورة') === 0) arName = arName.slice(4).trim();
    let starsHtml = '';
    for(let s=1;s<=3;s++) starsHtml += s<=stars ? '⭐' : '☆';
    const badge = (isCurrent && !started) ? '<span class="level-new-badge">NEW!</span>' : '';
    const ayahLabel = m.a ? (m.a + ' ' + _('lbl_ayah')) : '';
    const inner =
      '<span class="level-num-badge">'+num+'</span>'+
      '<img src="icons/surah-72.png" alt="" class="level-surah-icon">';
    h += '<div class="'+cls+'" onclick="openGardenByNum('+m.n+')">'+badge+inner+
      '<div class="level-stars">'+starsHtml+'</div>'+
      '<div class="level-name-ar" dir="rtl">'+arName+'</div>'+
      '<div class="level-name">'+enName+'</div>'+
      (ayahLabel ? '<div class="level-ayahs">'+ayahLabel+'</div>' : '')+
      '</div>';
  });
  h += '</div><div class="level-progress-bar">⭐ '+totalStars+'/'+maxStars+'</div>';
  grid.innerHTML = h;
  updateHeader();
}

function stripBismillah(text, surahNum){
  if(!text) return '';
  var t = String(text).replace(/^\uFEFF/,'').trim();
  if(surahNum === 1 || surahNum === 9) return t;
  // Multiple Bismillah orthographies (Uthmani + IndoPak)
  t = t.replace(/^بِّ?سۡ?مِ[\s\u00A0]*ٱ?للَّ?هِ[\s\u00A0]*ٱ?لرَّحۡ?مَ[ـ\u0650]*ٰ?نِ[\s\u00A0]*ٱ?لرَّحِ[يىی]مِ[\s\u00A0]*/u, '');
  t = t.replace(/^بِسْمِ[\s\u00A0]+اللَّهِ[\s\u00A0]+الرَّحْمَٰنِ[\s\u00A0]+الرَّحِيمِ[\s\u00A0]*/u, '');
  t = t.replace(/^بسم الله الرحمن الرحيم[\s\u00A0]*/u, '');
  return t.trim();
}

async function ensureSurahLoaded(n){
  const id = surahIdForNum(n);
  if(QURAN_DATA[id] && QURAN_DATA[id].ayat && QURAN_DATA[id].ayat.length) return id;
  const meta = SURAH_META.find(m=>m.n===n);
  const endpoint = currentScript === 'uthmani'
    ? 'https://api.quran.com/api/v4/quran/verses/uthmani?chapter_number='+n
    : 'https://api.quran.com/api/v4/quran/verses/indopak?chapter_number='+n;
  const field = currentScript === 'uthmani' ? 'text_uthmani' : 'text_indopak';
  try {
    const [arRes, taRes] = await Promise.all([
      fetch(endpoint),
      fetch('https://api.alquran.cloud/v1/surah/'+n+'/ar.muyassar').catch(function(){return null}).then(function(){return {json:function(){return Promise.resolve({code:200,data:{ayahs:[]}})}}})
    ]);
    if(!arRes.ok) throw new Error('fail');
    const arData = await arRes.json();
    const verses = arData.verses || [];
    if(!verses.length) throw new Error('empty');
    let taList = [];
    if(taRes.ok){
      const taData = await taRes.json();
      taList = (taData.data && taData.data.ayahs || []).map(a=>a.text);
    }
    const ayat = verses.map((v,i)=>({
      ar: String(v[field]||'').replace(/^\uFEFF/,'').trim(),
      ta: taList[i]||''
    }));
    const newId = (n===1 && !QURAN_DATA.fatiha) ? 'fatiha' : 's'+n;
    QURAN_DATA[newId] = {
      nameAr: (meta&&meta.ar) || '',
      nameTa: n+'. '+((meta&&meta.en)||''),
      surahNum: n,
      ayat
    };
    if(!state.gardens[newId] || state.gardens[newId].planted.length !== ayat.length){
      state.gardens[newId] = {planted: Array(ayat.length).fill(false)};
    }
    saveData(); saveGame();
    return newId;
  } catch(e){
    alert(_('msg_surah_load_fail'));
    return null;
  }
}


/** Build full Juz ayah queue: start ayah → end ayah (all surahs in between) */
async function buildJuzAyahQueue(j){
  const m = JUZ_META[j];
  if(!m || !m.start || !m.end) return [];
  const queue = [];
  const surahNums = [];
  // consecutive surah numbers from start.s to end.s
  for(let sn = m.start.s; sn <= m.end.s; sn++) surahNums.push(sn);
  for(let si = 0; si < surahNums.length; si++){
    const sn = surahNums[si];
    const id = await ensureSurahLoaded(sn);
    if(!id || !QURAN_DATA[id] || !QURAN_DATA[id].ayat) continue;
    const s = QURAN_DATA[id];
    const ayat = s.ayat;
    let from = 1;
    let to = ayat.length;
    if(sn === m.start.s) from = m.start.a;
    if(sn === m.end.s) to = m.end.a;
    from = Math.max(1, from);
    to = Math.min(ayat.length, to);
    for(let a = from; a <= to; a++){
      const ay = ayat[a - 1];
      if(!ay) continue;
      queue.push({
        id: id,
        surahNum: s.surahNum || sn,
        ayahNum: a,
        nameTa: s.nameTa || s.nameEn || ('சூரா '+sn),
        nameAr: s.nameAr || '',
        ar: ay.ar || '',
        ta: ay.ta || ''
      });
    }
  }
  return queue;
}

/**
 * Tap Juz → show FULL juz from first ayah to last ayah
 * (like tapping Surah shows full surah)
 */
async function openJuzReading(j){
  const metaJ = (typeof JUZ_META !== 'undefined') ? JUZ_META[j] : null;
  if(!metaJ || !metaJ.start){
    alert(_('msg_juz_no_data').replace('{j}', String(j)));
    return;
  }
  const toast = document.createElement('div');
  toast.style.cssText = 'position:fixed;bottom:20px;left:50%;transform:translateX(-50%);background:#1a2340;border:1px solid rgba(255,255,255,.2);padding:12px 16px;border-radius:12px;z-index:9999;font-size:13px;font-weight:700;max-width:92%;text-align:center';
  toast.textContent = '⏳ ஜுஸ்வு '+j+' · முதல் ஆயத்து முதல் கடைசி வரை ஏற்றுகிறது...';
  document.body.appendChild(toast);
  try{
    stopContinuous();
    const queue = await buildJuzAyahQueue(j);
    if(!queue.length){
      toast.textContent = _('msg_juz_ayat_fail');
      setTimeout(function(){ toast.remove(); }, 2000);
      return;
    }
    contQueue = queue;
    contIndex = 0;
    contActiveSurahId = queue[0].id;
    contActiveAyat = queue.map(function(x){ return {ar:x.ar, ta:x.ta||'', ayahNum:x.ayahNum}; });
    window.__juzFullMode = true;
    window.__juzFullId = j;
    if(typeof currentJuzView !== 'undefined') currentJuzView = j;

    // Stay on ஜுஸ்வு screen only (no separate audio menu/screen)
    if(typeof switchScreen === 'function') switchScreen('screenJuz');
    try{
      const list = document.getElementById('juzSettingsList');
      if(list) list.style.display = 'none';
      const title = document.getElementById('juzScreenTitle');
      if(title){ title.style.display = 'block'; title.textContent = '📖 ஜுஸ்வு '+j+' · '+juzName(j); }
      const st = document.getElementById('juzSurahListTitle');
      if(st){ st.style.display = 'block'; st.textContent = juzStartLabel(j)+'  →  '+juzEndLabel(j)+' · '+queue.length+' ஆயத்து'; }
      const grid = document.getElementById('juzNumGrid');
      if(grid){ grid.style.display = 'none'; }
      const sgrid = document.getElementById('juzSurahGrid');
      if(sgrid){ sgrid.style.display = 'none'; }
      const bar = document.getElementById('juzPlayerBar');
      if(bar) bar.style.display = '';
      const load = document.getElementById('juzLoading');
      if(load) load.style.display = 'none';
      const panel = document.getElementById('juzAyahPanel');
      if(panel){
        panel.dataset.sid = '';
        panel.classList.add('show');
        panel.style.display = 'block';
      }
      // Back to 30 juz list
      let backRow = document.getElementById('juzReadBackBtn');
      if(!backRow){
        backRow = document.createElement('button');
        backRow.type = 'button';
        backRow.id = 'juzReadBackBtn';
        backRow.className = 'back-btn';
        backRow.textContent = _('msg_juz_list');
        backRow.style.marginBottom = '8px';
        const host = document.getElementById('screenJuz');
        if(host) host.insertBefore(backRow, host.firstChild.nextSibling);
      }
      backRow.style.display = '';
      backRow.onclick = function(){
        stopContinuous();
        window.__juzFullMode = false;
        if(bar) bar.style.display = 'none';
        if(panel){ panel.classList.remove('show'); panel.innerHTML = ''; panel.style.display = 'none'; }
        if(list) list.style.display = '';
        backRow.style.display = 'none';
        if(title) title.style.display = 'none';
        if(st) st.style.display = 'none';
        if(typeof renderJuzSettingsList === 'function') renderJuzSettingsList();
      };
      if(typeof updateJuzUI === 'function') updateJuzUI();
      if(typeof renderAyahPanel === 'function') renderAyahPanel();
    }catch(e){ console.warn(e); }

    toast.textContent = '▶️ ஜுஸ்வு '+j+' · '+queue.length+' ஆயத்து · '+juzStartLabel(j)+' முதல்';
    setTimeout(function(){ try{ toast.remove(); }catch(e){} }, 2000);
    // Auto-play from first ayah of juz to last
    if(typeof playContinuousAt === 'function') playContinuousAt(0);
  }catch(e){
    console.warn(e);
    toast.textContent = _('msg_juz_open_fail');
    setTimeout(function(){ toast.remove(); }, 1800);
  }
}



/* ===== Surah Level Path (30 / 5 chunks) ===== */
function getLevelChunkSize(totalAyat){
  return totalAyat > 30 ? 30 : 5;
}

function buildSurahLevels(totalAyat){
  const size = getLevelChunkSize(totalAyat);
  const levels = [];
  let start = 0;
  let n = 1;
  while(start < totalAyat){
    const end = Math.min(start + size, totalAyat);
    levels.push({
      level: n,
      start: start,      // 0-based inclusive
      end: end,          // 0-based exclusive
      count: end - start,
      reward: Math.max(10, (end - start) * 2)
    });
    start = end;
    n++;
  }
  return levels;
}

function levelStatus(g, lvl){
  if(!g || !g.planted) return { done:0, total:lvl.count, complete:false, unlocked:true };
  let done = 0;
  for(let i = lvl.start; i < lvl.end; i++){
    if(g.planted[i]) done++;
  }
  // unlock: first level always; next unlocks when previous complete
  return { done: done, total: lvl.count, complete: done >= lvl.count, unlocked: true };
}

function renderLevelPath(){
  const path = document.getElementById('levelPath');
  if(!path || !currentSurah || !QURAN_DATA[currentSurah]) return;
  const surah = QURAN_DATA[currentSurah];
  const g = state.gardens[currentSurah] || {planted:[]};
  const levels = buildSurahLevels(surah.ayat.length);
  path.innerHTML = '';

  // track line
  const rail = document.createElement('div');
  rail.className = 'lvl-rail';
  path.appendChild(rail);

  levels.forEach(function(lvl, idx){
    const st = levelStatus(g, lvl);
    // lock if previous incomplete
    let unlocked = idx === 0;
    if(idx > 0){
      const prev = levelStatus(g, levels[idx-1]);
      unlocked = prev.complete;
    }
    const row = document.createElement('div');
    row.className = 'lvl-row'
      + (st.complete ? ' done' : '')
      + (!unlocked ? ' locked' : '')
      + (unlocked && !st.complete ? ' next' : '');

    const pct = st.total ? Math.round((st.done/st.total)*100) : 0;
    const barInner = st.complete ? 100 : pct;

    let rewardIcon = '<span class="coin-spin coin-spin-sm"><img src="icons/coin.png" alt=""></span>';
    if(st.complete) rewardIcon = '<span class="coin-spin coin-spin-sm"><img src="icons/coin.png" alt=""></span>';
    else if(lvl.level % 5 === 0) rewardIcon = '<span class="coin-spin coin-spin-sm"><img src="icons/coin.png" alt=""></span>';
    else if(lvl.level % 3 === 0) rewardIcon = '<span class="coin-spin coin-spin-sm"><img src="icons/coin.png" alt=""></span>';

    row.innerHTML =
      '<div class="lvl-bar">' +
        '<div class="lvl-bar-fill" style="width:'+barInner+'%"></div>' +
        '<div class="lvl-bar-text">' +
          '<span class="lvl-num">'+lvl.level+'</span>' +
          '<span class="lvl-label">Level</span>' +
          '<span class="lvl-ayah">'+_('lbl_ayah')+' '+(lvl.start+1)+'–'+lvl.end+' · '+st.done+'/'+st.total+'</span>' +
        '</div>' +
      '</div>' +
      '<div class="lvl-reward'+(st.complete?' got':'')+'">' +
        '<div class="lvl-reward-icon">'+rewardIcon+'</div>' +
        '<div class="lvl-reward-val">'+(st.complete ? _('msg_done_short') : ('+'+lvl.reward))+'</div>' +
      '</div>';

    if(unlocked && !st.complete){
      row.onclick = function(){
        window.__levelStart = lvl.start;
        window.__levelEnd = lvl.end;
        for(let i = lvl.start; i < lvl.end; i++){
          if(!g.planted[i]){ openQuiz(i); return; }
        }
      };
    } else if(st.complete){
      row.onclick = function(){
        // review full level as a continuous round
        window.__levelStart = lvl.start;
        window.__levelEnd = lvl.end;
        openQuiz(lvl.start);
      };
    }

    path.appendChild(row);
  });
}


async function openGardenByNum(n){
  const loading = document.createElement('div');
  loading.id = 'surahLoadToast';
  loading.style.cssText = 'position:fixed;bottom:20px;left:50%;transform:translateX(-50%);background:#1a2340;border:1px solid var(--glass-border);padding:10px 18px;border-radius:12px;z-index:999;font-size:13px;font-weight:700';
  loading.textContent = '⏳ '+_('lbl_surah')+' '+n+' '+_('lbl_loading')+'...';
  document.body.appendChild(loading);
  const id = await ensureSurahLoaded(n);
  loading.remove();
  if(!id) return;
  openGarden(id);
}


function closeAllOverlays(){
  try{
    document.querySelectorAll('.overlay.active').forEach(function(el){ el.classList.remove('active'); });
    const mo = document.getElementById('menuOverlay');
    const sm = document.getElementById('sideMenu');
    if(mo) mo.classList.remove('open');
    if(sm) sm.classList.remove('open');
    if(currentAudio){ try{ currentAudio.pause(); }catch(e){} currentAudio=null; }
  }catch(e){}
}

function openGarden(id){
  closeAllOverlays();
  currentSurah = id;
  const s = QURAN_DATA[id];
  if(!s) return;
  window.__dotsPage = 0;
  document.getElementById('gardenNameAr').textContent = s.nameAr;
  document.getElementById('gardenNameTa').textContent = s.nameTa;
  renderTree(); renderDots(); try{ renderLevelPath(); }catch(e){} updateDailyUI();
  switchScreen('screenGarden');
  try{ window.scrollTo(0,0); document.getElementById('screenGarden').scrollTop = 0; }catch(e){}
}

function renderTree(){
  const surah = QURAN_DATA[currentSurah], g = state.gardens[currentSurah];
  const N = surah.ayat.length, P = g.planted.filter(Boolean).length;
  const pct = N > 0 ? Math.round(P / N * 100) : 0;
  const circumference = 2 * Math.PI * 50; // r=50
  const offset = circumference - (pct / 100) * circumference;
  const ring = document.getElementById('spRingFg');
  if(ring){
    ring.style.strokeDasharray = circumference;
    ring.style.strokeDashoffset = offset;
    ring.classList.toggle('done', P >= N && N > 0);
  }
  const pctEl = document.getElementById('spPct');
  if(pctEl) pctEl.textContent = pct + '%';
  let stars = 0;
  if(P >= N && N > 0) stars = 3;
  else if(P > 0) stars = Math.max(1, Math.round(P / N * 3));
  const starsEl = document.getElementById('spStars');
  if(starsEl){
    let h = '';
    for(let i = 1; i <= 3; i++) h += i <= stars ? '⭐' : '☆';
    starsEl.textContent = h;
  }
  const countEl = document.getElementById('spCount');
  if(countEl) countEl.textContent = P + ' / ' + N + ' ' + _('lbl_ayahs');
  const progressLabel = document.getElementById('progressLabel');
  if(progressLabel) progressLabel.textContent = P + ' / ' + N + ' ' + _('lbl_ayahs');
  document.getElementById('completeBanner').classList.toggle('show', P >= N && N > 0);
}
function renderDots(){
  const surah = QURAN_DATA[currentSurah], g = state.gardens[currentSurah];
  const wrap = document.getElementById('ayahDots');
  if(!wrap || !surah || !g) return;
  wrap.innerHTML = '';
  const total = surah.ayat.length;
  const PAGE = 40;
  let page = window.__dotsPage || 0;
  const maxPage = Math.max(0, Math.ceil(total / PAGE) - 1);
  if(page > maxPage) page = maxPage;
  window.__dotsPage = page;
  const start = page * PAGE;
  const end = Math.min(total, start + PAGE);

  // nav for large surahs
  if(total > PAGE){
    const nav = document.createElement('div');
    nav.style.cssText = 'width:100%;display:flex;justify-content:center;align-items:center;gap:10px;margin:6px 0 10px;flex-wrap:wrap';
    const prev = document.createElement('button');
    prev.type = 'button';
    prev.className = 'mode-btn';
    prev.textContent = _('msg_prev');
    prev.disabled = page <= 0;
    prev.onclick = function(){ window.__dotsPage = page - 1; renderDots(); try{wrap.scrollIntoView({behavior:'smooth',block:'start'});}catch(e){} };
    const info = document.createElement('span');
    info.style.cssText = 'font-size:12px;font-weight:700;color:var(--text-dim)';
    info.textContent = (start+1) + '–' + end + ' / ' + total;
    const next = document.createElement('button');
    next.type = 'button';
    next.className = 'mode-btn';
    next.textContent = _('msg_next');
    next.disabled = page >= maxPage;
    next.onclick = function(){ window.__dotsPage = page + 1; renderDots(); try{wrap.scrollIntoView({behavior:'smooth',block:'start'});}catch(e){} };
    nav.appendChild(prev); nav.appendChild(info); nav.appendChild(next);
    wrap.appendChild(nav);
  }

  for(let i = start; i < end; i++){
    const d = document.createElement('button');
    d.type = 'button';
    d.className = 'ayah-dot' + (g.planted[i] ? ' done' : '');
    d.textContent = g.planted[i] ? '✓' : String(i+1);
    d.setAttribute('aria-label', 'Ayah '+(i+1));
    (function(idx){
      d.onclick = function(){ if(!g.planted[idx]) openQuiz(idx); };
    })(i);
    wrap.appendChild(d);
  }
}

function openQuiz(index){
  stopContinuous();
  window.__qi = index;
  // if not inside a level round, treat as single-ayah round
  if(typeof window.__levelStart !== 'number' || typeof window.__levelEnd !== 'number'){
    window.__levelStart = index;
    window.__levelEnd = index + 1;
  }
  const surah = QURAN_DATA[currentSurah];
  const correct = surah.ayat[index];
  const label = document.getElementById('quizLabel');
  const ctx = document.getElementById('contextAyah');
  const opts = document.getElementById('optionsWrap');
  const audioWrap = document.getElementById('audioWrap');
  opts.innerHTML = ''; audioWrap.innerHTML = '';

  if(surah.surahNum){
    const ab = document.createElement('button');
    ab.className = 'audio-btn';
    ab.textContent = _('msg_listen_ayah');
    ab.onclick = function(){ playAudio(surah.surahNum, index+1, ab); };
    audioWrap.appendChild(ab);
  }

  if(quizMode === 'next'){
    label.textContent = _('msg_next_ayah')+' · '+_('lbl_ayah')+' '+(index+1);
    if(index === 0){
      // First ayah of surah — show surah name + ask for ayah 1
      setContextText(ctx, (surah.nameAr||'') + ' — ஆயத்து ১ ؟', null, surah.surahNum, 1);
    } else {
      // Context = previous ayah (1-based number = index)
      setContextText(ctx, surah.ayat[index-1].ar, surah.ayat[index-1].ta || null, surah.surahNum, index);
    }
    buildOptions(correct, opts, function(){ onCorrect(index); });
  } else if(quizMode === 'blank'){
    label.textContent = _('msg_fill_blank');
    const words = correct.ar.split(/\s+/).filter(Boolean);
    if(words.length < 2){
      setContextText(ctx, correct.ar, null, surah.surahNum, index+1);
      buildOptions(correct, opts, function(){ onCorrect(index); });
    } else {
      const hi = Math.floor(Math.random() * words.length);
      const blank = words[hi];
      setContextText(ctx, words.map(function(w,i){ return i===hi ? '______' : w; }).join(' '), null);
      let pool = [];
      Object.values(QURAN_DATA).forEach(s=> s.ayat.forEach(a=> a.ar.split(/\s+/).forEach(w=>{ if(w && w!==blank) pool.push(w); })));
      pool = shuffle(pool).slice(0,3);
      const choices = shuffle([blank].concat(pool));
      choices.forEach(ch=>{
        const b = document.createElement('button');
        b.className = 'opt-btn';
        b.textContent = ch;
        b.onclick = function(){
          if(ch === blank){ b.classList.add('correct'); AudioFX.playCorrect(); setTimeout(function(){ onCorrect(index); }, 350); }
          else { b.classList.add('wrong'); AudioFX.playWrong(); }
        };
        opts.appendChild(b);
      });
    }
  } else {
    label.textContent = _('msg_pick_ayah_meaning');
    ctx.textContent = '';
    const t = document.createElement('div');
    t.style.cssText = 'font-family:var(--font-ui);font-size:15px;direction:ltr;text-align:left;color:#fff';
    t.textContent = correct.ta || '(பொருள் இல்லை)';
    ctx.appendChild(t);
    buildOptions(correct, opts, function(){ onCorrect(index); });
  }
  document.getElementById('quizOverlay').classList.add('active');
}

function buildOptions(correct, wrap, onOk){
  let samePool = [], otherPool = [];
  const cur = QURAN_DATA[currentSurah];
  if(cur) cur.ayat.forEach(a=>{ if(a.ar !== correct.ar) samePool.push(a); });
  Object.keys(QURAN_DATA).forEach(id=>{
    if(id === currentSurah) return;
    QURAN_DATA[id].ayat.forEach(a=>{ if(a.ar !== correct.ar) otherPool.push(a); });
  });
  samePool = shuffle(samePool);
  otherPool = shuffle(otherPool);
  let pool = samePool.slice(0,3);
  if(pool.length < 3) pool = pool.concat(otherPool.slice(0, 3-pool.length));
  const options = shuffle([correct].concat(pool.slice(0,3)));
  wrap.innerHTML = '';
  options.forEach(opt=>{
    const b = document.createElement('button');
    b.className = 'opt-btn';
    // Options always plain Unicode (no spans) for correct joining + no QCF codes
    b.textContent = opt.ar;
    if(showMeaning && opt.ta){
      const m = document.createElement('div');
      m.className = 'ta-meaning';
      m.textContent = opt.ta;
      b.appendChild(m);
    }
    b.onclick = function(){
      if(opt.ar === correct.ar){ b.classList.add('correct'); AudioFX.playCorrect(); setTimeout(onOk, 350); }
      else { b.classList.add('wrong'); AudioFX.playWrong(); }
    };
    wrap.appendChild(b);
  });
}

function onCorrect(index){
  state.gardens[currentSurah].planted[index] = true;
  state.coins += 10;
  updateStreak(); addDaily(); saveGame();
  if(currentAudio){ try{ currentAudio.pause(); }catch(e){} currentAudio=null; }
  updateHeader();
  try{ renderTree(); }catch(e){}
  try{ renderDots(); }catch(e){}

  // Continuous round: stay in quiz until level range is fully done
  var start = (typeof window.__levelStart === 'number') ? window.__levelStart : 0;
  var end = (typeof window.__levelEnd === 'number') ? window.__levelEnd : (QURAN_DATA[currentSurah] ? QURAN_DATA[currentSurah].ayat.length : 0);
  var g = state.gardens[currentSurah];
  var next = -1;
  for(var i = start; i < end; i++){
    if(g && !g.planted[i]){ next = i; break; }
  }

  if(next >= 0){
    // same round — next ayah, no exit
    setTimeout(function(){ openQuiz(next); }, 280);
    return;
  }

  // Round complete
  window.__levelStart = null;
  window.__levelEnd = null;
  document.getElementById('quizOverlay').classList.remove('active');
  try{ renderLevelPath(); }catch(e){}
  try{
    var toast = document.createElement('div');
    toast.style.cssText = 'position:fixed;bottom:24px;left:50%;transform:translateX(-50%);background:linear-gradient(135deg,#059669,#10b981);color:#fff;padding:12px 18px;border-radius:14px;z-index:9999;font-weight:800;font-size:13px;box-shadow:0 8px 24px rgba(0,0,0,.25)';
    toast.textContent = _('msg_level_done');
    document.body.appendChild(toast);
    setTimeout(function(){ try{ toast.remove(); }catch(e){} }, 2200);
  }catch(e){}
}

function playAudio(surahNum, ayahNum, btn){
  stopContinuous();
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  const s = String(surahNum).padStart(3,'0');
  const a = String(ayahNum).padStart(3,'0');
  const url = 'https://everyayah.com/data/Alafasy_128kbps/'+s+a+'.mp3';
  const audio = new Audio(url);
  currentAudio = audio;
  btn.textContent = _('msg_pause');
  audio.play().catch(function(){ alert(_('msg_audio_fail')); btn.textContent=_('msg_listen_ayah'); });
  audio.onended = function(){ btn.textContent=_('msg_listen_ayah'); currentAudio=null; };
  btn.onclick = function(){
    if(currentAudio){ currentAudio.pause(); currentAudio=null; btn.textContent=_('msg_listen_ayah');
      btn.onclick = function(){ playAudio(surahNum, ayahNum, btn); };
    }
  };
}

/* ===== Continuous / Juz-wise Audio Player (all 30 Juz) ===== */
let contQueue = [];
let contIndex = 0;
let contPlaying = false;
let contPaused = false;
let contActiveSurahId = null;
let contActiveAyat = null; // [{ar,ta,ayahNum}] for current playing surah
let currentJuzView = null; // null = juz list, number = surah list of that juz
let JUZ_CACHE = {}; // juzNum -> {surahs: [{id, surahNum, nameAr, nameEn, nameTa, ayat:[{ar,ta}]}]}

function buildSurahQueueFromObj(s){
  if(!s || !s.surahNum) return [];
  return s.ayat.map((a,i)=>({id:s.id||('s'+s.surahNum), surahNum:s.surahNum, ayahNum:i+1, nameTa:s.nameTa||s.nameEn||'', nameAr:s.nameAr||'', ar:a.ar, ta:a.ta||''}));
}

function buildSurahQueue(surahId){
  const s = QURAN_DATA[surahId];
  if(!s || !s.surahNum) return [];
  return s.ayat.map((a,i)=>({id:surahId, surahNum:s.surahNum, ayahNum:i+1, nameTa:s.nameTa, nameAr:s.nameAr, ar:a.ar, ta:a.ta||''}));
}


function setJuzPlayIcon(state){
  /* state: 'play' | 'pause' */
  var btn = document.getElementById('juzPlayBtn');
  var icon = document.getElementById('juzPlayIcon');
  if(!btn || !icon) return;
  if(state === 'pause'){
    icon.src = 'icons/icon-stop.png';
    icon.alt = 'Pause';
    btn.classList.add('playing-state');
    btn.setAttribute('title', 'Pause');
    btn.setAttribute('aria-label', 'Pause');
  } else {
    icon.src = 'icons/icon-heart.png';
    icon.alt = 'Play';
    btn.classList.remove('playing-state');
    btn.setAttribute('title', 'Play');
    btn.setAttribute('aria-label', 'Play');
  }
}

function stopContinuous(){
  contPlaying = false;
  contPaused = false;
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  const playBtn = document.getElementById('juzPlayBtn');
  if(playBtn) setJuzPlayIcon('play');
  const surahBtn = document.getElementById('playSurahAllBtn');
  if(surahBtn) surahBtn.textContent = _('msg_listen_surah');
  document.querySelectorAll('.juz-surah-card').forEach(el=>el.classList.remove('playing'));
}

function renderAyahPanel(){
  const panel = document.getElementById('juzAyahPanel');
  if(!panel) return;
  // Full-juz mode: show entire contQueue (start ayah → end ayah)
  const useQueue = window.__juzFullMode && contQueue && contQueue.length;
  if(!contQueue.length){
    panel.classList.remove('show');
    panel.innerHTML = '';
    panel.dataset.sid = '';
    return;
  }
  if(!useQueue && !contActiveAyat){
    panel.classList.remove('show');
    panel.innerHTML = '';
    panel.dataset.sid = '';
    return;
  }
  panel.classList.add('show');
  panel.style.display = 'block';
  const sid = useQueue ? ('juz-full-'+(window.__juzFullId||'')) : (contActiveSurahId || '');
  if(panel.dataset.sid !== sid){
    panel.dataset.sid = sid;
    panel.innerHTML = '';
    const rows = useQueue ? contQueue : contActiveAyat;
    rows.forEach(function(a,i){
      const row = document.createElement('div');
      row.className = 'juz-ayah-row';
      const arHtml = (typeof tajweedOn !== 'undefined' && tajweedOn && typeof tajweedify==='function')
        ? tajweedify(a.ar||'') : (a.ar||'');
      const label = useQueue
        ? ((a.nameTa||a.nameAr||'') + ' · ஆயத்து ' + a.ayahNum)
        : (_('lbl_ayah') + ' ' + (a.ayahNum || (i+1)));
      row.innerHTML =
        '<div class="juz-ayah-num">'+label+'</div>'+
        '<div class="juz-ayah-ar">'+arHtml+'</div>'+
        (a.ta ? '<div class="juz-ayah-ta">'+a.ta+'</div>' : '');
      row.onclick = function(){ playContinuousAt(i); };
      panel.appendChild(row);
    });
  }
  panel.querySelectorAll('.juz-ayah-row').forEach(function(row,i){
    row.classList.toggle('active', i === contIndex);
  });
  const active = panel.querySelector('.juz-ayah-row.active');
  if(active) active.scrollIntoView({block:'nearest', behavior:'smooth'});
}

function updateJuzUI(){
  const now = document.getElementById('juzNowPlaying');
  const fill = document.getElementById('juzProgressFill');
  const info = document.getElementById('juzTrackInfo');
  const bar = document.getElementById('juzPlayerBar');
  if(contQueue.length && bar) bar.style.display = '';
  if(!contQueue.length){
    if(now) now.textContent = _('msg_tap_surah_listen');
    if(fill) fill.style.width = '0%';
    if(info) info.textContent = '—';
    renderAyahPanel();
    return;
  }
  const cur = contQueue[contIndex] || contQueue[0];
  if(now) now.textContent = (cur.nameTa||cur.nameAr||'') + ' · ஆயத்து ' + cur.ayahNum;
  if(fill) fill.style.width = ((contIndex+1)/contQueue.length*100) + '%';
  if(info) info.textContent = _('lbl_ayah') + ' ' + (contIndex+1) + ' / ' + contQueue.length;
  document.querySelectorAll('.juz-surah-card').forEach(el=>{
    el.classList.toggle('playing', el.dataset.sid === contActiveSurahId && contPlaying);
  });
  renderAyahPanel();
}

function playContinuousAt(idx){
  if(!contQueue.length) return;
  contIndex = Math.max(0, Math.min(idx, contQueue.length-1));
  contPlaying = true;
  contPaused = false;
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  const item = contQueue[contIndex];
  contActiveSurahId = item.id;
  const s = String(item.surahNum).padStart(3,'0');
  const a = String(item.ayahNum).padStart(3,'0');
  const url = 'https://everyayah.com/data/Alafasy_128kbps/'+s+a+'.mp3';
  const audio = new Audio(url);
  currentAudio = audio;
  updateJuzUI();
  const playBtn = document.getElementById('juzPlayBtn');
  if(playBtn) setJuzPlayIcon('pause');
  const surahBtn = document.getElementById('playSurahAllBtn');
  if(surahBtn && currentSurah && contQueue[0] && contQueue[0].id===currentSurah){
    surahBtn.textContent = _('msg_pause');
  }
  audio.play().catch(function(){
    alert(_('msg_audio_fail'));
    stopContinuous();
    updateJuzUI();
  });
  audio.onended = function(){
    if(!contPlaying) return;
    if(contIndex < contQueue.length-1){
      playContinuousAt(contIndex+1);
    } else {
      stopContinuous();
      updateJuzUI();
      if(document.getElementById('juzNowPlaying')) document.getElementById('juzNowPlaying').textContent = '✅ '+(item.nameTa||'')+' முடிந்தது';
    }
  };
}

function toggleContinuousPlay(){
  if(!contQueue.length) return;
  if(contPlaying && !contPaused){
    if(currentAudio) currentAudio.pause();
    contPaused = true;
    contPlaying = false;
    const playBtn = document.getElementById('juzPlayBtn');
    if(playBtn) setJuzPlayIcon('play');
    document.querySelectorAll('.juz-surah-card').forEach(el=>el.classList.remove('playing'));
  } else if(contPaused && currentAudio){
    currentAudio.play();
    contPaused = false;
    contPlaying = true;
    const playBtn = document.getElementById('juzPlayBtn');
    if(playBtn) setJuzPlayIcon('pause');
    updateJuzUI();
  } else {
    playContinuousAt(contIndex);
  }
}

function playSurahFromJuzObj(s){
  stopContinuous();
  contQueue = buildSurahQueueFromObj(s);
  contIndex = 0;
  contActiveSurahId = s.id || ('s'+s.surahNum);
  contActiveAyat = s.ayat.map((a,i)=>({ar:a.ar, ta:a.ta||'', ayahNum:i+1}));
  if(!contQueue.length){ alert(_('msg_no_audio')); return; }
  const bar = document.getElementById('juzPlayerBar');
  if(bar) bar.style.display = '';
  playContinuousAt(0);
}

function playSurahFromJuz(surahId){
  const s = QURAN_DATA[surahId];
  if(!s) return;
  playSurahFromJuzObj({id:surahId, surahNum:s.surahNum, nameAr:s.nameAr, nameTa:s.nameTa, ayat:s.ayat});
}

async function fetchJuzData(juzNum){
  var cacheKey = juzNum + '_' + (typeof currentScript !== 'undefined' ? currentScript : 'indopak');
  if(JUZ_CACHE[cacheKey]) return JUZ_CACHE[cacheKey];

  // Prefer local QURAN_DATA for any juz when we already have those surahs loaded
  var localSurahs = [];
  try {
    var nums = (typeof getSurahNumsForJuz === 'function') ? getSurahNumsForJuz(juzNum) : null;
    if(nums && nums.length && typeof SURAH_META !== 'undefined'){
      var allLocal = true;
      var built = [];
      for(var i=0;i<nums.length;i++){
        var n = nums[i];
        var id = (typeof surahIdForNum === 'function') ? surahIdForNum(n) : ('s'+n);
        var s = QURAN_DATA[id];
        if(!s || !s.ayat || !s.ayat.length){ allLocal = false; break; }
        built.push({
          id: id,
          surahNum: s.surahNum || n,
          nameAr: s.nameAr || '',
          nameEn: '',
          nameTa: s.nameTa || (n+''),
          ayat: s.ayat.map(function(a){ return {ar: a.ar||'', ta: a.ta||''}; })
        });
      }
      if(allLocal && built.length){
        JUZ_CACHE[cacheKey] = {surahs: built};
        return JUZ_CACHE[cacheKey];
      }
    }
  } catch(e){}

  // Fetch correct script from Quran.com API (by juz)
  var isUth = (typeof currentScript !== 'undefined' && currentScript === 'uthmani');
  var edition = isUth ? 'uthmani' : 'indopak';
  var field = isUth ? 'text_uthmani' : 'text_indopak';
  var url = 'https://api.quran.com/api/v4/quran/verses/' + edition + '?juz_number=' + juzNum;

  try {
    var arRes = await fetch(url);
    if(!arRes.ok) throw new Error('API ' + arRes.status);
    var arData = await arRes.json();
    var verses = arData.verses || [];
    if(!verses.length) throw new Error('empty juz');

    // verse_key like "78:1"
    var bySurah = {};
    verses.forEach(function(v){
      var key = String(v.verse_key || '');
      var parts = key.split(':');
      var sn = parseInt(parts[0], 10);
      var an = parseInt(parts[1], 10);
      if(!sn) return;
      if(!bySurah[sn]){
        var meta = (typeof SURAH_META !== 'undefined') ? SURAH_META.find(function(m){ return m.n === sn; }) : null;
        bySurah[sn] = {
          id: (sn === 1 ? 'fatiha' : 's'+sn),
          surahNum: sn,
          nameAr: (meta && meta.ar) || '',
          nameEn: (meta && meta.en) || '',
          nameTa: sn + '. ' + ((meta && meta.en) || ''),
          ayat: []
        };
      }
      var raw = String(v[field] || v.text_uthmani || v.text_indopak || '').replace(/^\uFEFF/,'').trim();
      // First ayah of surah: strip bismillah except Fatiha & Tawbah
      if(an === 1){
        raw = stripBismillah(raw, sn);
      }
      bySurah[sn].ayat.push({ar: raw, ta: ''});
    });

    var surahs = Object.keys(bySurah).map(Number).sort(function(a,b){ return a-b; }).map(function(n){ return bySurah[n]; });
    // Note: Juz may contain PARTIAL surahs — do not overwrite full garden data with partial slices.
    // Only fill QURAN_DATA when we clearly have a complete surah (matches SURAH_META ayah count).
    surahs.forEach(function(s){
      var meta = (typeof SURAH_META !== 'undefined') ? SURAH_META.find(function(m){ return m.n === s.surahNum; }) : null;
      var expected = meta && meta.a ? meta.a : 0;
      var complete = expected > 0 && s.ayat.length === expected;
      if(complete){
        if(!QURAN_DATA[s.id] || !QURAN_DATA[s.id].ayat || QURAN_DATA[s.id].ayat.length !== expected){
          QURAN_DATA[s.id] = {
            nameAr: s.nameAr,
            nameTa: s.nameTa,
            surahNum: s.surahNum,
            ayat: s.ayat.slice()
          };
          if(!state.gardens[s.id] || state.gardens[s.id].planted.length !== expected){
            state.gardens[s.id] = {planted: Array(expected).fill(false)};
          }
        } else {
          for(var i=0;i<s.ayat.length;i++){
            QURAN_DATA[s.id].ayat[i].ar = s.ayat[i].ar;
          }
        }
        try{ saveData(); saveGame(); }catch(e){}
      }
    });

    JUZ_CACHE[cacheKey] = {surahs: surahs};
    return JUZ_CACHE[cacheKey];
  } catch(err){
    console.warn('Juz fetch failed, trying chapter-by-chapter', err);
    // Fallback: load each surah via ensureSurahLoaded
    var nums2 = (typeof getSurahNumsForJuz === 'function') ? getSurahNumsForJuz(juzNum) : null;
    if(!nums2 || !nums2.length) throw err;
    var built2 = [];
    for(var j=0;j<nums2.length;j++){
      var nn = nums2[j];
      var id2 = null;
      if(typeof ensureSurahLoaded === 'function'){
        id2 = await ensureSurahLoaded(nn);
      }
      if(!id2) id2 = (typeof surahIdForNum === 'function') ? surahIdForNum(nn) : ('s'+nn);
      var ss = QURAN_DATA[id2];
      if(ss && ss.ayat && ss.ayat.length){
        built2.push({
          id: id2,
          surahNum: ss.surahNum || nn,
          nameAr: ss.nameAr || '',
          nameEn: '',
          nameTa: ss.nameTa || '',
          ayat: ss.ayat.map(function(a){ return {ar: a.ar||'', ta: a.ta||''}; })
        });
      }
    }
    if(!built2.length) throw err;
    JUZ_CACHE[cacheKey] = {surahs: built2};
    return JUZ_CACHE[cacheKey];
  }
}

function showJuzNumberGrid(){
  currentJuzView = null;
  stopContinuous();
  contQueue = [];
  contActiveAyat = null;
  contActiveSurahId = null;
  window.__juzFullMode = false;
  window.__juzFullId = null;
  document.getElementById('juzScreenTitle').textContent = _('msg_juz_audio_title');
  document.getElementById('juzSurahListTitle').textContent = _('msg_pick_juz');
  document.getElementById('juzPlayerBar').style.display = 'none';
  document.getElementById('juzAyahPanel').classList.remove('show');
  document.getElementById('juzAyahPanel').innerHTML = '';
  document.getElementById('juzSurahGrid').style.display = 'none';
  document.getElementById('juzSurahGrid').innerHTML = '';
  document.getElementById('juzLoading').style.display = 'none';
  const grid = document.getElementById('juzNumGrid');
  grid.style.display = 'grid';
  grid.innerHTML = '';
  for(let j=1;j<=30;j++){
    const card = document.createElement('div');
    card.className = 'juz-num-card' + (j===30?' local':'');
    const nm = (typeof juzName === 'function') ? juzName(j) : ('Juz '+j);
    card.innerHTML = '<div class="jn">'+j+'</div><div class="jl">'+nm+'</div>';
    card.title = (typeof juzRange === 'function' ? juzRange(j) : '');
    card.onclick = function(){ openJuzReading(j); };
    grid.appendChild(card);
  }
}

async function openJuzSurahs(juzNum){
  return openJuzReading(juzNum);
}

function renderJuzList(){
  showJuzNumberGrid();
}

const BADGES = [
  {id:'first', name:'முதல் விதை', icon:'🌱', check:s=>Object.values(s.gardens).some(g=>g.planted.some(Boolean))},
  {id:'tree', name:'முதல் மரம்', icon:'icons/tree-64.png', check:s=>Object.keys(QURAN_DATA).some(id=>{const g=s.gardens[id]; return g&&g.planted.length&&g.planted.every(Boolean);})},
  {id:'c50', name:'50 Coins', icon:'🪙', check:s=>s.coins>=50},
  {id:'c200', name:'200 Coins', icon:'💰', check:s=>s.coins>=200},
  {id:'st3', name:'3 Day Streak', icon:'🔥', check:()=>(meta.streak||0)>=3},
  {id:'st7', name:'7 Day Streak', icon:'⚡', check:()=>(meta.streak||0)>=7},
];


/* ===== Premium Leaderboard (சாதனைகள்) ===== */
var selectedLbLevel = 1;

var selectedLbFilter = 'all';
var selectedLbLevel = 1;

function renderPremiumLeaderboard(){
  ensureLevelMeta();
  checkLevelCompletions();
  var tabs = document.getElementById('lbLevelTabs');
  var podium = document.getElementById('lbPodium');
  var list = document.getElementById('lbList');
  var you = document.getElementById('lbYou');
  var filters = document.getElementById('lbFilters');
  if(!podium || !list) return;

  // filters
  if(filters){
    filters.querySelectorAll('.plb-filter').forEach(function(btn){
      btn.classList.toggle('active', btn.getAttribute('data-filter') === selectedLbFilter);
      btn.onclick = function(){
        selectedLbFilter = btn.getAttribute('data-filter');
        renderPremiumLeaderboard();
      };
    });
  }

  // level tabs
  if(tabs){
    var th = '';
    for(var lv = 1; lv <= SURAH_LEVEL_COUNT; lv++){
      var st = levelStats(lv);
      var cls = 'plb-lv' + (lv === selectedLbLevel ? ' active' : '') + (st.complete ? ' done' : '');
      th += '<button type="button" class="' + cls + '" data-lbl="' + lv + '">L' + lv + '</button>';
    }
    tabs.innerHTML = th;
    tabs.querySelectorAll('[data-lbl]').forEach(function(btn){
      btn.onclick = function(){
        selectedLbLevel = parseInt(btn.getAttribute('data-lbl'), 10);
        renderPremiumLeaderboard();
      };
    });
  }

  var now = Date.now();
  var dayMs = 86400000;
  var entries = (meta.leaderboard || []).filter(function(e){
    if(e.level !== selectedLbLevel) return false;
    if(selectedLbFilter === 'daily') return (now - (e.at||0)) < dayMs;
    if(selectedLbFilter === 'weekly') return (now - (e.at||0)) < dayMs * 7;
    return true;
  });
  entries.sort(function(a,b){ return (a.at||0) - (b.at||0); });

  function av(name, frame){
    var letter = ((name||'வ').trim().charAt(0) || 'வ').toUpperCase();
    return '<div class="plb-av plb-av-' + frame + '"><span>' + letter + '</span></div>';
  }

  // Podium 2 | 1 | 3
  var slots = [
    { place: 2, e: entries[1], frame: 'silver', medal: '🥈' },
    { place: 1, e: entries[0], frame: 'gold', medal: '🥇' },
    { place: 3, e: entries[2], frame: 'bronze', medal: '🥉' }
  ];
  var ph = '';
  var rankIcons = {1:'icons/rank1.png', 2:'icons/rank2.png', 3:'icons/rank3.png'};
  slots.forEach(function(s){
    var name = s.e ? (s.e.name || 'வீரர்') : '—';
    var rank = s.e ? (RANK_LABEL[s.e.rank] || '') : '';
    var icon = rankIcons[s.place] || 'icons/rank1.png';
    ph += '<div class="plb-pod plb-pod-' + s.frame + (s.e ? '' : ' empty') + '">' +
      '<div class="plb-pod-top">' +
        '<img src="' + icon + '" alt="' + s.place + '" class="plb-rank-badge' + (s.place===1?' plb-rank-badge-1':'') + '">' +
        '<div class="plb-pod-name">' + name + '</div>' +
        '<div class="plb-pod-rank">' + rank + '</div>' +
      '</div>' +
      '<div class="plb-pod-base">' +
        '<div class="plb-pod-num">' + s.place + '</div>' +
        '<div class="plb-pod-xp">⭐ ' + (s.e ? (s.e.stars||0) : '—') + '</div>' +
      '</div>' +
    '</div>';
  });
  podium.innerHTML = ph;

  // List (all including top3 for full list, or skip top3)
  if(!entries.length){
    list.innerHTML = '<div class="plb-empty">'+_('msg_lb_empty')+'</div>';
  } else {
    var lh = '';
    entries.forEach(function(e, i){
      var place = i + 1;
      var pad = place < 10 ? '0' + place : '' + place;
      lh += '<div class="plb-row">' +
        '<div class="plb-row-rank">' + pad + '</div>' +
        av(e.name, place===1?'gold':place===2?'silver':place===3?'bronze':'default') +
        '<div class="plb-row-info">' +
          '<div class="plb-row-name">' + (e.name||'வீரர்') + '</div>' +
          '<div class="plb-row-meta">Level ' + e.level + ' · ' + (RANK_LABEL[e.rank]||'') + '</div>' +
        '</div>' +
        '<div class="plb-row-xp"><span>⭐</span> ' + (e.stars||0) + '</div>' +
      '</div>';
    });
    list.innerHTML = lh;
  }

  // Current user card
  if(you){
    var myName = meta.playerName || 'வீரர்';
    var myEntry = null;
    var myPlace = '—';
    for(var i=0;i<entries.length;i++){
      if((entries[i].name||'') === myName){ myEntry = entries[i]; myPlace = i+1; break; }
    }
    // overall progress approx
    var totalDone = 0, totalStars = 0;
    for(var lv=1; lv<=SURAH_LEVEL_COUNT; lv++){
      var st = levelStats(lv);
      totalDone += st.done;
      totalStars += st.stars;
    }
    you.innerHTML =
      '<div class="plb-you-label">நீங்கள்</div>' +
      '<div class="plb-you-rank">#' + myPlace + '</div>' +
      av(myName, 'gold') +
      '<div class="plb-you-info">' +
        '<div class="plb-you-name">' + myName + '</div>' +
        '<div class="plb-you-meta">'+_('lbl_surah')+' ' + totalDone + '/114 · ⭐ ' + totalStars + '</div>' +
      '</div>' +
      '<div class="plb-you-arrow">↑</div>';
  }
}


function renderBadges(){
  try{ renderPremiumLeaderboard(); }catch(e){}
  const grid = document.getElementById('badgeGrid');
  if(!grid) return;
  grid.innerHTML = '';
  BADGES.forEach(b=>{
    const ok = b.check(state);
    if(ok && !meta.badges[b.id]){ meta.badges[b.id]=true; saveMeta(); }
    const el = document.createElement('div');
    el.className = 'badge-card' + (ok?'':' locked');
    var iconHtml = (b.icon && (b.icon.indexOf('.png')>-1 || b.icon.indexOf('icons/')===0))
      ? '<img src="'+b.icon+'" alt="" class="badge-tree-img">'
      : b.icon;
    el.innerHTML = '<div class="badge-icon">'+iconHtml+'</div><div class="badge-name">'+b.name+'</div>';
    grid.appendChild(el);
  });
}

function openSideMenu(){
  // Old side menu removed — home tiles are the menu
  try{ if(typeof switchScreen==='function') switchScreen('screenSelect'); showHomeHub(true); }catch(e){}
}
function closeSideMenu(){
  try{ if(typeof AudioFX!=="undefined"&&AudioFX.playSoft) AudioFX.playSoft(); }catch(e){}
  document.getElementById('sideMenu').classList.remove('open');
  document.getElementById('menuOverlay').classList.remove('open');
  document.body.style.overflow = '';
}

// Events
var __omb = document.getElementById('openMenuBtn'); if(__omb) __omb.onclick = openSideMenu;
document.getElementById('closeMenuBtn').onclick = closeSideMenu;
document.getElementById('menuOverlay').onclick = closeSideMenu;
/* ===== திக்ர் ===== */

/* ===== Dhikr sound effects ===== */
const DhikrSFX = {
  enabled: true,
  _ctx: null,
  init: function(){
    if(!this._ctx){
      try{ this._ctx = new (window.AudioContext||window.webkitAudioContext)(); }catch(e){}
    }
    if(this._ctx && this._ctx.state === 'suspended') this._ctx.resume();
  },
  _tone: function(freq, dur, type, vol, slide){
    if(!this.enabled) return;
    if(typeof AudioFX !== 'undefined' && AudioFX.enabled === false) return;
    try{
      this.init();
      if(!this._ctx) return;
      const t = this._ctx.currentTime;
      const o = this._ctx.createOscillator();
      const g = this._ctx.createGain();
      o.type = type || 'sine';
      o.frequency.setValueAtTime(freq, t);
      if(slide) o.frequency.exponentialRampToValueAtTime(Math.max(80, slide), t + dur);
      g.gain.setValueAtTime(vol || 0.08, t);
      g.gain.exponentialRampToValueAtTime(0.001, t + dur);
      o.connect(g); g.connect(this._ctx.destination);
      o.start(t); o.stop(t + dur + 0.02);
    }catch(e){}
  },
  click: function(){
    // soft bead-like tick
    this._tone(920, 0.06, 'sine', 0.07);
    this._tone(620, 0.08, 'triangle', 0.04);
  },
  milestone: function(){
    // short pleasant chime (every 33 / target)
    this._tone(523, 0.12, 'sine', 0.09, 780);
    setTimeout(()=>{ this._tone(659, 0.14, 'sine', 0.08); }, 80);
  },
  complete: function(){
    this._tone(523, 0.15, 'sine', 0.1, 660);
    setTimeout(()=>{ this._tone(659, 0.15, 'sine', 0.09, 784); }, 100);
    setTimeout(()=>{ this._tone(784, 0.2, 'sine', 0.08); }, 220);
  }
};
function playClick(){ DhikrSFX.click(); }
function playSuccess(){ DhikrSFX.complete(); }


const DHIKR_LIST = [
  {ar:"سُبْحَانَ اللَّهِ", ta:"சுப்ஹானல்லாஹ்", en:"Subhanallah", mean:"அல்லாஹ் தூய்மையானவன்.", meanEn:"Glory be to Allah."},
  {ar:"الْحَمْدُ لِلَّهِ", ta:"அல்ஹம்துலில்லாஹ்", en:"Alhamdulillah", mean:"அனைத்துப் புகழும் அல்லாஹ்வுக்கே.", meanEn:"All praise is for Allah."},
  {ar:"اللَّهُ أَكْبَرُ", ta:"அல்லாஹு அக்பர்", en:"Allahu Akbar", mean:"அல்லாஹ் மிகப்பெரியவன்.", meanEn:"Allah is the Greatest."},
  {ar:"لَا إِلَٰهَ إِلَّا اللَّهُ", ta:"லா இலாஹ இல்லல்லாஹ்", en:"La ilaha illallah", mean:"அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை.", meanEn:"There is no god but Allah."},
  {ar:"أَسْتَغْفِرُ اللَّهَ", ta:"அஸ்தஃபிருல்லாஹ்", en:"Astaghfirullah", mean:"நான் அல்லாஹ்விடம் மன்னிப்புக் கேட்கிறேன்.", meanEn:"I seek forgiveness from Allah."},
  {ar:"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ", ta:"சுப்ஹானல்லாஹி வபிஹம்திஹி", en:"Subhanallahi wa bihamdihi", mean:"அல்லாஹ் தூய்மையானவன்; அவனைப் புகழ்கிறேன்.", meanEn:"Glory and praise be to Allah."},
  {ar:"سُبْحَانَ اللَّهِ الْعَظِيمِ", ta:"சுப்ஹானல்லாஹில் அழீம்", en:"Subhanallahil Azeem", mean:"மகத்தான அல்லாஹ் தூய்மையானவன்.", meanEn:"Glory be to Allah, the Magnificent."},
  {ar:"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ", ta:"சுப்ஹானல்லாஹி வபிஹம்திஹி, சுப்ஹானல்லாஹில் அழீம்", en:"Subhanallahi wa bihamdihi, Subhanallahil Azeem", mean:"இரட்டை தஸ்பீஹ் — மிகவும் சிறந்த திக்ர்.", meanEn:"Double tasbih — among the best dhikr."},
  {ar:"لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ", ta:"லா ஹவ்ல வலா குவ்வத்த இல்லா பில்லாஹ்", en:"La hawla wa la quwwata illa billah", mean:"அல்லாஹ்வின் உதவியின்றி எந்த மாற்றமும் ஆற்றலும் இல்லை.", meanEn:"There is no power nor strength except with Allah."},
  {ar:"حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ", ta:"ஹஸ்புனல்லாஹு வனிஃமல் வகீல்", en:"Hasbunallahu wa ni'mal wakeel", mean:"அல்லாஹ்வே எங்களுக்குப் போதுமானவன்; சிறந்த பொறுப்பாளன்.", meanEn:"Allah is sufficient for us, and He is the best Disposer of affairs."},
  {ar:"اللَّهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ", ta:"அல்லாஹும்ம ஸல்லி அலா முஹம்மத்", en:"Allahumma salli ala Muhammad", mean:"இறைவா, முஹம்மத் (ஸல்) அவர்கள் மீது சல்வாத் பொழிவாயாக.", meanEn:"O Allah, send blessings upon Muhammad."},
  {ar:"رَبِّ اغْفِرْ لِي", ta:"ரப்பிஃக்பிர் லி", en:"Rabbighfir li", mean:"என் இறைவா, என்னை மன்னிப்பாயாக.", meanEn:"My Lord, forgive me."},
  {ar:"يَا حَيُّ يَا قَيُّومُ", ta:"யா ஹய்யு யா கய்யூம்", en:"Ya Hayyu Ya Qayyum", mean:"வாழ்விப்பவரே! நிலைத்திருப்பவரே!", meanEn:"O Ever-Living, O Self-Sustaining!"},
  {ar:"اللَّهُمَّ بَارِكْ", ta:"அல்லாஹும்ம பாரிக்", en:"Allahumma barik", mean:"இறைவா, பரக்கத் வழங்குவாயாக.", meanEn:"O Allah, grant barakah."},
  {ar:"بِسْمِ اللَّهِ", ta:"பிஸ்மில்லாஹ்", en:"Bismillah", mean:"அல்லாஹ்வின் பெயரால்.", meanEn:"In the name of Allah."}
];


const SALAH_DHIKR_STEPS = [
  {ar:"سُبْحَانَ اللَّهِ", ta:"சுப்ஹானல்லாஹ்", en:"Subhanallah", target:33},
  {ar:"الْحَمْدُ لِلَّهِ", ta:"அல்ஹம்துலில்லாஹ்", en:"Alhamdulillah", target:33},
  {ar:"اللَّهُ أَكْبَرُ", ta:"அல்லாஹு அக்பர்", en:"Allahu Akbar", target:33},
  {ar:"لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
   ta:"லா இலாஹ இல்லல்லாஹு வஹ்தஹு லா ஷரீக்க லஹு...", en:"La ilaha illallahu wahdahu la sharika lahu...", target:1}
];

let dhikrMode = 'free'; // 'free' | 'salah'
let dhikrStep = 0;
let dhikrCount = 0;
let dhikrCurrent = DHIKR_LIST[0];
let dhikrTarget = 0; // 0 = unlimited

function renderDhikrList(){
  const box = document.getElementById('dhikrList');
  if(!box) return;
  box.className = 'dhikr-list';
  var isEn = (typeof I18N !== 'undefined' && I18N.lang === 'en');
  box.innerHTML = DHIKR_LIST.map((d,i)=>{
    var translit = isEn ? (d.en || d.ta) : d.ta;
    var meaning = isEn ? (d.meanEn || d.mean) : d.mean;
    return `
    <div class="dhikr-card${dhikrMode==='free' && dhikrCurrent && dhikrCurrent.ar===d.ar ? ' selected' : ''}" data-i="${i}">
      <div class="dhikr-num">${i+1}</div>
      <div class="dhikr-body">
        <div class="dhikr-ar">${d.ar}</div>
        <div class="dhikr-ta">${translit}</div>
        <div class="dhikr-mean">${meaning}</div>
      </div>
      <span class="dhikr-check">✓</span>
    </div>`;
  }).join('');
  box.querySelectorAll('.dhikr-card').forEach(card=>{
    card.onclick = function(){
      const i = +card.dataset.i;
      dhikrMode = 'free';
      dhikrCurrent = DHIKR_LIST[i];
      dhikrCount = 0;
      dhikrTarget = 0;
      updateSalahDhikrUI();
      renderDhikrList();
      playDhikrAnim();
    };
  });
}

function updateSalahDhikrUI(){
  const elL = document.getElementById('dhikrStepLabel');
  const elA = document.getElementById('dhikrStepAr');
  const elTa = document.getElementById('dhikrStepTa');
  const elC = document.getElementById('dhikrCount');
  const elBead = document.getElementById('dhikrBead');
  const elT = document.getElementById('dhikrTarget');
  const elB = document.getElementById('dhikrBar');
  const elH = document.getElementById('dhikrModeHint');
  if(!elA) return;

  if(dhikrMode === 'salah'){
    const step = SALAH_DHIKR_STEPS[dhikrStep];
    elL.textContent = (isEnLang() ? '🕌 After prayer · Step ' : '🕌 தொழுகைக்குப் பின் · படி ') + (dhikrStep+1) + '/' + SALAH_DHIKR_STEPS.length;
    elA.textContent = step.ar;
    elA.style.fontSize = step.target===1 ? '16px' : '24px';
    if(elTa) elTa.textContent = isEnLang() ? (step.en || step.ta) : step.ta;
    dhikrTarget = step.target;
  } else {
    elL.textContent = isEnLang() ? '📿 Tasbih' : '📿 தஸ்பீஹ்';
    elA.textContent = dhikrCurrent.ar;
    elA.style.fontSize = dhikrCurrent.ar.length > 40 ? '16px' : '24px';
    if(elTa) elTa.textContent = isEnLang() ? (dhikrCurrent.en || dhikrCurrent.ta) : dhikrCurrent.ta;
    dhikrTarget = 0;
  }

  if(elC) elC.textContent = dhikrCount;
  if(elBead) elBead.textContent = dhikrCount;
  if(elT) elT.textContent = dhikrTarget > 0 ? (dhikrCount + ' / ' + dhikrTarget) : (dhikrCount + ' / ∞');
  if(elB){
    if(dhikrTarget > 0) elB.style.width = Math.min(100, (dhikrCount/dhikrTarget)*100) + '%';
    else elB.style.width = Math.min(100, (dhikrCount % 33) / 33 * 100) + '%';
  }
  if(elH){
    elH.textContent = dhikrMode==='salah'
      ? (isEnLang() ? 'Sequence: 33 + 33 + 33 + Tahlil · tap the box' : 'வரிசை: 33 + 33 + 33 + தஹ்லீல் · பெட்டியைத் தொடுங்கள்')
      : (isEnLang() ? 'Select a dhikr above · tap the box to count' : 'திக்ர் கார்டைத் தேர்ந்தெடுங்கள் · பெட்டியைத் தொட்டு எண்ணுங்கள்');
  }
}

function playDhikrAnim(ev){
  const box = document.getElementById('dhikrTapArea');
  if(!box) return;
  box.classList.remove('tap-pulse');
  void box.offsetWidth;
  box.classList.add('tap-pulse');
  // ripple
  if(ev && ev.clientX){
    const rect = box.getBoundingClientRect();
    const r = document.createElement('span');
    r.className = 'dhikr-ripple';
    const size = 40;
    r.style.width = r.style.height = size + 'px';
    r.style.left = (ev.clientX - rect.left - size/2) + 'px';
    r.style.top = (ev.clientY - rect.top - size/2) + 'px';
    box.appendChild(r);
    setTimeout(()=> r.remove(), 500);
  }
  try{ if(typeof playClick==='function') playClick(); }catch(e){}
}

function dhikrInc(n, ev){
  if(n > 0){
    playDhikrAnim(ev);
    try{ DhikrSFX.click(); }catch(e){}
  }
  if(dhikrMode === 'salah'){
    const step = SALAH_DHIKR_STEPS[dhikrStep];
    if(!step) return;
    dhikrCount = Math.max(0, dhikrCount + n);
    if(n > 0 && dhikrCount >= step.target){
      if(dhikrStep < SALAH_DHIKR_STEPS.length-1){
        try{ DhikrSFX.milestone(); }catch(e){}
        dhikrStep++;
        dhikrCount = 0;
      } else {
        dhikrCount = step.target;
        try{ DhikrSFX.complete(); }catch(e){}
      }
    }
  } else {
    const prev = dhikrCount;
    dhikrCount = Math.max(0, dhikrCount + n);
    // milestone every 33 counts in free mode
    if(n > 0 && dhikrCount > 0 && dhikrCount % 33 === 0){
      try{ DhikrSFX.milestone(); }catch(e){}
    }
  }
  updateSalahDhikrUI();
}


/* ===== 40 Rabbana Duas (Quran) + Tamil ===== */
const RABBANA_DUAS = [
  {ar:"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ", ta:"எங்கள் இறைவா! எங்களிடமிருந்து ஏற்றுக்கொள்வாயாக; நிச்சயமாக நீயே செவியுறுபவன், அறிந்தவன்.", en:"Our Lord, accept from us. Indeed, You are the Hearing, the Knowing.", ref:"2:127"},
  {ar:"رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ", ta:"எங்கள் இறைவா! எங்களை உனக்குக் கீழ்ப்படிந்தவர்களாக்குவாயாக; எங்கள் சந்ததியிலிருந்தும் உனக்குக் கீழ்ப்படிந்த சமுதாயத்தை உருவாக்குவாயாக; எங்கள் வழிபாட்டு முறைகளைக் காட்டுவாயாக; எங்களை மன்னிப்பாயாக. நீயே மன்னிப்பவன், நிகரற்ற அன்புடையோன்.", en:"Our Lord, make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.", ref:"2:128"},
  {ar:"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! இவ்வுலகில் நன்மையை அளிப்பாயாக; மறுமையிலும் நன்மையை அளிப்பாயாக; நரக வேதனையிலிருந்து எங்களைக் காப்பாயாக.", en:"Our Lord, give us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.", ref:"2:201"},
  {ar:"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! எங்கள் மீது பொறுமையைப் பொழிவாயாக; எங்கள் பாதங்களை உறுதிப்படுத்துவாயாக; இறைமறுப்பாளர்களுக்கு எதிராக எங்களுக்கு உதவுவாயாக.", en:"Our Lord, pour upon us patience, plant firmly our feet, and give us victory over the disbelieving people.", ref:"2:250"},
  {ar:"رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا", ta:"எங்கள் இறைவா! நாங்கள் மறந்தாலோ, தவறிழைத்தாலோ எங்களைத் தண்டிக்காதே.", en:"Our Lord, do not impose blame upon us if we forget or make a mistake.", ref:"2:286"},
  {ar:"رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا", ta:"எங்கள் இறைவா! எங்களுக்கு முன் வாழ்ந்தோர் மீது சுமத்தியதைப் போல் எங்கள் மீது பாரத்தைச் சுமத்தாதே.", en:"Our Lord, do not place upon us a burden like that which You placed upon those before us.", ref:"2:286"},
  {ar:"رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! எங்களால் தாங்க முடியாததை எங்கள் மீது சுமத்தாதே; எங்களை மன்னித்து, மன்னிப்பு அளித்து, கருணை காட்டுவாயாக. நீயே எங்கள் பாதுகாவலன்; இறைமறுப்பாளர்களுக்கு எதிராக உதவுவாயாக.", en:"Our Lord, do not burden us with that which we have no ability to bear. And pardon us, forgive us, and have mercy upon us. You are our protector, so give us victory over the disbelieving people.", ref:"2:286"},
  {ar:"رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ", ta:"எங்கள் இறைவா! நீ நேர்வழி காட்டிய பின் எங்கள் உள்ளங்களை வழுவவிடாதே; உன்னிடமிருந்து கருணையை வழங்குவாயாக. நீயே வளமாக வழங்குபவன்.", en:"Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.", ref:"3:8"},
  {ar:"رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ", ta:"எங்கள் இறைவா! சந்தேகமற்ற அந்நாளில் மக்களை ஒன்று சேர்ப்பவன் நீயே. அல்லாஹ் வாக்குறுதியை மாற்றுவதில்லை.", en:"Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.", ref:"3:9"},
  {ar:"رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! நாங்கள் ஈமான் கொண்டோம்; எங்கள் பாவங்களை மன்னிப்பாயாக; நரக வேதனையிலிருந்து காப்பாயாக.", en:"Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire.", ref:"3:16"},
  {ar:"رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ", ta:"எங்கள் இறைவா! நீ இறக்கியதை நம்பினோம்; தூதரைப் பின்பற்றினோம்; எங்களை சாட்சியாளர்களுடன் எழுதுவாயாக.", en:"Our Lord, we have believed in what You revealed and have followed the messenger, so register us among the witnesses.", ref:"3:53"},
  {ar:"رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! எங்கள் பாவங்களையும், எங்கள் காரியத்தில் எங்கள் வரம்பு மீறலையும் மன்னிப்பாயாக; பாதங்களை உறுதிப்படுத்தி, இறைமறுப்பாளர்களுக்கு எதிராக உதவுவாயாக.", en:"Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.", ref:"3:147"},
  {ar:"رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! இதை வீணாகப் படைக்கவில்லை; நீ தூய்மையானவன்; நரக வேதனையிலிருந்து எங்களைக் காப்பாயாக.", en:"Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.", ref:"3:191"},
  {ar:"رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ", ta:"எங்கள் இறைவா! நரகத்தில் யாரை நுழைவித்தாலும் அவரை இழிவுபடுத்தியவனாகிறாய்; அக்கிரமக்காரர்களுக்கு உதவியாளர்கள் இல்லை.", en:"Our Lord, indeed whoever You admit to the Fire – You have disgraced him, and for the wrongdoers there are no helpers.", ref:"3:192"},
  {ar:"رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا", ta:"எங்கள் இறைவா! 'உங்கள் இறைவனை நம்புங்கள்' என்று ஈமானுக்காக அழைக்கும் அழைப்பாளரைக் கேட்டோம்; ஆகவே நம்பினோம்.", en:"Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed.", ref:"3:193"},
  {ar:"رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ", ta:"எங்கள் இறைவா! எங்கள் பாவங்களை மன்னிப்பாயாக; தீமைகளை நீக்குவாயாக; நல்லோருடன் எங்களை மரணிக்கச் செய்வாயாக.", en:"Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.", ref:"3:193"},
  {ar:"رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ", ta:"எங்கள் இறைவா! உன் தூதர்கள் மூலம் வாக்களித்ததை அளிப்பாயாக; கியாமத் நாளில் எங்களை இழிவுபடுத்தாதே. நீ வாக்குறுதியை மாற்றுவதில்லை.", en:"Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.", ref:"3:194"},
  {ar:"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ", ta:"எங்கள் இறைவா! நாங்கள் எங்களுக்குத் தாங்களே அநீதி இழைத்துக்கொண்டோம்; நீ மன்னிக்காவிட்டால், கருணை காட்டாவிட்டால் நாங்கள் நஷ்டமடைந்தோராவோம்.", en:"Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.", ref:"7:23"},
  {ar:"رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ", ta:"எங்கள் இறைவா! அக்கிரமக்காரர்களுடன் எங்களை ஆக்காதே.", en:"Our Lord, do not place us with the wrongdoing people.", ref:"7:47"},
  {ar:"رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ", ta:"எங்கள் இறைவா! எங்களுக்கும் எங்கள் சமூகத்திற்கும் இடையே உண்மையுடன் தீர்ப்பளிப்பாயாக; நீயே சிறந்த தீர்ப்பளிப்பவன்.", en:"Our Lord, decide between us and our people in truth, and You are the best of those who give decision.", ref:"7:89"},
  {ar:"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ", ta:"எங்கள் இறைவா! எங்கள் மீது பொறுமையைப் பொழிவாயாக; முஸ்லிம்களாக எங்களை மரணிக்கச் செய்வாயாக.", en:"Our Lord, pour upon us patience and let us die as Muslims [in submission to You].", ref:"7:126"},
  {ar:"رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! அக்கிரமக்காரர்களுக்கு சோதனையாக எங்களை ஆக்காதே; உன் கருணையால் இறைமறுப்பாளர்களிடமிருந்து காப்பாயாக.", en:"Our Lord, do not make us a trial for the wrongdoing people, and save us by Your mercy from the disbelieving people.", ref:"10:85-86"},
  {ar:"رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِن شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ", ta:"எங்கள் இறைவா! நாங்கள் மறைப்பதையும் வெளிப்படுத்துவதையும் நீ அறிவாய்; பூமியிலும் வானத்திலும் எதுவும் அல்லாஹ்வுக்கு மறைவாயில்லை.", en:"Our Lord, indeed You know what we conceal and what we declare, and nothing is hidden from Allah on the earth or in the heaven.", ref:"14:38"},
  {ar:"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ", ta:"என் இறைவா! என்னைத் தொழுகையை நிலைநிறுத்துபவனாக்குவாயாக; என் சந்ததியிலிருந்தும். எங்கள் இறைவா! என் துஆவை ஏற்றுக்கொள்வாயாக.", en:"My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication.", ref:"14:40"},
  {ar:"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ", ta:"எங்கள் இறைவா! கணக்கு நிறுத்தப்படும் நாளில் எனக்கும், என் பெற்றோருக்கும், இறைநம்பிக்கையாளர்களுக்கும் மன்னிப்பு அளிப்பாயாக.", en:"Our Lord, forgive me and my parents and the believers the Day the account is established.", ref:"14:41"},
  {ar:"رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا", ta:"எங்கள் இறைவா! உன்னிடமிருந்து கருணையை அளிப்பாயாக; எங்கள் காரியத்தில் நேர்வழியை அமைத்துத் தருவாயாக.", en:"Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.", ref:"18:10"},
  {ar:"رَبَّنَا إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَا أَوْ أَن يَطْغَىٰ", ta:"எங்கள் இறைவா! அவர் எங்கள் மீது வரம்பு மீறவோ, அத்துமீறவோ செய்வாரோ என அஞ்சுகிறோம்.", en:"Our Lord, indeed we fear that he will hasten [punishment] against us or that he will transgress.", ref:"20:45"},
  {ar:"رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي", ta:"என் இறைவா! என் மார்பை விரிவாக்குவாயாக; என் காரியத்தை எளிதாக்குவாயாக.", en:"My Lord, expand for me my breast [with assurance] and ease for me my task.", ref:"20:25-26"},
  {ar:"رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ", ta:"எங்கள் இறைவா! நாங்கள் நம்பினோம்; மன்னித்து கருணை காட்டுவாயாக; நீயே சிறந்த கருணையாளன்.", en:"Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.", ref:"23:109"},
  {ar:"رَبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ", ta:"என் இறைவா! மன்னித்து கருணை காட்டுவாயாக; நீயே சிறந்த கருணையாளன்.", en:"My Lord, forgive and have mercy, and You are the best of the merciful.", ref:"23:118"},
  {ar:"رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا", ta:"எங்கள் இறைவா! நரக வேதனையை எங்களிடமிருந்து விலக்குவாயாக; அதன் வேதனை நிலையானது.", en:"Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering.", ref:"25:65"},
  {ar:"رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا", ta:"எங்கள் இறைவா! எங்கள் மனைவிகள், சந்ததியினரிலிருந்து கண்களுக்குக் குளிர்ச்சியை அளிப்பாயாக; இறையச்சமுடையோருக்குத் தலைவர்களாக்குவாயாக.", en:"Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.", ref:"25:74"},
  {ar:"رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ", ta:"என் இறைவா! எனக்கு ஞானத்தை அளிப்பாயாக; நல்லோருடன் என்னைச் சேர்ப்பாயாக.", en:"My Lord, grant me authority and join me with the righteous.", ref:"26:83"},
  {ar:"رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ", ta:"எங்கள் இறைவா! நீ கருணையாலும் அறிவாலும் எல்லாவற்றையும் சூழ்ந்துள்ளாய்; மன்னிப்புக் கேட்டு உன் வழியைப் பின்பற்றியோரை மன்னிப்பாயாக; நரக வேதனையிலிருந்து அவர்களைக் காப்பாயாக.", en:"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.", ref:"40:7"},
  {ar:"رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", ta:"எங்கள் இறைவா! எங்கள் ஒளியை முழுமைப்படுத்துவாயாக; எங்களை மன்னிப்பாயாக. நீ எல்லாம் வல்லவன்.", en:"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.", ref:"66:8"},
  {ar:"رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا", ta:"எங்கள் இறைவா! எங்களையும், ஈமானில் எங்களுக்கு முந்திய சகோதரர்களையும் மன்னிப்பாயாக; இறைநம்பிக்கையாளர்களுக்கு எதிராக எங்கள் உள்ளங்களில் விரோதத்தை வைக்காதே.", en:"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed.", ref:"59:10"},
  {ar:"رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ", ta:"எங்கள் இறைவா! உன் மீதே நம்பிக்கை வைத்தோம்; உன்னிடமே திரும்பினோம்; உன்னிடமே மீளுமிடம்.", en:"Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.", ref:"60:4"},
  {ar:"رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ", ta:"எங்கள் இறைவா! இறைமறுப்பாளர்களுக்கு சோதனையாக எங்களை ஆக்காதே; எங்களை மன்னிப்பாயாக. நீயே மிகைத்தவன், ஞானமுள்ளவன்.", en:"Our Lord, do not make us a trial for those who have disbelieved, and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.", ref:"60:5"},
  {ar:"رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ", ta:"எங்கள் இறைவா! நாங்கள் நம்பினோம்; எங்களை சாட்சியாளர்களுடன் எழுதுவாயாக.", en:"Our Lord, we have believed, so register us among the witnesses.", ref:"5:83"},
  {ar:"رَبِّ زِدْنِي عِلْمًا", ta:"என் இறைவா! என் அறிவை அதிகரிப்பாயாக.", en:"My Lord, increase me in knowledge.", ref:"20:114"}
];

function renderDuaList(filter){
  const box = document.getElementById('duaList');
  if(!box) return;
  const q = (filter || '').trim().toLowerCase();
  const isEn = isEnLang();
  let list = RABBANA_DUAS;
  if(q){
    list = RABBANA_DUAS.filter(d =>
      (d.ta||'').toLowerCase().includes(q) ||
      (d.en||'').toLowerCase().includes(q) ||
      (d.ar||'').includes(q) ||
      (d.ref||'').includes(q)
    );
  }
  box.innerHTML = list.map(function(d, i){
    const num = RABBANA_DUAS.indexOf(d) + 1;
    const meaning = isEn ? (d.en || d.ta) : d.ta;
    return '<div class="dua-card">'+
      '<span class="dua-num">'+num+' / 40</span>'+
      '<div class="dua-ar">'+d.ar+'</div>'+
      '<div class="dua-ta">'+meaning+'</div>'+
      '<div class="dua-ref">📖 '+d.ref+'</div>'+
    '</div>';
  }).join('');
  if(!list.length) box.innerHTML = '<p style="text-align:center;color:var(--text-dim)">'+(isEn ? 'No results' : 'முடிவுகள் இல்லை')+'</p>';
}


/* ===== Nabi (Masnoon) Duas + Tamil ===== */
const NABI_DUAS = [
  {cat:"காலை", catEn:"Morning", ar:"أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ", ta:"நாங்கள் காலை புகுந்தோம்; ஆட்சியும் அல்லாஹ்வுக்கே. எல்லாப் புகழும் அல்லாஹ்வுக்கே. அவனைத் தவிர இறைவன் இல்லை; அவனுக்குப் பங்குதாரர் இல்லை.", en:"We have entered the morning and all dominion belongs to Allah. All praise is for Allah. There is no god but Allah alone, with no partner.", note:"காலை திக்ர்", noteEn:"Morning dhikr"},
  {cat:"காலை", catEn:"Morning", ar:"اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ", ta:"இறைவா! உன்னால் காலை புகுந்தோம்; உன்னால் மாலை புகுந்தோம்; உன்னால் வாழ்கிறோம்; உன்னால் மரணிக்கிறோம்; உன்னிடமே எழுப்பப்படுதல்.", en:"O Allah, by You we enter the morning, by You we enter the evening, by You we live, by You we die, and to You is the resurrection.", note:"", noteEn:""},
  {cat:"மாலை", catEn:"Evening", ar:"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ", ta:"நாங்கள் மாலை புகுந்தோம்; ஆட்சியும் அல்லாஹ்வுக்கே. எல்லாப் புகழும் அல்லாஹ்வுக்கே.", en:"We have entered the evening and all dominion belongs to Allah. All praise is for Allah.", note:"மாலை திக்ர்", noteEn:"Evening dhikr"},
  {cat:"மாலை", catEn:"Evening", ar:"اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ", ta:"இறைவா! உன்னால் மாலை புகுந்தோம்; உன்னால் காலை புகுந்தோம்; உன்னால் வாழ்கிறோம்; உன்னால் மரணிக்கிறோம்; உன்னிடமே மீளுமிடம்.", en:"O Allah, by You we enter the evening, by You we enter the morning, by You we live, by You we die, and to You is the return.", note:"", noteEn:""},
  {cat:"தூக்கம்", catEn:"Sleep", ar:"بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا", ta:"இறைவா! உன் பெயரால் மரணிக்கிறேன்; உன் பெயரால் வாழ்கிறேன்.", en:"O Allah, in Your name I die and in Your name I live.", note:"படுக்கும்போது", noteEn:"படுக்கும்போது"},
  {cat:"தூக்கம்", catEn:"Sleep", ar:"اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ", ta:"இறைவா! நீ உன் அடியார்களை எழுப்பும் நாளில் உன் வேதனையிலிருந்து என்னைக் காப்பாயாக.", en:"O Allah, protect me from Your punishment on the Day You resurrect Your servants.", note:"", noteEn:""},
  {cat:"எழுந்ததும்", catEn:"Waking up", ar:"الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ", ta:"எங்களை மரணிக்கச் செய்த பின் உயிர்ப்பித்த அல்லாஹ்வுக்கே புகழ்; அவனிடமே எழுப்பப்படுதல்.", en:"All praise is for Allah who gave us life after causing us to die, and to Him is the resurrection.", note:"தூக்கத்திலிருந்து", noteEn:"தூக்கத்திலிருந்து"},
  {cat:"வீடு", catEn:"Home", ar:"بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا", ta:"அல்லாஹ்வின் பெயரால் நுழைந்தோம்; அல்லாஹ்வின் பெயரால் வெளியேறினோம்; எங்கள் இறைவனாகிய அல்லாஹ்வின் மீதே நம்பிக்கை.", en:"In the name of Allah we enter, in the name of Allah we leave, and upon our Lord we place our trust.", note:"வீட்டில் நுழையும்போது", noteEn:"வீட்டில் நுழையும்போது"},
  {cat:"வீடு", catEn:"Home", ar:"اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ", ta:"இறைவா! நுழைவின் நன்மையையும் வெளியேற்றத்தின் நன்மையையும் உன்னிடம் கேட்கிறேன்.", en:"O Allah, I ask You for the goodness of entering and the goodness of leaving.", note:"", noteEn:""},
  {cat:"மஸ்ஜித்", catEn:"Masjid", ar:"اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ", ta:"இறைவா! உன் கருணையின் கதவுகளை எனக்குத் திறப்பாயாக.", en:"O Allah, open for me the doors of Your mercy.", note:"மஸ்ஜித்தில் நுழைவு", noteEn:"மஸ்ஜித்தில் நுழைவு"},
  {cat:"மஸ்ஜித்", catEn:"Masjid", ar:"اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ", ta:"இறைவா! உன் அருளை உன்னிடம் கேட்கிறேன்.", en:"O Allah, I ask You of Your favor.", note:"மஸ்ஜிதிலிருந்து வெளியேறும்போது", noteEn:"மஸ்ஜிதிலிருந்து வெளியேறும்போது"},
  {cat:"உணவு", catEn:"Food", ar:"بِسْمِ اللَّهِ", ta:"அல்லாஹ்வின் பெயரால்.", en:"In the name of Allah.", note:"உண்ணத் தொடங்கும்போது", noteEn:"உண்ணத் தொடங்கும்போது"},
  {cat:"உணவு", catEn:"Food", ar:"الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَٰذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ", ta:"இதை எனக்கு உணவளித்து, என் ஆற்றல் இல்லாமல் ரிஸ்க் அளித்த அல்லாஹ்வுக்கே புகழ்.", en:"All praise is for Allah who fed me this and provided it for me without any power or might from myself.", note:"உணவுக்குப் பின்", noteEn:"உணவுக்குப் பின்"},
  {cat:"பயணம்", catEn:"Travel", ar:"سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ", ta:"இதை எங்களுக்கு வசப்படுத்தினவன் தூய்மையானவன்; நாங்கள் இதற்கு சக்தியற்றவர்கள்; எங்கள் இறைவனிடமே திரும்புவோம்.", en:"Glory be to Him who has subjected this to us, and we could not have done it by ourselves.", note:"வாகனம் ஏறும்போது", noteEn:"வாகனம் ஏறும்போது"},
  {cat:"பயணம்", catEn:"Travel", ar:"اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَٰذَا وَاطْوِ عَنَّا بُعْدَهُ", ta:"இறைவா! இந்தப் பயணத்தை எங்களுக்கு எளிதாக்குவாயாக; அதன் தூரத்தைச் சுருக்குவாயாக.", en:"O Allah, make this journey easy for us and shorten its distance for us.", note:"", noteEn:""},
  {cat:"கழிப்பறை", catEn:"Restroom", ar:"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ", ta:"இறைவா! அசுத்தமான ஆண்கள், பெண்கள் (ஷைத்தான்கள்) இடமிருந்து உன்னிடம் பாதுகாப்புத் தேடுகிறேன்.", en:"O Allah, I seek refuge in You from the male and female unclean ones (devils).", note:"நுழைவு", noteEn:"நுழைவு"},
  {cat:"கழிப்பறை", catEn:"Restroom", ar:"غُفْرَانَكَ", ta:"உன் மன்னிப்பை வேண்டுகிறேன்.", en:"I seek Your forgiveness.", note:"வெளியேறும்போது", noteEn:"வெளியேறும்போது"},
  {cat:"உடை", catEn:"Clothing", ar:"الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَٰذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ", ta:"இந்த ஆடையை அணிவித்து ரிஸ்க் அளித்த அல்லாஹ்வுக்கே புகழ்.", en:"All praise is for Allah who clothed me with this and provided it for me without any power or might from myself.", note:"புதிய ஆடை", noteEn:"புதிய ஆடை"},
  {cat:"கண்ணாடி", catEn:"Mirror", ar:"اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي", ta:"இறைவா! என் உருவை அழகாக்கியது போல் என் ஒழுக்கத்தையும் அழகாக்குவாயாக.", en:"O Allah, as You have made my appearance beautiful, make my character beautiful.", note:"", noteEn:""},
  {cat:"கேள்வி/தேவை", catEn:"Need", ar:"اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى", ta:"இறைவா! நேர்வழி, இறையச்சம், தூய்மை, தேவையற்ற செல்வம் ஆகியவற்றைக் கேட்கிறேன்.", en:"O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.", note:"", noteEn:""},
  {cat:"மன்னிப்பு", catEn:"Forgiveness", ar:"اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ", ta:"இறைவா! நீயே என் இறைவன்; உன்னைத் தவிர இறைவன் இல்லை. என்னைப் படைத்தாய்; நான் உன் அடியான். உன் உடன்படிக்கையின் மீது என் சக்திக்கு ஏற்ப இருக்கிறேன். நான் செய்த தீமையிலிருந்து பாதுகாப்புத் தேடுகிறேன். உன் அருளை ஒப்புக்கொள்கிறேன்; என் பாவத்தை ஒப்புக்கொள்கிறேன். மன்னிப்பாயாக — உன்னைத் தவிர பாவங்களை மன்னிப்பவர் இல்லை.", en:"O Allah, You are my Lord; there is no god but You. You created me and I am Your servant...", note:"செய்ய்டுல் இஸ்திஃபார்", noteEn:"செய்ய்டுல் இஸ்திஃபார்"},
  {cat:"மன்னிப்பு", catEn:"Forgiveness", ar:"رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ", ta:"என் இறைவா! என்னை மன்னித்து, மன்னிப்புத் திருப்புவாயாக. நீயே மன்னிப்பவன், நிகரற்ற அன்புடையோன்.", en:"My Lord, forgive me, have mercy on me, and accept my repentance.", note:"", noteEn:""},
  {cat:"கவலை", catEn:"Worry", ar:"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ", ta:"இறைவா! கவலை, துக்கம், இயலாமை, சோம்பல், பயம், உலோபித்தனம், கடன் அதிகம், மனிதர்களின் அடக்குமுறை ஆகியவற்றிலிருந்து பாதுகாப்புத் தேடுகிறேன்.", en:"O Allah, I seek refuge in You from worry, grief, incapacity, laziness, cowardice, miserliness, the burden of debt, and being overpowered by men.", note:"", noteEn:""},
  {cat:"கவலை", catEn:"Worry", ar:"حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ", ta:"அல்லாஹ்வே எனக்குப் போதுமானவன்; அவனைத் தவிர இறைவன் இல்லை; அவன் மீதே நம்பிக்கை; அவனே மகத்தான அர்ஷின் இறைவன்.", en:"Allah is sufficient for me; there is no god but Him. In Him I put my trust, and He is the Lord of the Mighty Throne.", note:"7 முறை", noteEn:"7 முறை"},
  {cat:"நோய்", catEn:"Illness", ar:"اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، اشْفِ أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا", ta:"இறைவா! மனிதர்களின் இறைவா! துன்பத்தை நீக்குவாயாக; குணப்படுத்துவாயாக — நீயே குணப்படுத்துபவன். உன் குணப்படுத்துதலையன்றி குணமில்லை; நோயை விடாத குணம்.", en:"O Allah, Lord of mankind, remove the harm and heal, for You are the Healer. There is no healing but Your healing — a healing that leaves no illness behind.", note:"ருக்யா", noteEn:"ருக்யா"},
  {cat:"நோய்", catEn:"Illness", ar:"أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ", ta:"மகத்தான அல்லாஹ்விடம் — மகத்தான அர்ஷின் இறைவனிடம் — உன்னைக் குணப்படுத்தும்படி கேட்கிறேன்.", en:"I ask Allah the Magnificent, Lord of the Magnificent Throne, to cure you.", note:"7 முறை", noteEn:"7 முறை"},
  {cat:"குடும்பம்", catEn:"Family", ar:"رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ", ta:"என் இறைவா! நீ எனக்கு இறக்கும் நன்மையை நான் தேவைப்படுபவன்.", en:"My Lord, grant me from Yourself good offspring. Indeed, You are the Hearer of supplication.", note:"மூசா (அலை)", noteEn:"மூசா (அலை)"},
  {cat:"குடும்பம்", catEn:"Family", ar:"رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ", ta:"எங்கள் இறைவா! மனைவிகள், சந்ததியினரிலிருந்து கண்களுக்குக் குளிர்ச்சியை அளிப்பாயாக.", en:"Our Lord, grant us from our spouses and offspring comfort to our eyes, and make us an example for the righteous.", note:"", noteEn:""},
  {cat:"இஸ்திகாரா", catEn:"Istikhara", ar:"اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ", ta:"இறைவா! உன் அறிவால் நன்மையைத் தேடுகிறேன்; உன் ஆற்றலால் சக்தி கேட்கிறேன்; உன் மகத்தான அருளைக் கேட்கிறேன்.", en:"O Allah, I seek the best through Your knowledge, and I seek ability through Your power, and I ask You of Your great bounty...", note:"இஸ்திகாரா (சுருக்கம்)", noteEn:"இஸ்திகாரா (சுருக்கம்)"},
  {cat:"தொழுகை", catEn:"Prayer", ar:"سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَىٰ جَدُّكَ وَلَا إِلَٰهَ غَيْرُكَ", ta:"இறைவா! நீ தூய்மையானவன்; உன்னைப் புகழ்கிறேன்; உன் பெயர் பாக்கியமுள்ளது; உன் மகத்துவம் உயர்ந்தது; உன்னைத் தவிர இறைவன் இல்லை.", en:"O Allah, You are free from all imperfections, and all praise is for You.", note:"ஸனா", noteEn:"ஸனா"},
  {cat:"தொழுகை", catEn:"Prayer", ar:"اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ", ta:"இறைவா! கிழக்கு மேற்கு இடையே விலக்கியது போல் எனக்கும் என் பாவங்களுக்கும் இடையே விலக்குவாயாக.", en:"O Allah, distance me from my sins as You have distanced the East from the West.", note:"இஃதிதாஹ்", noteEn:"இஃதிதாஹ்"},
  {cat:"தொழுகை", catEn:"Prayer", ar:"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! இவ்வுலகிலும் மறுமையிலும் நன்மை அளித்து நரகத்திலிருந்து காப்பாயாக.", en:"Our Lord, give us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.", note:"ருகூஉ / துஆ", noteEn:"ருகூஉ / துஆ"},
  {cat:"பாதுகாப்பு", catEn:"Protection", ar:"بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ", ta:"அல்லாஹ்வின் பெயரால் — அவன் பெயருடன் பூமியிலும் வானத்திலும் எதுவும் தீங்கு செய்யாது. அவன் செவியுறுபவன், அறிந்தவன்.", en:"In the name of Allah, with whose name nothing on earth or in heaven can cause harm, and He is the All-Hearing, All-Knowing.", note:"காலை மாலை 3 முறை", noteEn:"காலை மாலை 3 முறை"},
  {cat:"பாதுகாப்பு", catEn:"Protection", ar:"أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ", ta:"அல்லாஹ் படைத்தவற்றின் தீமையிலிருந்து அவனது முழுமையான வார்த்தைகளால் பாதுகாப்புத் தேடுகிறேன்.", en:"I seek refuge in the perfect words of Allah from the evil of what He has created.", note:"", noteEn:""},
  {cat:"பாதுகாப்பு", catEn:"Protection", ar:"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ", ta:"விடியலின் இறைவனிடம் பாதுகாப்புத் தேடுகிறேன். (அல்-ஃபலக்)", en:"I seek refuge with the Lord of the daybreak...", note:"முஅவ்விதத்", noteEn:"முஅவ்விதத்"},
  {cat:"பாதுகாப்பு", catEn:"Protection", ar:"قُلْ أَعُوذُ بِرَبِّ النَّاسِ", ta:"மனிதர்களின் இறைவனிடம் பாதுகாப்புத் தேடுகிறேன். (அன்-நாஸ்)", en:"I seek refuge with the Lord of mankind...", note:"முஅவ்விதத்", noteEn:"முஅவ்விதத்"}
];

let nabiDuaCat = 'எல்லாம்';

function renderNabiDuaList(){
  const box = document.getElementById('nabiDuaList');
  if(!box) return;
  const isEn = isEnLang();
  const q = ((document.getElementById('nabiDuaSearch')||{}).value || '').trim().toLowerCase();
  let list = NABI_DUAS.filter(function(d){
    if(nabiDuaCat !== 'எல்லாம்' && nabiDuaCat !== 'All' && d.cat !== nabiDuaCat && d.catEn !== nabiDuaCat) return false;
    if(!q) return true;
    return (d.ta||'').toLowerCase().includes(q) || (d.en||'').toLowerCase().includes(q) || (d.ar||'').includes(q) || (d.cat||'').includes(q) || (d.catEn||'').toLowerCase().includes(q) || (d.note||'').toLowerCase().includes(q);
  });
  box.innerHTML = list.map(function(d, i){
    var catLabel = isEn ? (d.catEn || d.cat) : d.cat;
    var noteLabel = isEn ? (d.noteEn || d.note) : d.note;
    var meaning = isEn ? (d.en || d.ta) : d.ta;
    return '<div class="dua-card">'+
      '<span class="dua-num">'+catLabel+(noteLabel ? ' · '+noteLabel : '')+'</span>'+
      '<div class="dua-ar">'+d.ar+'</div>'+
      '<div class="dua-ta">'+meaning+'</div>'+
    '</div>';
  }).join('');
  if(!list.length) box.innerHTML = '<p style="text-align:center;color:var(--text-dim)">'+(isEn?'No results':'முடிவுகள் இல்லை')+'</p>';
}





/* ===== Ayah Finder v4 — Follow-along mode ===== */
const AyahFinder = {
  rec: null,
  listening: false,
  mode: 'follow', // follow | search
  lastMatch: null,
  _pool: null,
  _flat: null, // ordered list for follow
  _idx: -1,    // current index in _flat
  _finalChunks: [],
  _stopTimer: null,
  _lastSpeechAt: 0,

  normalizeAr: function(s){
    if(!s) return '';
    var t = String(s);
    t = t.replace(/[\u0640\u064B-\u065F\u0670\u06D6-\u06ED\u06DF-\u06E8\u06EA-\u06ED]/g, '');
    t = t.replace(/[آأإٱٲٳ]/g, 'ا');
    t = t.replace(/[ىئ]/g, 'ي');
    t = t.replace(/ة/g, 'ه');
    t = t.replace(/ؤ/g, 'و');
    t = t.replace(/[^\u0600-\u06FF\s]/g, ' ');
    return t.replace(/\s+/g, ' ').trim();
  },

  orderedCoverage: function(qw, aw){
    if(!qw.length || !aw.length) return 0;
    var qi = 0, hits = 0;
    for(var ai=0; ai<aw.length && qi<qw.length; ai++){
      if(aw[ai] === qw[qi]){ hits++; qi++; }
    }
    return hits / qw.length;
  },

  scorePair: function(queryNorm, ayahNorm){
    if(!queryNorm || !ayahNorm) return 0;
    if(queryNorm === ayahNorm) return 1;
    var qw = queryNorm.split(' ').filter(function(w){ return w.length>=2; });
    var aw = ayahNorm.split(' ').filter(function(w){ return w.length>=2; });
    if(qw.length < 1) return 0;
    if(ayahNorm.indexOf(queryNorm) !== -1) return 0.9;
    if(queryNorm.indexOf(ayahNorm) !== -1 && ayahNorm.length > 8) return 0.75;
    var ord = this.orderedCoverage(qw, aw);
    // opening words
    var open = 0, n = Math.min(3, qw.length, aw.length);
    for(var i=0;i<n;i++){ if(qw[i]===aw[i]) open++; else break; }
    open = n ? open/n : 0;
    var s = ord * 0.65 + open * 0.35;
    if(ord < 0.35 && open < 0.6) return 0;
    return Math.min(1, s);
  },

  buildFlat: function(){
    var list = [];
    var ids = Object.keys(QURAN_DATA||{});
    // sort by surah number
    ids.sort(function(a,b){
      return (QURAN_DATA[a].surahNum||0) - (QURAN_DATA[b].surahNum||0);
    });
    // juz filter
    var allow = null;
    if(typeof selectedJuz==='number' && selectedJuz>0 && typeof getSurahNumsForJuz==='function'){
      var nums = getSurahNumsForJuz(selectedJuz)||[];
      allow = {};
      nums.forEach(function(n){ allow[n]=1; });
    }
    ids.forEach(function(id){
      var s = QURAN_DATA[id];
      if(!s||!s.ayat) return;
      if(allow && !allow[s.surahNum]) return;
      s.ayat.forEach(function(a,i){
        if(!a||!a.ar) return;
        var norm = AyahFinder.normalizeAr(a.ar);
        if(norm.length<4) return;
        list.push({
          id:id, surahNum:s.surahNum||0, nameTa:s.nameTa||'', nameAr:s.nameAr||'',
          ayahNum:i+1, ar:a.ar, ta:a.ta||'', norm:norm,
          words: norm.split(' ').filter(function(w){ return w.length>=2; })
        });
      });
    });
    this._flat = list;
    return list;
  },

  collectAyat: function(){ return this.buildFlat(); },

  findMatches: function(queries){
    if(typeof queries==='string') queries=[queries];
    var norms=[];
    (queries||[]).forEach(function(q){
      var n=AyahFinder.normalizeAr(q);
      if(n.length>=4 && norms.indexOf(n)===-1) norms.push(n);
    });
    if(!norms.length) return [];
    var pool = this.buildFlat();
    var best={};
    pool.forEach(function(item){
      var maxSc=0;
      norms.forEach(function(n){
        var sc=AyahFinder.scorePair(n, item.norm);
        if(sc>maxSc) maxSc=sc;
      });
      if(maxSc>=0.5){
        var k=item.id+':'+item.ayahNum;
        if(!best[k]||best[k].score<maxSc) best[k]={item:item,score:maxSc};
      }
    });
    return Object.keys(best).map(function(k){return best[k];})
      .sort(function(a,b){return b.score-a.score;}).slice(0,5);
  },

  showResult: function(matches, source){
    var box=document.getElementById('finderResult');
    if(!box) return;
    if(!matches||!matches.length){
      box.classList.remove('show');
      this.lastMatch=null;
      return;
    }
    var top=matches[0];
    this.lastMatch=top.item;
    box.classList.add('show');
    document.getElementById('finderResTitle').textContent='✅ '+Math.round(top.score*100)+'%';
    document.getElementById('finderResMeta').textContent=
      (top.item.nameTa||'')+' · ஆயத்து '+top.item.ayahNum+' · சூரா '+(top.item.surahNum||'');
    document.getElementById('finderResAr').textContent=top.item.ar;
    var alts=document.getElementById('finderAlts');
    if(alts){
      alts.innerHTML='';
      matches.slice(1).forEach(function(m){
        var d=document.createElement('div');
        d.className='finder-alt-item';
        d.textContent=(m.item.nameTa||'')+' · ஆயத்து '+m.item.ayahNum+' ('+Math.round(m.score*100)+'%)';
        d.onclick=function(){
          AyahFinder.lastMatch=m.item;
          document.getElementById('finderResMeta').textContent=
            (m.item.nameTa||'')+' · ஆயத்து '+m.item.ayahNum;
          document.getElementById('finderResAr').textContent=m.item.ar;
        };
        alts.appendChild(d);
      });
    }
  },

  searchText: function(){
    var el=document.getElementById('finderTextInput');
    var text=(el&&el.value)||'';
    if(!text.trim()) return;
    this.showResult(this.findMatches([text]), 'text');
    document.getElementById('finderStatus').textContent = this.lastMatch ? 'கண்டுபிடிக்கப்பட்டது' : 'பொருத்தம் இல்லை';
  },

  showLive: function(item, idx){
    var card=document.getElementById('finderLiveCard');
    if(!card||!item) return;
    card.style.display='block';
    document.getElementById('finderLiveMeta').textContent =
      (item.nameTa||item.nameAr||'') + ' · ஆயத்து ' + item.ayahNum +
      (item.surahNum ? ' · சூரா ' + item.surahNum : '');
    document.getElementById('finderLiveAr').textContent = item.ar;
    var total = (this._flat||[]).length;
    document.getElementById('finderLiveProgress').textContent =
      'முன்னேற்றம்: ' + (idx+1) + ' / ' + total + (this.listening ? ' · 🔴 கேட்கிறது…' : '');
    this.lastMatch = item;
  },

  // Core: given recent speech, advance follow position
  trackSpeech: function(rawText){
    var flat = this._flat || this.buildFlat();
    if(!flat.length) return;
    var norm = this.normalizeAr(rawText);
    if(norm.length < 3) return;

    // Window: current, next few, and nearby previous
    var start = Math.max(0, this._idx < 0 ? 0 : this._idx);
    // On first lock, search broader
    var windowItems = [];
    if(this._idx < 0){
      // search first 80 or all if small — then whole if needed
      windowItems = flat.slice(0, Math.min(flat.length, 120));
      if(flat.length > 120) windowItems = flat; // full search once
    } else {
      for(var i = Math.max(0, this._idx - 1); i < Math.min(flat.length, this._idx + 5); i++){
        windowItems.push({item: flat[i], idx: i});
      }
    }

    var bestSc = 0, bestIdx = -1, bestItem = null;
    var list = this._idx < 0 ? windowItems.map(function(it,i){ return {item:it, idx: flat.indexOf(it)}; }) : windowItems;

    // fix list format when _idx < 0
    if(this._idx < 0){
      list = windowItems.map(function(it){
        return {item: it, idx: flat.indexOf(it)};
      });
    }

    for(var j=0;j<list.length;j++){
      var it = list[j].item;
      var idx = list[j].idx;
      if(idx < 0) continue;
      var sc = this.scorePair(norm, it.norm);
      // bias toward next ayah when following
      if(this._idx >= 0 && idx === this._idx + 1) sc *= 1.15;
      if(this._idx >= 0 && idx === this._idx) sc *= 1.1;
      if(sc > bestSc){ bestSc = sc; bestIdx = idx; bestItem = it; }
    }

    // First lock needs higher confidence
    var need = this._idx < 0 ? 0.52 : 0.42;
    if(bestItem && bestSc >= need){
      // Advance only same or forward (allow 1 back for correction)
      if(this._idx < 0 || bestIdx >= this._idx - 1){
        this._idx = bestIdx;
        this.showLive(bestItem, bestIdx);
        document.getElementById('finderStatus').textContent =
          '📖 ஆயத்து ' + bestItem.ayahNum + ' · தொடர்ந்து ஓதுங்கள்…';
      }
    }
  },

  stop: function(){
    this.listening = false;
    if(this._stopTimer){ clearTimeout(this._stopTimer); this._stopTimer=null; }
    try{ if(this.rec) this.rec.stop(); }catch(e){}
    var btn = document.getElementById('finderMicBtn');
    if(btn){ btn.classList.remove('listening'); btn.textContent = '🎤'; }
    var prog = document.getElementById('finderLiveProgress');
    if(prog && this._idx >= 0){
      prog.textContent = (prog.textContent||'').replace(/ · 🔴.*/,'') + ' · ⏹ நின்றது';
    }
  },

  start: function(){
    var SR = window.SpeechRecognition || window.webkitSpeechRecognition;
    if(!SR){
      document.getElementById('finderStatus').textContent = _('msg_chrome_needed');
      return;
    }
    if(this.listening){ this.stop(); document.getElementById('finderStatus').textContent=_('msg_stopped'); return; }

    this.buildFlat();
    if(!this._flat.length){
      document.getElementById('finderStatus').textContent = _('msg_no_surah_data');
      return;
    }

    // optional start surah
    var sel = document.getElementById('finderStartSurah');
    this._idx = -1;
    if(sel && sel.value){
      var sn = parseInt(sel.value, 10);
      for(var i=0;i<this._flat.length;i++){
        if(this._flat[i].surahNum === sn){ this._idx = i; break; }
      }
      if(this._idx >= 0) this.showLive(this._flat[this._idx], this._idx);
    }

    var self = this;
    this.rec = new SR();
    this.rec.lang = 'ar-SA';
    this.rec.continuous = true;
    this.rec.interimResults = true;
    this.rec.maxAlternatives = 3;

    this.listening = true;
    this._finalChunks = [];
    this._lastSpeechAt = Date.now();

    var btn = document.getElementById('finderMicBtn');
    if(btn){ btn.classList.add('listening'); btn.textContent = '⏹'; }
    document.getElementById('finderStatus').textContent = _('msg_listening');
    document.getElementById('finderHeard').textContent = '';

    function armSilenceStop(){
      if(self._stopTimer) clearTimeout(self._stopTimer);
      self._stopTimer = setTimeout(function(){
        if(!self.listening) return;
        // 2.8s silence → stop (like the app you used)
        if(Date.now() - self._lastSpeechAt >= 2700){
          self.stop();
          document.getElementById('finderStatus').textContent =
            _('msg_paused_silence');
        }
      }, 2800);
    }

    this.rec.onresult = function(ev){
      self._lastSpeechAt = Date.now();
      armSilenceStop();
      var interim = '', finals = [];
      for(var i=0;i<ev.results.length;i++){
        var r = ev.results[i];
        if(r.isFinal){
          finals.push(r[0].transcript);
          for(var a=1;a<Math.min(r.length,3);a++) finals.push(r[a].transcript);
        } else if(r[0]) interim += r[0].transcript;
      }
      var recent = (finals.slice(-3).join(' ') + ' ' + interim).trim();
      document.getElementById('finderHeard').textContent = recent;
      // Live track on interim + final
      if(recent.length >= 4) self.trackSpeech(recent);
      if(finals.length){
        var joined = finals.slice(-2).join(' ');
        if(joined.length >= 4) self.trackSpeech(joined);
      }
    };

    this.rec.onerror = function(ev){
      if(ev.error==='no-speech'){ armSilenceStop(); return; }
      if(ev.error==='aborted') return;
      self.stop();
      var msg = 'பிழை — மீண்டும் முயலுங்கள்';
      if(ev.error==='not-allowed') msg='Mic அனுமதி தேவை';
      if(ev.error==='network') msg='Internet தேவை';
      document.getElementById('finderStatus').textContent = msg;
    };

    this.rec.onend = function(){
      // Auto-restart while user still listening (Chrome drops continuous often)
      if(self.listening){
        try { self.rec.start(); } catch(e){
          self.stop();
          document.getElementById('finderStatus').textContent = _('msg_conn_ended');
        }
      }
    };

    try { this.rec.start(); armSilenceStop(); }
    catch(e){
      this.stop();
      document.getElementById('finderStatus').textContent = _('msg_not_started');
    }
  }
};

function initFinder(){
  // Mode toggle
  var fBtn = document.getElementById('finderModeFollow');
  var sBtn = document.getElementById('finderModeSearch');
  function setMode(m){
    AyahFinder.mode = m;
    if(fBtn) fBtn.classList.toggle('active', m==='follow');
    if(sBtn) sBtn.classList.toggle('active', m==='search');
    var fb = document.getElementById('finderFollowBox');
    var sb = document.getElementById('finderSearchBox');
    if(fb) fb.style.display = m==='follow' ? 'block' : 'none';
    if(sb) sb.style.display = m==='search' ? 'block' : 'none';
    if(AyahFinder.listening) AyahFinder.stop();
  }
  if(fBtn && !fBtn._bound){ fBtn._bound=true; fBtn.onclick=function(){ setMode('follow'); }; }
  if(sBtn && !sBtn._bound){ sBtn._bound=true; sBtn.onclick=function(){ setMode('search'); }; }

  // Surah dropdown
  var sel = document.getElementById('finderStartSurah');
  if(sel){
    var opts = '<option value="">— தானே கண்டுபிடி (எல்லாம்) —</option>';
    var seen = {};
    Object.keys(QURAN_DATA||{}).forEach(function(id){
      var s = QURAN_DATA[id];
      if(!s||!s.surahNum||seen[s.surahNum]) return;
      seen[s.surahNum]=1;
    });
    Object.keys(seen).map(Number).sort(function(a,b){return a-b;}).forEach(function(n){
      var id = (typeof surahIdForNum==='function') ? surahIdForNum(n) : ('s'+n);
      var s = QURAN_DATA[id];
      var label = (s && s.nameTa) ? s.nameTa : ('சூரா '+n);
      opts += '<option value="'+n+'">'+label+'</option>';
    });
    sel.innerHTML = opts;
  }

  var btn = document.getElementById('finderMicBtn');
  if(btn && !btn._bound){
    btn._bound = true;
    btn.onclick = function(){ AyahFinder.start(); };
  }
  var openBtn = document.getElementById('finderOpenBtn');
  if(openBtn && !openBtn._bound){
    openBtn._bound = true;
    openBtn.onclick = function(){
      var m = AyahFinder.lastMatch;
      if(!m) return;
      if(typeof openGarden==='function') openGarden(m.id);
      else if(typeof openGardenByNum==='function' && m.surahNum) openGardenByNum(m.surahNum);
    };
  }
  var tBtn = document.getElementById('finderTextSearchBtn');
  if(tBtn && !tBtn._bound){
    tBtn._bound = true;
    tBtn.onclick = function(){ AyahFinder.searchText(); };
  }

  setMode('follow');
  document.getElementById('finderStatus').textContent =
    _('msg_press_mic');
}








function initNabiDua(){
  const cats = ['எல்லாம்'];
  NABI_DUAS.forEach(function(d){ if(cats.indexOf(d.cat)===-1) cats.push(d.cat); });
  const catBox = document.getElementById('nabiDuaCats');
  if(catBox){
    var isEn = isEnLang();
    catBox.innerHTML = cats.map(function(c){
      var label = c;
      if(isEn){
        var found = NABI_DUAS.find(function(d){ return d.cat===c; });
        label = (found && found.catEn) ? found.catEn : c;
        if(c==='எல்லாம்') label = 'All';
      }
      var active = (c===nabiDuaCat || (isEn && nabiDuaCat==='All' && c==='எல்லாம்'));
      return '<button type="button" class="nabi-cat'+(c===nabiDuaCat?' active':'')+'" data-cat="'+c+'">'+label+'</button>';
    }).join('');
    catBox.querySelectorAll('.nabi-cat').forEach(function(btn){
      btn.onclick = function(){
        nabiDuaCat = btn.getAttribute('data-cat');
        catBox.querySelectorAll('.nabi-cat').forEach(function(b){ b.classList.toggle('active', b===btn); });
        renderNabiDuaList();
      };
    });
  }
  const s = document.getElementById('nabiDuaSearch');
  if(s && !s._bound){
    s._bound = true;
    s.oninput = function(){ renderNabiDuaList(); };
  }
  renderNabiDuaList();
}


function initDua(){
  renderDuaList('');
  const s = document.getElementById('duaSearch');
  if(s && !s._bound){
    s._bound = true;
    s.oninput = function(){ renderDuaList(s.value); };
  }
}


function initDhikr(){
  if(dhikrMode !== 'salah'){
    dhikrMode = 'free';
    if(!dhikrCurrent) dhikrCurrent = DHIKR_LIST[0];
  }
  renderDhikrList();
  updateSalahDhikrUI();

  const plus = document.getElementById('dhikrPlus');
  const minus = document.getElementById('dhikrMinus');
  const reset = document.getElementById('dhikrReset');
  const salahBtn = document.getElementById('dhikrSalahMode');
  const tapArea = document.getElementById('dhikrTapArea');

  if(plus) plus.onclick = (e)=>{ e.stopPropagation(); dhikrInc(1, e); };
  if(minus) minus.onclick = (e)=>{ e.stopPropagation(); dhikrInc(-1); };
  if(reset) reset.onclick = (e)=>{
    e.stopPropagation();
    dhikrCount = 0;
    if(dhikrMode==='salah') dhikrStep = 0;
    updateSalahDhikrUI();
  };
  if(salahBtn) salahBtn.onclick = (e)=>{
    e.stopPropagation();
    dhikrMode = 'salah';
    dhikrStep = 0;
    dhikrCount = 0;
    renderDhikrList();
    updateSalahDhikrUI();
  };
  if(tapArea){
    tapArea.onclick = function(e){
      if(e.target.closest('button')) return;
      dhikrInc(1, e);
    };
  }
  const soundBtn = document.getElementById('dhikrSoundBtn');
  if(soundBtn){
    soundBtn.textContent = DhikrSFX.enabled ? '🔊 ஒலி' : '🔇 ஒலி';
    soundBtn.onclick = function(e){
      e.stopPropagation();
      DhikrSFX.enabled = !DhikrSFX.enabled;
      soundBtn.textContent = DhikrSFX.enabled ? '🔊 ஒலி' : '🔇 ஒலி';
      if(DhikrSFX.enabled) try{ DhikrSFX.click(); }catch(err){}
    };
  }
}

document.querySelectorAll('.side-nav-item[data-screen]').forEach(btn=>{
  btn.onclick = function(){
    try{ if(typeof AudioFX!=='undefined'&&AudioFX.playNav) AudioFX.playNav(); }catch(e){}
    document.querySelectorAll('.side-nav-item').forEach(b=>b.classList.remove('active'));
    btn.classList.add('active');
    closeSideMenu();
    if(btn.dataset.screen==='screenSelect') renderPlotsGrid();
    switchScreen(btn.dataset.screen);
  };
});
var __sideAdmin = document.getElementById('sideAdminBtn');
if(__sideAdmin) __sideAdmin.onclick = function(){
  try{ if(typeof AudioFX!=='undefined'&&AudioFX.playNav) AudioFX.playNav(); }catch(e){}
  closeSideMenu();
  document.getElementById('adminOverlay').classList.add('active');
};
var __sideSound = document.getElementById('sideSoundBtn');
if(__sideSound) __sideSound.onclick = function(){
  meta.sound = !meta.sound; AudioFX.enabled = meta.sound; saveMeta(); updateHeader();
  try{ if(AudioFX.enabled && AudioFX.playToggle) AudioFX.playToggle(); }catch(e){}
};
/* Export removed from Settings UI */
(function(){
  var sideExp = document.getElementById('sideExportBtn2');
  var expBtn = document.getElementById('exportBtn');
  if(sideExp && expBtn){
    sideExp.onclick = function(){ closeSideMenu(); expBtn.click(); };
  }
})();
var __soundBtn = document.getElementById('soundBtn');
if(__soundBtn) __soundBtn.onclick = function(){
  meta.sound = !meta.sound; AudioFX.enabled = meta.sound; saveMeta(); updateHeader();
};
var __ssi = document.getElementById('surahSearchInput'); if(__ssi) __ssi.oninput = renderPlotsGrid;
var __backBtn = document.getElementById('backBtn');
if(__backBtn) __backBtn.onclick = function(){ stopContinuous(); renderPlotsGrid(); switchScreen('screenSelect'); };
var __juzBack = document.getElementById('juzBackBtn');
if(__juzBack) __juzBack.onclick = function(){
  stopContinuous();
  if(currentJuzView !== null){
    showJuzNumberGrid();
    document.getElementById('juzBackBtn').textContent = '⬅ தோட்டம்';
  } else {
    renderPlotsGrid();
    switchScreen('screenSelect');
  }
};
var __resetBtn = document.getElementById('resetBtn');
if(__resetBtn) __resetBtn.onclick = function(){
  if(!confirm(_('msg_confirm_reset'))) return;
  state.gardens[currentSurah].planted.fill(false); saveGame(); renderTree(); renderDots(); try{ renderLevelPath(); }catch(e){}
};
var __playAll = document.getElementById('playSurahAllBtn') || document.getElementById('playAllBtn');
if(__playAll) __playAll.onclick = function(){
  if(!currentSurah) return;
  if(contPlaying && contQueue.length && contQueue[0] && contQueue[0].id===currentSurah){
    stopContinuous();
    this.innerHTML='<img src="icons/sound.png" alt="" class="header-sound-icon" style="opacity:'+(meta.sound!==false?'1':'0.35')+'">';
    return;
  }
  stopContinuous();
  contQueue = buildSurahQueue(currentSurah);
  contIndex = 0;
  if(!contQueue.length){ alert(_('msg_no_audio_surah')); return; }
  playContinuousAt(0);
};
var __jp=document.getElementById('juzPlayBtn'); if(__jp) __jp.onclick = toggleContinuousPlay;
var __juzStopBtn = document.getElementById('juzStopBtn'); if(__juzStopBtn) __juzStopBtn.onclick = function(){ stopContinuous(); updateJuzUI(); };
var __jprev=document.getElementById('juzPrevBtn'); if(__jprev) __jprev.onclick = function(){
  if(contIndex>0) playContinuousAt(contIndex-1);
};
var __jnext=document.getElementById('juzNextBtn'); if(__jnext) __jnext.onclick = function(){
  if(contIndex < contQueue.length-1) playContinuousAt(contIndex+1);
};
document.querySelectorAll('.mode-btn').forEach(btn=>{
  btn.onclick = function(){
    document.querySelectorAll('.mode-btn').forEach(b=>b.classList.remove('active'));
    btn.classList.add('active');
    quizMode = btn.dataset.mode;
  };
});
var __qc=document.getElementById('quizCancel'); if(__qc) __qc.onclick = function(){
  document.getElementById('quizOverlay').classList.remove('active');
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
};
var __ca=document.getElementById('closeAdminBtn'); if(__ca) __ca.onclick = function(){
  document.getElementById('adminOverlay').classList.remove('active');
};
(function(){
  function bindCopy(btnId, num){
    var copyBtn = document.getElementById(btnId);
    if(!copyBtn) return;
    copyBtn.onclick = function(){
      if(navigator.clipboard && navigator.clipboard.writeText){
        navigator.clipboard.writeText(num).then(function(){
          copyBtn.textContent = _('msg_copied_short');
          setTimeout(function(){ copyBtn.textContent = '📋 Number Copy'; }, 1600);
        }).catch(function(){ prompt(_('msg_copy_num'), num); });
      } else {
        prompt(_('msg_copy_num'), num);
      }
    };
  }
  bindCopy('adminWaCopyBtn', '8428141919');
  bindCopy('adminBugCopyBtn', '7092427154');
})();
function renderAdmin(){ /* legacy no-op — admin is now WhatsApp contact */ }
/* Export / Import removed from Settings — handlers kept optional for future/dev */
(function(){
  var exportBtn = document.getElementById('exportBtn');
  if(exportBtn){
    exportBtn.onclick = function(){
      const blob = new Blob([JSON.stringify({quran:QURAN_DATA, state, meta}, null, 2)], {type:'application/json'});
      const a = document.createElement('a'); a.href = URL.createObjectURL(blob); a.download = 'quran-backup.json'; a.click();
    };
  }
  var importBtn = document.getElementById('importBtn');
  var importFile = document.getElementById('importFile');
  if(importBtn && importFile){
    importBtn.onclick = function(){ importFile.click(); };
    importFile.onchange = function(e){
      const f = e.target.files[0]; if(!f) return;
      const r = new FileReader();
      r.onload = function(){
        try{
          const d = JSON.parse(r.result);
          if(d.quran) QURAN_DATA = d.quran;
          if(d.state) state = d.state;
          if(d.meta) meta = d.meta;
          saveData(); saveGame(); saveMeta();
          renderPlotsGrid(); updateHeader();
          alert(_('msg_import_ok'));
        }catch(err){ alert(_('msg_bad_file')); }
      };
      r.readAsText(f);
    };
  }
})();
var __spb=document.getElementById('shareProfileBtn'); if(__spb) __spb.onclick = function(){
  let done=0;
  Object.keys(QURAN_DATA).forEach(id=>{ const g=state.gardens[id]; if(g&&g.planted.length&&g.planted.every(Boolean)) done++; });
  const text = 'குர்ஆன் தோட்டம்\n🪙 '+state.coins+' coins\n🔥 '+(meta.streak||0)+' streak\n📖 '+done+' சூரா';
  if(navigator.share) navigator.share({title:'Quran Garden', text:text}).catch(function(){});
  else { navigator.clipboard.writeText(text).then(function(){ alert(_('msg_copied')); }); }
};


/* ===== SAFE TAJWEED (context only – options stay plain) ===== */
/* ===== QCF V4 Tajweed (page fonts + code_v2 glyphs) ===== */
const QCF_FACE_CACHE = {};
const QCF_VERSE_CACHE = {};
let qcfEnabled = false;

function injectQcfFontFace(fam, url){
  const id = 'ff-' + fam;
  if(document.getElementById(id)) return;
  const style = document.createElement('style');
  style.id = id;
  style.textContent = "@font-face{font-family:'" + fam + "';src:url('" + url + "') format('woff2');font-display:swap;}";
  document.head.appendChild(style);
}

function loadQcfV4Font(page){
  const fam = 'QCF4V_p' + page;
  if(QCF_FACE_CACHE[fam] === 'ready') return Promise.resolve(fam);
  if(QCF_FACE_CACHE[fam] && QCF_FACE_CACHE[fam].then) return QCF_FACE_CACHE[fam];

  const urlColr = 'https://verses.quran.foundation/fonts/quran/hafs/v4/colrv1/woff2/p' + page + '.woff2';
  const urlSvg = 'https://verses.quran.foundation/fonts/quran/hafs/v4/ot-svg/dark/woff2/p' + page + '.woff2';

  QCF_FACE_CACHE[fam] = new Promise(function(resolve, reject){
    // Prefer FontFace API; also inject @font-face for Android WebView
    injectQcfFontFace(fam, urlColr);
    if(typeof FontFace === 'undefined'){
      // wait a bit for CSS font download
      setTimeout(function(){ QCF_FACE_CACHE[fam] = 'ready'; resolve(fam); }, 800);
      return;
    }
    const face = new FontFace(fam, 'url(' + urlColr + ')', { display: 'swap' });
    face.load().then(function(f){
      document.fonts.add(f);
      QCF_FACE_CACHE[fam] = 'ready';
      resolve(fam);
    }).catch(function(){
      injectQcfFontFace(fam + '_svg', urlSvg);
      const face2 = new FontFace(fam, 'url(' + urlSvg + ')', { display: 'swap' });
      return face2.load().then(function(f){
        document.fonts.add(f);
        QCF_FACE_CACHE[fam] = 'ready';
        resolve(fam);
      });
    }).catch(function(err){
      QCF_FACE_CACHE[fam] = null;
      reject(err);
    });
  });
  return QCF_FACE_CACHE[fam];
}

async function getQcfVerse(surahNum, ayahNum){
  const key = surahNum + ':' + ayahNum;
  if(QCF_VERSE_CACHE[key]) return QCF_VERSE_CACHE[key];
  try{
    const res = await fetch('https://api.quran.com/api/v4/quran/verses/code_v2?verse_key=' + encodeURIComponent(key));
    if(!res.ok) throw new Error('fail');
    const data = await res.json();
    const v = (data.verses && data.verses[0]) || null;
    if(!v || !v.code_v2) throw new Error('no verse');
    const out = { code: v.code_v2, page: v.v2_page };
    QCF_VERSE_CACHE[key] = out;
    return out;
  }catch(e){
    return null;
  }
}

function renderUnicodeAyah(el, arabic, meaning){
  el.classList.remove('qcf-ayah', 'loading');
  el.style.fontFamily = '';
  el.innerHTML = '';
  if(tajweedOn) el.innerHTML = tajweedify(arabic||'');
  else el.textContent = arabic||'';
  if(showMeaning && meaning){
    const md = document.createElement('div');
    md.className = 'ta-meaning';
    md.textContent = meaning;
    el.appendChild(md);
  }
}

async function renderQcfInto(el, surahNum, ayahNum, fallbackArabic, meaning){
  el.classList.add('loading');
  el.classList.remove('qcf-ayah');
  el.innerHTML = '<span style="font-size:14px;color:#8899aa">⏳ QCF font...</span>';
  try{
    if(!qcfEnabled || !surahNum || !ayahNum){
      renderUnicodeAyah(el, fallbackArabic, meaning);
      return;
    }
    const v = await getQcfVerse(surahNum, ayahNum);
    if(!v || !v.code || !v.page){
      renderUnicodeAyah(el, fallbackArabic, meaning);
      return;
    }
    let fam;
    try {
      fam = await loadQcfV4Font(v.page);
    } catch(e){
      renderUnicodeAyah(el, fallbackArabic, meaning);
      return;
    }
    // CRITICAL: only set QCF codes with the QCF font — never fallback fonts
    // (fallback fonts show circles/boxes for Private Use glyphs)
    el.classList.remove('loading');
    el.classList.add('qcf-ayah');
    el.style.fontFamily = "'" + fam + "'";
    el.textContent = v.code;
    if(showMeaning && meaning){
      const md = document.createElement('div');
      md.className = 'ta-meaning';
      md.textContent = meaning;
      el.appendChild(md);
    }
  }catch(e){
    renderUnicodeAyah(el, fallbackArabic, meaning);
  }
}

let tajweedOn = true;
// showMeaning already declared above

/* Harakat + ALL Uthmani annotation marks must stay attached to base letter */
const TW_HARAKAT = /[\u064B-\u065F\u0670\u06D6-\u06ED\u08F0-\u08FF\u0640]/;
const TW_QALQALAH = new Set(['ق','ط','ب','ج','د']);
const TW_GHUNNAH = new Set(['ن','م']);
const TW_IDGHAM_G = new Set(['ي','ن','م','و']);
const TW_IDGHAM_NG = new Set(['ل','ر']);
const TW_IQLAB = new Set(['ب']);
const TW_HAMZA = new Set(['ء','أ','إ','ئ','ؤ','آ']);
const TW_IZHAR = new Set(['ه','ع','ح','غ','خ']);
const TW_ALIF = new Set(['ا','آ','ٱ','ى']);

function tajweedify(text){
  if(!tajweedOn || !text) return text;
  try {
    const chars = Array.from(text);
    const clusters = [];
    for(const ch of chars){
      if(TW_HARAKAT.test(ch) && clusters.length) clusters[clusters.length-1].marks += ch;
      else clusters.push({base:ch, marks:''});
    }
    function nextLetter(i){
      let j=i+1, crossed=false;
      while(j<clusters.length && (clusters[j].base===' ' || clusters[j].base==='\u200c')){ crossed=true; j++; }
      if(j>=clusters.length) return null;
      return {cluster:clusters[j], index:j, crossedWord:crossed};
    }
    function prevLetter(i){
      let j=i-1;
      while(j>=0 && clusters[j].base===' ') j--;
      return j>=0 ? clusters[j] : null;
    }
    const tokens = [];
    for(let i=0;i<clusters.length;i++){
      const c = clusters[i];
      const prev = prevLetter(i);
      const hasShadda = c.marks.includes('\u0651');
      const hasSukun = c.marks.includes('\u0652');
      const hasTanween = /[\u064B\u064C\u064D]/.test(c.marks);
      const hasDagger = c.marks.includes('\u0670');
      const hasMaddah = c.marks.includes('\u0653');
      let cls = null;

      if(TW_GHUNNAH.has(c.base) && hasShadda) cls = 'tw-ghunnah';
      else if(TW_QALQALAH.has(c.base) && hasSukun) cls = 'tw-qalqalah';
      else if((c.base==='ن' && hasSukun) || hasTanween){
        let nxt = nextLetter(i);
        if(nxt && !nxt.crossedWord && c.marks.includes('\u064B') && TW_ALIF.has(nxt.cluster.base) && nxt.cluster.marks===''){
          nxt = nextLetter(nxt.index);
        }
        if(nxt){
          const nb = nxt.cluster.base;
          const sameYW = !nxt.crossedWord && (nb==='ي'||nb==='و');
          if(sameYW || TW_HAMZA.has(nb) || TW_IZHAR.has(nb)) cls = null;
          else if(TW_IDGHAM_G.has(nb)) cls = 'tw-ghunnah';
          else if(TW_IDGHAM_NG.has(nb)) cls = 'tw-idgham';
          else if(TW_IQLAB.has(nb)) cls = 'tw-iqlab';
          else cls = 'tw-ikhfa';
        }
      } else {
        let isMadd = false;
        let forceLong = hasMaddah;

        if(hasDagger) isMadd = true;
        if(c.base === 'آ'){ isMadd = true; forceLong = true; }
        if(TW_ALIF.has(c.base) && prev && prev.marks.includes('\u064E')) isMadd = true;
        if(c.base === 'و' && (c.marks === '' || hasSukun) && prev && prev.marks.includes('\u064F')) isMadd = true;
        if((c.base === 'ي' || c.base === 'ى') && (c.marks === '' || hasSukun) && prev && prev.marks.includes('\u0650')) isMadd = true;
        if(hasMaddah && (TW_ALIF.has(c.base) || c.base==='و' || c.base==='ي')){ isMadd = true; forceLong = true; }

        if(isMadd){
          const nxt = nextLetter(i);
          const beforeHamza = nxt && TW_HAMZA.has(nxt.cluster.base);
          const beforeShadda = nxt && !nxt.crossedWord && nxt.cluster.marks.includes('\u0651');
          if(forceLong || beforeHamza || beforeShadda) cls = 'tw-madd-long';
          else cls = 'tw-madd';
        }
      }

      if(!cls && hasShadda) cls = 'tw-shadda';
      tokens.push({text: c.base + c.marks, cls: cls});
    }
    return tokens.map(t => t.cls ? ('<span class="'+t.cls+'">'+t.text+'</span>') : t.text).join('');
  } catch(e){
    return text;
  }
}


function setContextText(el, arabic, meaning, surahNum, ayahNum){
  el.classList.remove('qcf-ayah');
  el.style.fontFamily = '';
  // Prefer QCF V4 when we have verse coordinates and QCF is enabled
  if(qcfEnabled && surahNum && ayahNum){
    renderQcfInto(el, surahNum, ayahNum, arabic, meaning);
    return;
  }
  el.innerHTML = '';
  if(tajweedOn){
    el.innerHTML = tajweedify(arabic||'');
  } else {
    el.textContent = arabic||'';
  }
  if(showMeaning && meaning){
    const md = document.createElement('div');
    md.className = 'ta-meaning';
    md.textContent = meaning;
    el.appendChild(md);
  }
}

document.getElementById('tajweedToggleBtn').onclick = function(){
  tajweedOn = !tajweedOn;
  this.classList.toggle('on', tajweedOn);
  document.getElementById('tajweedLegend').classList.toggle('show', tajweedOn);
  if(document.getElementById('quizOverlay').classList.contains('active') && window.__qi !== undefined){
    openQuiz(window.__qi);
  }
  // refresh juz ayah panel if open
  const panel = document.getElementById('juzAyahPanel');
  if(panel){ panel.dataset.sid = ''; renderAyahPanel(); }
};
document.getElementById('meaningToggleBtn').onclick = function(){
  showMeaning = !showMeaning;
  this.classList.toggle('on', showMeaning);
  if(document.getElementById('quizOverlay').classList.contains('active') && window.__qi !== undefined){
    openQuiz(window.__qi);
  }
};

// Init

/* ===== Themes (10) — white mixed in every palette ===== */
const THEMES = [
  {id:'midnight', name:'Midnight', base:'#060a1a', mode:'dark'},
  {id:'royal', name:'Royal Gold', base:'#1a1028', mode:'dark'},
  {id:'snow', name:'Snow White', base:'#f8fafc', mode:'light'},
  {id:'pearl', name:'Pearl Rose', base:'#fff5f7', mode:'light'},
  {id:'lavender', name:'Lavender', base:'#f5f3ff', mode:'light'},
  {id:'mint', name:'Mint Cream', base:'#f0fdf4', mode:'light'},
  {id:'ocean', name:'Ocean', base:'#0c1929', mode:'dark'},
  {id:'sunset', name:'Sunset', base:'#1c1018', mode:'dark'},
  {id:'emerald', name:'Emerald', base:'#0a1f18', mode:'dark'},
  {id:'amber', name:'Amber', base:'#1a1408', mode:'dark'},
];
const THEME_KEY = 'quran_theme_v1';

function applyTheme(id){
  const t = THEMES.find(x => x.id === id) || THEMES[0];
  const allIds = THEMES.map(x => x.id).concat(['rosewhite','peach','minty','sky','lemon','blush','cream']);
  allIds.forEach(function(th){ document.body.classList.remove('theme-'+th); });
  document.body.classList.add('theme-' + t.id);
  try{ localStorage.setItem(THEME_KEY, t.id); }catch(e){}
  const label = document.getElementById('themeLabel');
  if(label){
    const crowns = {royal:'👑 ', snow:'❄️ ', pearl:'🌸 ', mint:'🌿 ', ocean:'🌊 ', sunset:'🌅 ', emerald:'💚 ', amber:'✨ '};
    label.textContent = (crowns[t.id]||'') + t.name + (t.mode==='light' ? ' · Light' : ' · Dark');
  }
  document.querySelectorAll('.theme-swatch, .theme-dot').forEach(el=>{
    el.classList.toggle('active', el.dataset.theme === t.id);
  });
  const meta = document.querySelector('meta[name="theme-color"]');
  if(meta) meta.setAttribute('content', t.base || '#060a1a');
}

function renderThemeGrid(){
  const grid = document.getElementById('themeGrid');
  if(!grid) return;
  grid.innerHTML = '';
  grid.className = 'theme-grid';
  let saved = 'midnight';
  try{ saved = localStorage.getItem(THEME_KEY) || 'midnight'; }catch(e){}
  if(!THEMES.find(x => x.id === saved)) saved = 'midnight';
  THEMES.forEach(function(t){
    const btn = document.createElement('button');
    btn.type = 'button';
    btn.className = 'theme-swatch' + (t.id === saved ? ' active' : '');
    btn.dataset.theme = t.id;
    btn.title = t.name;
    btn.innerHTML = '<span class="theme-swatch-label">' + t.name + '</span>';
    btn.onclick = function(){ applyTheme(t.id); };
    grid.appendChild(btn);
  });
  applyTheme(saved);
}







/* ===== Simple Mushaf Reader ===== */



/* Mushaf viewer removed */
const PdfMushaf = { mode:'text', buildShell:function(){}, setMode:function(){}, openForSurah:function(){}, render:function(){}, tryRestorePdf:function(){return Promise.resolve(false);} };
function initPdfMushaf(){}
function openMushafView(){ if(typeof switchScreen==='function'){ try{ switchScreen('screenSelect'); }catch(e){} } }
const MUSHAF_LINES = 15;
function buildMushafLines(){ return []; }
function renderMushaf15Page(){}
function initMushafButtons(){}




/* ===== Mini Games (fixed) ===== */

/* ===== Asmaul Husna (99 Names) — Arabic + Tamil name ===== */
const ASMAUL_HUSNA = [
  {ar:'الرَّحْمَٰنُ', ta:'அர்-ரஹ்மான்', en:'Ar-Rahman'},
  {ar:'الرَّحِيمُ', ta:'அர்-ரஹீம்', en:'Ar-Rahim'},
  {ar:'الْمَلِكُ', ta:'அல்-மலிக்', en:'Al-Malik'},
  {ar:'الْقُدُّوسُ', ta:'அல்-குத்தூஸ்', en:'Al-Quddus'},
  {ar:'السَّلَامُ', ta:'அஸ்-சலாம்', en:'As-Salam'},
  {ar:'الْمُؤْمِنُ', ta:'அல்-முஃமின்', en:'Al-Mu\'min'},
  {ar:'الْمُهَيْمِنُ', ta:'அல்-முஹைமின்', en:'Al-Muhaymin'},
  {ar:'الْعَزِيزُ', ta:'அல்-அஸீஸ்', en:'Al-Aziz'},
  {ar:'الْجَبَّارُ', ta:'அல்-ஜப்பார்', en:'Al-Jabbar'},
  {ar:'الْمُتَكَبِّرُ', ta:'அல்-முதகப்பீர்', en:'Al-Mutakabbir'},
  {ar:'الْخَالِقُ', ta:'அல்-காலிக்', en:'Al-Khaliq'},
  {ar:'الْبَارِئُ', ta:'அல்-பாரிஉ', en:'Al-Bari'},
  {ar:'الْمُصَوِّرُ', ta:'அல்-முஸவ்விர்', en:'Al-Musawwir'},
  {ar:'الْغَفَّارُ', ta:'அல்-கஃபார்', en:'Al-Ghaffar'},
  {ar:'الْقَهَّارُ', ta:'அல்-கஹ்ஹார்', en:'Al-Qahhar'},
  {ar:'الْوَهَّابُ', ta:'அல்-வஹ்ஹாப்', en:'Al-Wahhab'},
  {ar:'الرَّزَّاقُ', ta:'அர்-ரஸ்ஸாக்', en:'Ar-Razzaq'},
  {ar:'الْفَتَّاحُ', ta:'அல்-ஃபத்தாஹ்', en:'Al-Fattah'},
  {ar:'الْعَلِيمُ', ta:'அல்-அலீம்', en:'Al-Alim'},
  {ar:'الْقَابِضُ', ta:'அல்-காபிள்', en:'Al-Qabid'},
  {ar:'الْبَاسِطُ', ta:'அல்-பாசித்', en:'Al-Basit'},
  {ar:'الْخَافِضُ', ta:'அல்-காஃபிள்', en:'Al-Khafid'},
  {ar:'الرَّافِعُ', ta:'அர்-ராஃபிஉ', en:'Ar-Rafi'},
  {ar:'الْمُعِزُّ', ta:'அல்-முஇஸ்ஸ்', en:'Al-Mu\'izz'},
  {ar:'الْمُذِلُّ', ta:'அல்-முதில்லு', en:'Al-Mudhill'},
  {ar:'السَّمِيعُ', ta:'அஸ்-சமீஉ', en:'As-Sami'},
  {ar:'الْبَصِيرُ', ta:'அல்-பஸீர்', en:'Al-Basir'},
  {ar:'الْحَكَمُ', ta:'அல்-ஹகம்', en:'Al-Hakam'},
  {ar:'الْعَدْلُ', ta:'அல்-அத்ல்', en:'Al-Adl'},
  {ar:'اللَّطِيفُ', ta:'அல்-லதீஃப்', en:'Al-Latif'},
  {ar:'الْخَبِيرُ', ta:'அல்-கபீர் (Khabīr)', en:'Al-Khabir'},
  {ar:'الْحَلِيمُ', ta:'அல்-ஹலீம்', en:'Al-Halim'},
  {ar:'الْعَظِيمُ', ta:'அல்-அஸீம்', en:'Al-Azim'},
  {ar:'الْغَفُورُ', ta:'அல்-கஃபூர்', en:'Al-Ghafur'},
  {ar:'الشَّكُورُ', ta:'அஷ்-ஷகூர்', en:'Ash-Shakur'},
  {ar:'الْعَلِيُّ', ta:'அல்-அலீயு', en:'Al-Ali'},
  {ar:'الْكَبِيرُ', ta:'அல்-கபீர் (Kabīr)', en:'Al-Kabir'},
  {ar:'الْحَفِيظُ', ta:'அல்-ஹஃபீழ்', en:'Al-Hafiz'},
  {ar:'الْمُقِيتُ', ta:'அல்-முகீத்', en:'Al-Muqit'},
  {ar:'الْحَسِيبُ', ta:'அல்-ஹஸீப்', en:'Al-Hasib'},
  {ar:'الْجَلِيلُ', ta:'அல்-ஜலீல்', en:'Al-Jalil'},
  {ar:'الْكَرِيمُ', ta:'அல்-கரீம்', en:'Al-Karim'},
  {ar:'الرَّقِيبُ', ta:'அர்-ரகீப்', en:'Ar-Raqib'},
  {ar:'الْمُجِيبُ', ta:'அல்-முஜீப்', en:'Al-Mujib'},
  {ar:'الْوَاسِعُ', ta:'அல்-வாசிஉ', en:'Al-Wasi'},
  {ar:'الْحَكِيمُ', ta:'அல்-ஹகீம்', en:'Al-Hakim'},
  {ar:'الْوَدُودُ', ta:'அல்-வதூத்', en:'Al-Wadud'},
  {ar:'الْمَجِيدُ', ta:'அல்-மஜீத்', en:'Al-Majid'},
  {ar:'الْبَاعِثُ', ta:'அல்-பாஇத்', en:'Al-Ba\'ith'},
  {ar:'الشَّهِيدُ', ta:'அஷ்-ஷஹீத்', en:'Ash-Shahid'},
  {ar:'الْحَقُّ', ta:'அல்-ஹக்', en:'Al-Haqq'},
  {ar:'الْوَكِيلُ', ta:'அல்-வகீல்', en:'Al-Wakil'},
  {ar:'الْقَوِيُّ', ta:'அல்-கவீ', en:'Al-Qawiyy'},
  {ar:'الْمَتِينُ', ta:'அல்-மதீன்', en:'Al-Matin'},
  {ar:'الْوَلِيُّ', ta:'அல்-வலீ', en:'Al-Wali'},
  {ar:'الْحَمِيدُ', ta:'அல்-ஹமீத்', en:'Al-Hamid'},
  {ar:'الْمُحْصِي', ta:'அல்-முஹ்ஸீ', en:'Al-Muhsi'},
  {ar:'الْمُبْدِئُ', ta:'அல்-முப்திஉ', en:'Al-Mubdi'},
  {ar:'الْمُعِيدُ', ta:'அல்-முஈத்', en:'Al-Mu\'id'},
  {ar:'الْمُحْيِي', ta:'அல்-முஹ்யீ', en:'Al-Muhyi'},
  {ar:'الْمُمِيتُ', ta:'அல்-முமீத்', en:'Al-Mumit'},
  {ar:'الْحَيُّ', ta:'அல்-ஹய்', en:'Al-Hayy'},
  {ar:'الْقَيُّومُ', ta:'அல்-கய்யூம்', en:'Al-Qayyum'},
  {ar:'الْوَاجِدُ', ta:'அல்-வாஜித்', en:'Al-Wajid'},
  {ar:'الْمَاجِدُ', ta:'அல்-மாஜித்', en:'Al-Majid'},
  {ar:'الْوَاحِدُ', ta:'அல்-வாஹித்', en:'Al-Wahid'},
  {ar:'الْأَحَدُ', ta:'அல்-அஹத்', en:'Al-Ahad'},
  {ar:'الصَّمَدُ', ta:'அஸ்-ஸமத்', en:'As-Samad'},
  {ar:'الْقَادِرُ', ta:'அல்-காதிர்', en:'Al-Qadir'},
  {ar:'الْمُقْتَدِرُ', ta:'அல்-முக்ததிர்', en:'Al-Muqtadir'},
  {ar:'الْمُقَدِّمُ', ta:'அல்-முகத்திம்', en:'Al-Muqaddim'},
  {ar:'الْمُؤَخِّرُ', ta:'அல்-முஅக்கிர்', en:'Al-Mu\'akhkhir'},
  {ar:'الْأَوَّلُ', ta:'அல்-அவ்வல்', en:'Al-Awwal'},
  {ar:'الْآخِرُ', ta:'அல்-ஆகிர்', en:'Al-Akhir'},
  {ar:'الظَّاهِرُ', ta:'அழ்-ழாஹிர்', en:'Az-Zahir'},
  {ar:'الْبَاطِنُ', ta:'அல்-பாதின்', en:'Al-Batin'},
  {ar:'الْوَالِي', ta:'அல்-வாலீ', en:'Al-Wali'},
  {ar:'الْمُتَعَالِي', ta:'அல்-முதஆலீ', en:'Al-Muta\'ali'},
  {ar:'الْبَرُّ', ta:'அல்-பர்ர்', en:'Al-Barr'},
  {ar:'التَّوَّابُ', ta:'அத்-தவ்வாப்', en:'At-Tawwab'},
  {ar:'الْمُنْتَقِمُ', ta:'அல்-முன்தகிம்', en:'Al-Muntaqim'},
  {ar:'الْعَفُوُّ', ta:'அல்-அஃபூவ்', en:'Al-Afuww'},
  {ar:'الرَّءُوفُ', ta:'அர்-ரஊஃப்', en:'Ar-Ra\'uf'},
  {ar:'مَالِكُ الْمُلْكِ', ta:'மாலிகுல்-முல்க்', en:'Malik-ul-Mulk'},
  {ar:'ذُو الْجَلَالِ وَالْإِكْرَامِ', ta:'துல்-ஜலாலி வல்-இக்ராம்', en:'Dhul-Jalali wal-Ikram'},
  {ar:'الْمُقْسِطُ', ta:'அல்-முக்சித்', en:'Al-Muqsit'},
  {ar:'الْجَامِعُ', ta:'அல்-ஜாமிஉ', en:'Al-Jami'},
  {ar:'الْغَنِيُّ', ta:'அல்-கனீ', en:'Al-Ghani'},
  {ar:'الْمُغْنِي', ta:'அல்-முக்னீ', en:'Al-Mughni'},
  {ar:'الْمَانِعُ', ta:'அல்-மானிஉ', en:'Al-Mani'},
  {ar:'الضَّارُّ', ta:'அழ்-ழார்ர்', en:'Ad-Darr'},
  {ar:'النَّافِعُ', ta:'அன்-நாஃபிஉ', en:'An-Nafi'},
  {ar:'النُّورُ', ta:'அன்-நூர்', en:'An-Nur'},
  {ar:'الْهَادِي', ta:'அல்-ஹாதீ', en:'Al-Hadi'},
  {ar:'الْبَدِيعُ', ta:'அல்-பதீஉ', en:'Al-Badi'},
  {ar:'الْبَاقِي', ta:'அல்-பாகீ', en:'Al-Baqi'},
  {ar:'الْوَارِثُ', ta:'அல்-வாரித்', en:'Al-Warith'},
  {ar:'الرَّشِيدُ', ta:'அர்-ரஷீத்', en:'Ar-Rashid'},
  {ar:'الصَّبُورُ', ta:'அஸ்-ஸபூர்', en:'As-Sabur'}
];

const Games = {
  score: 0,
  timer: null,
  timeLeft: 0,
  active: null,
  lock: false,
  _mem: null,
  _speed: null,
  _order: null,
  _blank: null,
  _surah: null,
  _tf: null,

  getLocalSurahs: function(){
    if(typeof QURAN_DATA !== 'object' || !QURAN_DATA) return [];
    return Object.keys(QURAN_DATA).filter(function(id){
      const s = QURAN_DATA[id];
      return s && Array.isArray(s.ayat) && s.ayat.length > 0;
    });
  },

  randomAyahs: function(n){
    const ids = this.getLocalSurahs();
    const pool = [];
    ids.forEach(function(id){
      const s = QURAN_DATA[id];
      (s.ayat || []).forEach(function(a, i){
        const ar = (a && a.ar) ? String(a.ar).trim() : '';
        const ta = (a && a.ta) ? String(a.ta).trim() : '';
        if(ar){
          pool.push({
            id: id, idx: i, ar: ar, ta: ta,
            name: s.nameTa || s.nameAr || id,
            surahNum: s.surahNum
          });
        }
      });
    });
    for(let i = pool.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = pool[i]; pool[i] = pool[j]; pool[j] = t;
    }
    return pool.slice(0, n);
  },

  showMenu: function(){
    const menu = document.getElementById('gamesMenu');
    const play = document.getElementById('gamePlayArea');
    if(menu) menu.style.display = '';
    if(play) play.style.display = 'none';
    if(this.timer){ clearInterval(this.timer); this.timer = null; }
    this.active = null;
    this.lock = false;
  },

  /* One-step back: play → menu → garden (never skip) */
  _backLock: false,
  isPlaying: function(){
    const play = document.getElementById('gamePlayArea');
    if(!play) return false;
    // Prefer inline style set by start/showMenu
    if(play.style.display === 'block') return true;
    if(play.style.display === 'none') return false;
    try{
      return window.getComputedStyle(play).display !== 'none';
    }catch(e){ return !!this.active; }
  },
  goBack: function(){
    // Prevent double-fire (swipe + system back / double touchend)
    if(this._backLock) return 'locked';
    this._backLock = true;
    setTimeout(function(){ Games._backLock = false; }, 550);
    try{ if(typeof AudioFX!=='undefined'&&AudioFX.playSoft) AudioFX.playSoft(); }catch(e){}

    if(this.isPlaying()){
      this.showMenu();
      // sync history to menu level
      try{
        if(history.state && history.state.qg === 'game-play'){
          // we came from pushState play — stay on games menu state
          history.replaceState({qg:'games-menu'}, '');
        }
      }catch(e){}
      return 'menu';
    }
    // on games menu → exit games once
    if(typeof switchScreen === 'function') switchScreen('screenSelect');
    try{ history.replaceState({qg:'home'}, ''); }catch(e){}
    return 'exit';
  },

  start: function(type){
    this.score = 0;
    this.lock = false;
    this.active = type;
    const menu = document.getElementById('gamesMenu');
    const play = document.getElementById('gamePlayArea');
    if(menu) menu.style.display = 'none';
    if(play) play.style.display = 'block';
    try{ history.pushState({qg:'game-play', game:type}, ''); }catch(e){}
    const sc = document.getElementById('gameScore');
    const tm = document.getElementById('gameTimer');
    if(sc) sc.textContent = '⭐ 0';
    if(tm){ tm.textContent = '⏱ —'; tm.classList.remove('warn'); }
    if(type === 'memory') this.startMemory();
    else if(type === 'speed') this.startSpeed();
    else if(type === 'order') this.startOrder();
    else if(type === 'blank') this.startBlank();
    else if(type === 'surah') this.startSurahQuiz();
    else if(type === 'tf') this.startTF();
  },

  addScore: function(n){
    this.score += n;
    const sc = document.getElementById('gameScore');
    if(sc) sc.textContent = '⭐ ' + this.score;
  },

  finish: function(msg, coins){
    try{ if(typeof AudioFX!=='undefined'&&AudioFX.playSuccess) AudioFX.playSuccess(); }catch(e){}
    if(this.timer){ clearInterval(this.timer); this.timer = null; }
    const body = document.getElementById('gameBody');
    if(body){
      body.innerHTML = '<div class="game-result"><h3>🎉 '+_('msg_done_short')+'!</h3><p>'+msg+'</p><p style="color:var(--gold-light);font-weight:800">+'+coins+' coins</p>'+
        '<button type="button" class="play-all-btn" id="gameAgainBtn" style="margin-top:12px">🔄 மீண்டும்</button></div>';
      const self = this;
      const again = document.getElementById('gameAgainBtn');
      if(again) again.onclick = function(){ self.start(self.active); };
    }
    if(typeof state !== 'undefined'){
      state.coins = (state.coins || 0) + coins;
      if(typeof saveGame === 'function') saveGame();
      if(typeof updateHeader === 'function') updateHeader();
      if(typeof updateStreak === 'function') try{ updateStreak(); }catch(e){}
    }
    if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
  },

  /* ---- Memory Match (Asmaul Husna + Ayah) ---- */
  startMemory: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = _('msg_memory_title');
    const body = document.getElementById('gameBody');
    if(!body) return;

    // Prefer Asmaul Husna; fallback to ayahs if missing
    let pairs = [];
    if(typeof ASMAUL_HUSNA !== 'undefined' && ASMAUL_HUSNA.length >= 4){
      const pool = ASMAUL_HUSNA.slice();
      for(let i = pool.length - 1; i > 0; i--){
        const j = Math.floor(Math.random() * (i + 1));
        const t = pool[i]; pool[i] = pool[j]; pool[j] = t;
      }
      pairs = pool.slice(0, 6).map(function(n){
        var local = (typeof I18N !== 'undefined' && I18N.lang === 'en')
          ? (n.en || n.ta) : (n.ta || n.en);
        return { ar: n.ar, ta: local };
      });
    } else {
      const ayahs = this.randomAyahs(6);
      if(ayahs.length < 3){
        body.innerHTML = '<p style="text-align:center;color:var(--text-dim);padding:20px">Data இல்லை</p>';
        return;
      }
      pairs = ayahs.map(function(a){ return { ar: a.ar, ta: a.ta }; });
    }

    const cards = [];
    pairs.forEach(function(a, i){
      cards.push({
        id: 'ar'+i, type: 'ar', pair: i,
        text: a.ar.length > 40 ? a.ar.slice(0, 38) + '…' : a.ar,
        show: false, matched: false
      });
      cards.push({
        id: 'ta'+i, type: 'ta', pair: i,
        text: a.ta.length > 42 ? a.ta.slice(0, 40) + '…' : a.ta,
        show: false, matched: false
      });
    });
    for(let i = cards.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = cards[i]; cards[i] = cards[j]; cards[j] = t;
    }
    this._mem = { cards: cards, flipped: [], matched: 0, total: pairs.length };
    this.renderMemory();
  },

  renderMemory: function(){
    const body = document.getElementById('gameBody');
    if(!body || !this._mem) return;
    const self = this;
    const grid = document.createElement('div');
    grid.className = 'memory-grid';
    grid.id = 'memoryGrid';
    this._mem.cards.forEach(function(c, idx){
      const el = document.createElement('button');
      el.type = 'button';
      el.className = 'memory-card';
      el.dataset.idx = String(idx);
      if(c.matched) el.classList.add('matched');
      if(c.show || c.matched) el.classList.add('flipped');
      if(c.type === 'ar') el.classList.add('face-ar');
      var faceClass = (c.type === 'ar') ? 'mc-face mc-face-ar' : 'mc-face mc-face-ta';
      el.innerHTML =
        '<span class="mc-inner">' +
          '<span class="mc-back"><img src="icons/card-back.png" alt=""></span>' +
          '<span class="'+faceClass+'">'+ (c.text || '') +'</span>' +
        '</span>';
      el.disabled = !!c.matched;
      grid.appendChild(el);
    });
    body.innerHTML = '';
    body.appendChild(grid);
    // event delegation — one listener
    grid.onclick = function(ev){
      let t = ev.target;
      while(t && t !== grid && !t.classList.contains('memory-card')) t = t.parentNode;
      if(!t || !t.classList.contains('memory-card')) return;
      const idx = parseInt(t.dataset.idx, 10);
      if(!isNaN(idx)) self.flipMemory(idx);
    };
  },

  flipMemory: function(idx){
    if(this.lock || !this._mem) return;
    const m = this._mem;
    const c = m.cards[idx];
    if(!c || c.matched || c.show) return;
    if(m.flipped.length >= 2) return;

    c.show = true;
    m.flipped.push(idx);
    try{ if(typeof AudioFX!=='undefined'&&AudioFX.playFlip) AudioFX.playFlip(); }catch(e){}
    // In-place flip for CSS 3D animation
    var node = document.querySelector('.memory-card[data-idx="'+idx+'"]');
    if(node) node.classList.add('flipped');
    else this.renderMemory();

    if(m.flipped.length < 2) return;

    this.lock = true;
    const a = m.cards[m.flipped[0]];
    const b = m.cards[m.flipped[1]];
    const i0 = m.flipped[0], i1 = m.flipped[1];
    const self = this;

    if(a.pair === b.pair && a.type !== b.type){
      a.matched = true;
      b.matched = true;
      m.matched++;
      try{ if(typeof AudioFX!=='undefined'&&AudioFX.playMatch) AudioFX.playMatch(); }catch(e){}
      this.addScore(5);
      m.flipped = [];
      this.lock = false;
      [i0, i1].forEach(function(fi){
        var n = document.querySelector('.memory-card[data-idx="'+fi+'"]');
        if(n){
          n.classList.add('matched', 'match-pop');
          n.disabled = true;
        }
      });
      if(m.matched >= m.total){
        setTimeout(function(){ self.finish('எல்லா ஜோடிகளும் பொருந்தியது!', 15); }, 480);
      }
    } else {
      try{ if(typeof AudioFX!=='undefined'&&AudioFX.playWrong) AudioFX.playWrong(); }catch(e){}
      [i0, i1].forEach(function(fi){
        var n = document.querySelector('.memory-card[data-idx="'+fi+'"]');
        if(n) n.classList.add('wrong');
      });
      setTimeout(function(){
        a.show = false;
        b.show = false;
        m.flipped = [];
        self.lock = false;
        [i0, i1].forEach(function(fi){
          var n = document.querySelector('.memory-card[data-idx="'+fi+'"]');
          if(n){
            n.classList.remove('flipped', 'wrong');
          }
        });
      }, 750);
    }
  },

  /* ---- Speed Quiz ---- */
  startSpeed: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '⚡ Speed';
    this.timeLeft = 30;
    this._speed = { q: 0, correct: 0 };
    const el = document.getElementById('gameTimer');
    if(el){ el.textContent = '⏱ 30'; el.classList.remove('warn'); }
    const self = this;
    if(this.timer) clearInterval(this.timer);
    this.timer = setInterval(function(){
      self.timeLeft--;
      const t = document.getElementById('gameTimer');
      if(t){
        t.textContent = '⏱ ' + self.timeLeft;
        if(self.timeLeft <= 8) t.classList.add('warn');
      }
      if(self.timeLeft <= 0){
        clearInterval(self.timer); self.timer = null;
        const coins = Math.min(20, 5 + self._speed.correct * 2);
        self.finish(self._speed.correct + ' சரி', coins);
      }
    }, 1000);
    this.nextSpeedQ();
  },

  nextSpeedQ: function(){
    if(this.timeLeft <= 0) return;
    const self = this;
    const pool = this.randomAyahs(12);
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(pool.length < 4){
      this.finish('Data குறைவு', 0);
      return;
    }
    this._speed.q++;
    const correct = pool[0];
    const opts = [correct];
    for(let i = 1; i < pool.length && opts.length < 4; i++){
      if(pool[i].ta !== correct.ta) opts.push(pool[i]);
    }
    while(opts.length < 4) opts.push(pool[opts.length % pool.length]);
    for(let i = opts.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = opts[i]; opts[i] = opts[j]; opts[j] = t;
    }
    const mode = 'ar2surah';
    let html = '<div class="speed-q">';
    html += '<div class="sq-prompt">'+_('msg_which_surah')+'</div><div class="sq-ar">'+correct.ar+'</div>';
    html += '</div><div class="speed-opts" id="speedOpts"></div>';
    body.innerHTML = html;
    const box = document.getElementById('speedOpts');
    // unique surah options
    const seen = {};
    const sopts = [];
    opts.forEach(function(o){
      if(!seen[o.id]){ seen[o.id]=true; sopts.push(o); }
    });
    while(sopts.length < 4){
      const extra = pool[sopts.length % pool.length];
      if(extra && !seen[extra.id]){ seen[extra.id]=true; sopts.push(extra); }
      else break;
    }
    sopts.forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o.name;
      btn.style.fontFamily = 'var(--font-ui)';
      btn.style.direction = 'ltr';
      btn.style.textAlign = 'left';
      btn.onclick = function(){
        if(self.lock || self.timeLeft <= 0) return;
        self.lock = true;
        const ok = (o.id === correct.id);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._speed.correct++;
          self.addScore(3);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.lock = false; self.nextSpeedQ(); }, 400);
      };
      box.appendChild(btn);
    });
  },

  /* ---- Ayah Order ---- */
  startOrder: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '🔢 Order';
    const ids = this.getLocalSurahs();
    let chosen = null;
    const shuffled = ids.slice().sort(function(){ return Math.random() - 0.5; });
    for(let i = 0; i < shuffled.length; i++){
      if(QURAN_DATA[shuffled[i]].ayat.length >= 4){ chosen = shuffled[i]; break; }
    }
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(!chosen){
      body.innerHTML = '<p style="text-align:center;padding:20px">'+_('msg_not_enough_ayahs')+'</p>';
      return;
    }
    const s = QURAN_DATA[chosen];
    const startIdx = Math.floor(Math.random() * Math.max(1, s.ayat.length - 3));
    const slice = s.ayat.slice(startIdx, startIdx + 4).map(function(a, i){
      const ar = a.ar || '';
      return { ar: ar, real: startIdx + i + 1, text: ar.length > 70 ? ar.slice(0, 68) + '…' : ar };
    });
    const order = slice.slice();
    for(let i = order.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = order[i]; order[i] = order[j]; order[j] = t;
    }
    this._order = { items: order, correct: slice.map(function(x){ return x.real; }), name: s.nameTa || s.nameAr };
    this.renderOrder();
  },

  renderOrder: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body || !this._order) return;
    body.innerHTML = '<p style="text-align:center;font-size:12px;color:var(--text-dim);margin-bottom:8px">'+this._order.name+' · அழுத்தி மேலே நகர்த்துங்கள்</p>';
    const list = document.createElement('div');
    list.className = 'order-list';
    this._order.items.forEach(function(it, idx){
      const el = document.createElement('button');
      el.type = 'button';
      el.className = 'order-item';
      el.style.width = '100%';
      el.style.cursor = 'pointer';
      el.innerHTML = '<div class="oi-num">#'+(idx+1)+' · மேலே ⬆</div>'+it.text;
      el.onclick = function(){
        if(idx === 0) return;
        const arr = self._order.items;
        const t = arr[idx]; arr[idx] = arr[idx-1]; arr[idx-1] = t;
        self.renderOrder();
      };
      list.appendChild(el);
    });
    body.appendChild(list);
    const check = document.createElement('button');
    check.type = 'button';
    check.className = 'play-all-btn';
    check.style.display = 'block';
    check.style.margin = '14px auto';
    check.textContent = _('msg_check');
    check.onclick = function(){ self.checkOrder(); };
    body.appendChild(check);
  },

  checkOrder: function(){
    const items = this._order.items;
    let ok = true;
    for(let i = 0; i < items.length; i++){
      if(items[i].real !== this._order.correct[i]){ ok = false; break; }
    }
    if(ok){
      this.addScore(10);
      this.finish('வரிசை சரியானது!', 25);
    } else {
      alert(_('msg_order_wrong'));
      if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
    }
  },

  startBlank: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '📝 Missing Word';
    this._blank = { q: 0, correct: 0, total: 6 };
    this.nextBlankQ();
  },

  nextBlankQ: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(this._blank.q >= this._blank.total){
      const coins = Math.min(20, 6 + this._blank.correct * 2);
      this.finish(this._blank.correct + ' / ' + this._blank.total + ' சரி', coins);
      return;
    }
    const pool = this.randomAyahs(10);
    if(pool.length < 4){ this.finish('Data குறைவு', 0); return; }
    let chosen = null;
    for(let i = 0; i < pool.length; i++){
      const words = pool[i].ar.trim().split(/\s+/).filter(function(w){ return w.length > 1; });
      if(words.length >= 3){ chosen = pool[i]; chosen._words = words; break; }
    }
    if(!chosen){ chosen = pool[0]; chosen._words = chosen.ar.trim().split(/\s+/); }
    const words = chosen._words;
    const blankIdx = Math.floor(Math.random() * words.length);
    const answer = words[blankIdx];
    const display = words.map(function(w, i){ return i === blankIdx ? '____' : w; }).join(' ');
    const opts = [answer];
    pool.forEach(function(p){
      if(opts.length >= 4) return;
      (p.ar || '').split(/\s+/).forEach(function(w){
        if(opts.length >= 4) return;
        w = w.trim();
        if(w.length > 1 && opts.indexOf(w) === -1) opts.push(w);
      });
    });
    while(opts.length < 4) opts.push(opts[opts.length % Math.max(1,opts.length)] || 'ٱللَّه');
    for(let i = opts.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = opts[i]; opts[i] = opts[j]; opts[j] = t;
    }
    this._blank.q++;
    this.lock = false;
    body.innerHTML =
      '<div class="speed-q">'+
        '<div class="sq-prompt">மறைந்த சொல் எது? ('+this._blank.q+'/'+this._blank.total+')</div>'+
        '<div class="sq-ar" style="font-size:20px;line-height:1.8">'+display+'</div>'+
        '<div style="font-size:12px;color:var(--text-dim);margin-top:6px">'+chosen.name+'</div>'+
      '</div><div class="speed-opts" id="blankOpts"></div>';
    const box = document.getElementById('blankOpts');
    opts.forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o;
      btn.style.fontFamily = 'var(--font-ar)';
      btn.style.direction = 'rtl';
      btn.onclick = function(){
        if(self.lock) return;
        self.lock = true;
        const ok = (o === answer);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._blank.correct++;
          self.addScore(3);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.nextBlankQ(); }, 450);
      };
      box.appendChild(btn);
    });
  },

  startSurahQuiz: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '📖 Which Surah?';
    this._surah = { q: 0, correct: 0, total: 6 };
    this.nextSurahQ();
  },

  nextSurahQ: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(this._surah.q >= this._surah.total){
      const coins = Math.min(20, 6 + this._surah.correct * 2);
      this.finish(this._surah.correct + ' / ' + this._surah.total + ' சரி', coins);
      return;
    }
    const pool = this.randomAyahs(12);
    if(pool.length < 4){ this.finish('Data குறைவு', 0); return; }
    const correct = pool[0];
    const seen = {};
    const opts = [{ name: correct.name, id: correct.id }];
    seen[correct.id] = true;
    for(let i = 1; i < pool.length && opts.length < 4; i++){
      if(!seen[pool[i].id]){
        seen[pool[i].id] = true;
        opts.push({ name: pool[i].name, id: pool[i].id });
      }
    }
    if(opts.length < 4){
      this.getLocalSurahs().forEach(function(id){
        if(opts.length >= 4) return;
        if(!seen[id]){
          seen[id] = true;
          const s = QURAN_DATA[id];
          opts.push({ name: s.nameTa || s.nameAr || id, id: id });
        }
      });
    }
    for(let i = opts.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = opts[i]; opts[i] = opts[j]; opts[j] = t;
    }
    this._surah.q++;
    this.lock = false;
    body.innerHTML =
      '<div class="speed-q">'+
        '<div class="sq-prompt">'+_('msg_which_surah')+' ('+this._surah.q+'/'+this._surah.total+')</div>'+
        '<div class="sq-ar" style="font-size:20px;line-height:1.8">'+correct.ar+'</div>'+
      '</div><div class="speed-opts" id="surahOpts"></div>';
    const box = document.getElementById('surahOpts');
    opts.forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o.name;
      btn.style.fontFamily = 'var(--font-ui)';
      btn.style.direction = 'ltr';
      btn.style.textAlign = 'left';
      btn.onclick = function(){
        if(self.lock) return;
        self.lock = true;
        const ok = (o.id === correct.id);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._surah.correct++;
          self.addScore(3);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.nextSurahQ(); }, 450);
      };
      box.appendChild(btn);
    });
  },

  startTF: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '✅ True / False';
    this._tf = { q: 0, correct: 0, total: 8 };
    this.nextTFQ();
  },

  nextTFQ: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(this._tf.q >= this._tf.total){
      const coins = Math.min(15, 4 + this._tf.correct);
      this.finish(this._tf.correct + ' / ' + this._tf.total + ' சரி', coins);
      return;
    }
    const pool = this.randomAyahs(8);
    if(pool.length < 2){ this.finish('Data குறைவு', 0); return; }
    const ayah = pool[0];
    // True = correct surah name, False = wrong surah name
    const isTrue = Math.random() > 0.45;
    let shownName = ayah.name;
    if(!isTrue){
      for(let i = 1; i < pool.length; i++){
        if(pool[i].id !== ayah.id){ shownName = pool[i].name; break; }
      }
    }
    this._tf.q++;
    this.lock = false;
    body.innerHTML =
      '<div class="speed-q">'+
        '<div class="sq-prompt">'+_('msg_ayah_correct')+' ('+this._tf.q+'/'+this._tf.total+')</div>'+
        '<div class="sq-ar" style="font-size:20px;line-height:1.8;margin-bottom:10px">'+ayah.ar+'</div>'+
        '<div class="sq-ta" style="font-size:15px;color:var(--gold-light);padding:10px;background:rgba(255,255,255,.06);border-radius:10px">📖 '+shownName+'</div>'+
      '</div><div class="speed-opts" id="tfOpts" style="flex-direction:row;gap:12px;justify-content:center"></div>';
    const box = document.getElementById('tfOpts');
    [
      { label: '✅ சரி (True)', val: true },
      { label: '❌ தவறு (False)', val: false }
    ].forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o.label;
      btn.style.fontFamily = 'var(--font-ui)';
      btn.style.flex = '1';
      btn.style.minWidth = '120px';
      btn.onclick = function(){
        if(self.lock) return;
        self.lock = true;
        const ok = (o.val === isTrue);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._tf.correct++;
          self.addScore(2);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.nextTFQ(); }, 450);
      };
      box.appendChild(btn);
    });
  }
};

function initGames(){
  document.querySelectorAll('.game-card[data-game]').forEach(function(card){
    card.onclick = function(e){
      e.preventDefault();
      const g = card.getAttribute('data-game');
      if(g) Games.start(g);
    };
  });
  const back = document.getElementById('gamesBackBtn');
  if(back) back.onclick = function(){ Games.goBack(); };
  const quit = document.getElementById('gameQuitBtn');
  if(quit) quit.onclick = function(){ Games.showMenu(); };
}

/* Android back / edge-swipe / in-app swipe — ONE step only */
(function(){
  if(window.GAME_SWIPE_BOUND) return;
  window.GAME_SWIPE_BOUND = true;

  var sx = 0, sy = 0, st = 0, tracking = false;
  var MIN_DX = 80;
  var MAX_DY = 70;
  var MAX_MS = 700;
  var lastBackAt = 0;

  function onGamesScreen(){
    var scr = document.getElementById('screenGames');
    return !!(scr && scr.classList.contains('active'));
  }

  function oneStepBack(){
    var now = Date.now();
    if(now - lastBackAt < 500) return; // hard debounce
    lastBackAt = now;
    if(!onGamesScreen()) return;
    if(typeof Games !== 'undefined' && Games.goBack) Games.goBack();
  }

  // In-app swipe right
  document.addEventListener('touchstart', function(e){
    if(!onGamesScreen()){ tracking = false; return; }
    if(!e.touches || e.touches.length !== 1) return;
    var t = e.touches[0];
    sx = t.clientX; sy = t.clientY; st = Date.now();
    tracking = true;
  }, {passive:true});

  document.addEventListener('touchend', function(e){
    if(!tracking) return;
    tracking = false;
    if(!onGamesScreen()) return;
    if(!e.changedTouches || !e.changedTouches[0]) return;
    var t = e.changedTouches[0];
    var dx = t.clientX - sx;
    var dy = Math.abs(t.clientY - sy);
    var dt = Date.now() - st;
    if(dx > MIN_DX && dy < MAX_DY && dt < MAX_MS){
      oneStepBack();
    }
  }, {passive:true});

  // Android Chrome edge-swipe / system back uses history
  window.addEventListener('popstate', function(ev){
    if(!onGamesScreen()) return;
    // intercept: do one in-app step instead of leaving page
    var play = document.getElementById('gamePlayArea');
    var playing = play && play.style.display === 'block';
    if(playing){
      // stay in app — show menu
      if(typeof Games !== 'undefined') Games.showMenu();
      try{ history.pushState({qg:'games-menu'}, ''); }catch(e){}
    } else {
      // on menu — go garden once
      if(typeof switchScreen === 'function') switchScreen('screenSelect');
      try{ history.pushState({qg:'home'}, ''); }catch(e){}
    }
  });

  // When user opens Games screen, plant a history entry
  var _origSwitch = null;
  function hookSwitch(){
    if(typeof switchScreen !== 'function' || switchScreen.__gameHistHooked) return;
    _origSwitch = switchScreen;
    switchScreen = function(id){
      var r = _origSwitch.apply(this, arguments);
      try{
        if(id === 'screenGames'){
          history.pushState({qg:'games-menu'}, '');
        }
      }catch(e){}
      return r;
    };
    switchScreen.__gameHistHooked = true;
    if(_origSwitch.__sfxWrapped) switchScreen.__sfxWrapped = true;
  }
  if(document.readyState === 'loading'){
    
// Auto-save full progress when leaving / hiding tab
try{
  window.addEventListener('beforeunload', function(){ try{ saveAllProgress(); }catch(e){} });
  document.addEventListener('visibilitychange', function(){
    if(document.visibilityState === 'hidden'){ try{ saveAllProgress(); }catch(e){} }
  });
}catch(e){}

document.addEventListener('DOMContentLoaded', hookSwitch);
  } else {
    setTimeout(hookSwitch, 0);
  }
})();






loadAll();
renderThemeGrid();

/* ===== Touch helpers ===== */
function initTouchOptimizations(){
  // Prevent double-tap zoom on interactive elements (iOS)
  let lastTouchEnd = 0;
  document.addEventListener('touchend', function(e){
    const now = Date.now();
    if(now - lastTouchEnd <= 300){
      const t = e.target;
      if(t && (t.closest('button') || t.closest('.level-tile') || t.closest('.memory-card') ||
               t.closest('.game-card') || t.closest('.opt-btn') || t.closest('.ayah-dot'))){
        e.preventDefault();
      }
    }
    lastTouchEnd = now;
  }, {passive: false});

  // Visual pressed state via class for devices without :active reliability
  document.addEventListener('touchstart', function(e){
    const t = e.target.closest('button, .level-tile, .memory-card, .game-card, .opt-btn, .mode-btn, .ayah-dot');
    if(t) t.classList.add('is-pressed');
  }, {passive: true});
  document.addEventListener('touchend', function(e){
    document.querySelectorAll('.is-pressed').forEach(function(el){ el.classList.remove('is-pressed'); });
  }, {passive: true});
  document.addEventListener('touchcancel', function(){
    document.querySelectorAll('.is-pressed').forEach(function(el){ el.classList.remove('is-pressed'); });
  }, {passive: true});
}

initGames();

function initQuizOverlayUX(){
  const ov = document.getElementById('quizOverlay');
  if(!ov) return;
  ov.addEventListener('click', function(e){
    if(e.target === ov){
      ov.classList.remove('active');
      if(currentAudio){ try{currentAudio.pause();}catch(err){} currentAudio=null; }
    }
  });
  const cancel = document.getElementById('quizCancel');
  if(cancel){
    cancel.onclick = function(){
      ov.classList.remove('active');
      if(currentAudio){ try{currentAudio.pause();}catch(err){} currentAudio=null; }
    };
  }
}

initTouchOptimizations();
initQuizOverlayUX();

/* ===== Script: Indo-Pak / Uthmani ===== */
const SCRIPT_KEY = 'quran_script_v1';
let currentScript = 'indopak';

function applyScriptFonts(){
  document.body.classList.remove('script-uthmani','script-indopak');
  if(currentScript === 'uthmani'){
    document.body.classList.add('script-uthmani');
    document.documentElement.style.setProperty('--font-ar', "'UthmanicHafs','Amiri Quran','Scheherazade New','Noto Naskh Arabic','AlMajeed',serif");
  } else {
    document.body.classList.add('script-indopak');
    document.documentElement.style.setProperty('--font-ar', "'AlMajeed','MuhammadiQuranic','UthmanicHafs','Amiri Quran','Scheherazade New','Noto Naskh Arabic',serif");
  }
  // Keep custom Arabic display font app-wide if selected
  try{
    if(typeof currentArFont==='string' && currentArFont && currentArFont!=='default' && AR_FONT_STACK[currentArFont]){
      document.documentElement.style.setProperty('--font-ar', AR_FONT_STACK[currentArFont]);
      document.documentElement.style.setProperty('--font-ar-display', AR_FONT_STACK[currentArFont]);
      if(document.body && !document.body.classList.contains('ar-font-'+currentArFont)){
        document.body.classList.add('ar-font-'+currentArFont);
      }
    }
  }catch(e){}
}

function getDefaultForScript(script){
  return script === 'uthmani' ? DEFAULT_QURAN_UTHMANI : DEFAULT_QURAN_INDOPAK;
}

function applyScript(script, forceReload){
  const s = (script === 'uthmani') ? 'uthmani' : 'indopak';
  if(s === currentScript && !forceReload) {
    // just update UI
  } else {
    currentScript = s;
    try{ localStorage.setItem(SCRIPT_KEY, s); }catch(e){}
    // Replace local surah texts from embedded defaults; keep garden progress
    const src = getDefaultForScript(s);
    Object.keys(src).forEach(id=>{
      const keepGarden = state.gardens[id];
      QURAN_DATA[id] = structuredClone(src[id]);
      if(keepGarden && keepGarden.planted && keepGarden.planted.length === QURAN_DATA[id].ayat.length){
        state.gardens[id] = keepGarden;
      } else {
        state.gardens[id] = {planted: Array(QURAN_DATA[id].ayat.length).fill(false)};
      }
    });
    // Clear non-local surahs so they re-fetch with new script
    Object.keys(QURAN_DATA).forEach(id=>{
      if(!src[id]) delete QURAN_DATA[id];
    });
    JUZ_CACHE = {};
    saveData(); saveGame();
    applyScriptFonts();
  }
  const label = document.getElementById('scriptLabel');
  if(label) label.textContent = s === 'uthmani' ? 'Uthmani (மதீனா)' : 'Indo-Pak (தெற்காசிய)';
  document.querySelectorAll('.script-btn').forEach(btn=>{
    btn.classList.toggle('active', btn.dataset.script === currentScript);
  });
}

function initScriptSelector(){
  let saved = 'indopak';
  try{ saved = localStorage.getItem(SCRIPT_KEY) || 'indopak'; }catch(e){}
  currentScript = saved;
  applyScriptFonts();
  document.querySelectorAll('.script-btn').forEach(btn=>{
    btn.onclick = function(){
      if(btn.dataset.script === currentScript) return;
      applyScript(btn.dataset.script, true);
      // refresh current view if open
      if(currentSurah && QURAN_DATA[currentSurah]){
        try{ openGarden(currentSurah); }catch(e){}
      }
    };
  });
  applyScript(saved, false);
  // If saved was uthmani, need to actually load uthmani data
  if(saved === 'uthmani') applyScript('uthmani', true);
  initTamilFontSelector();
  initArabicFontSelector();
}

/* ===== Tamil font picker (10 Unicode fonts) ===== */
const TAMIL_FONT_KEY = 'quran_tamil_font_v1';
const TAMIL_FONT_STACK = {
  default: "'TamilTechSai','Noto Sans Tamil',system-ui,sans-serif",
  Tamil001: "'Tamil001','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil002: "'Tamil002','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil003: "'Tamil003','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil004: "'Tamil004','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil005: "'Tamil005','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil006: "'Tamil006','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil007: "'Tamil007','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil008: "'Tamil008','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil009: "'Tamil009','TamilTechSai','Noto Sans Tamil',sans-serif",
  Tamil010: "'Tamil010','TamilTechSai','Noto Sans Tamil',sans-serif"
};
const TAMIL_FONT_LABELS = {
  default: 'இயல்பு (Default)',
  Tamil001: 'தமிழ் 1', Tamil002: 'தமிழ் 2', Tamil003: 'தமிழ் 3', Tamil004: 'தமிழ் 4',
  Tamil005: 'தமிழ் 5', Tamil006: 'தமிழ் 6', Tamil007: 'தமிழ் 7', Tamil008: 'தமிழ் 8',
  Tamil009: 'தமிழ் 9', Tamil010: 'தமிழ் 10'
};
let currentTamilFont = 'default';

function applyTamilFont(id){
  var key = (id && TAMIL_FONT_STACK[id]) ? id : 'default';
  currentTamilFont = key;
  var stack = TAMIL_FONT_STACK[key];
  document.documentElement.style.setProperty('--font-ta', stack);
  document.documentElement.style.setProperty('--font-ui', stack);
  try{ localStorage.setItem(TAMIL_FONT_KEY, key); }catch(e){}
  document.querySelectorAll('.tamil-font-btn').forEach(function(btn){
    btn.classList.toggle('active', btn.getAttribute('data-tafont') === key);
  });
  var lab = document.getElementById('tamilFontLabel');
  if(lab) lab.textContent = TAMIL_FONT_LABELS[key] || key;
}

function initTamilFontSelector(){
  var saved = 'default';
  try{ saved = localStorage.getItem(TAMIL_FONT_KEY) || 'default'; }catch(e){}
  applyTamilFont(saved);
  document.querySelectorAll('.tamil-font-btn').forEach(function(btn){
    btn.onclick = function(){
      applyTamilFont(btn.getAttribute('data-tafont'));
    };
  });
}


function updateTamilFontUI(){
  applyTamilFont(currentTamilFont);
}

/* ===== Arabic display font picker (6 fonts) ===== */
/* ===== Arabic display font picker (app-wide) ===== */
const AR_FONT_KEY = 'quran_ar_font_v2';
const AR_FONT_FILES = {
  Lateef: 'fonts/Lateef.ttf',
  Marhey: 'fonts/Marhey.ttf',
  ScheherazadeNew: 'fonts/ScheherazadeNew.ttf',
  NotoNaskhArabic: 'fonts/NotoNaskhArabic.ttf',
  Vazirmatn: 'fonts/Vazirmatn.ttf'
};
const AR_FONT_STACK = {
  default: null,
  Lateef: "'Lateef','Noto Naskh Arabic',serif",
  Marhey: "'Marhey','Noto Naskh Arabic',serif",
  ScheherazadeNew: "'ScheherazadeNew','Scheherazade New',serif",
  NotoNaskhArabic: "'NotoNaskhArabic','Noto Naskh Arabic',serif",
  Vazirmatn: "'Vazirmatn','Noto Naskh Arabic',sans-serif"
};
const AR_FONT_LABELS = {
  default: 'இயல்பு (Default)',
  Lateef: 'Lateef', Marhey: 'Marhey',
  ScheherazadeNew: 'Scheherazade', NotoNaskhArabic: 'Noto Naskh', Vazirmatn: 'Vazirmatn'
};
let currentArFont = 'default';
var __arFontsLoaded = {};

function loadArFontFile(key){
  if(!key || key==='default' || __arFontsLoaded[key]) return Promise.resolve();
  var path = AR_FONT_FILES[key];
  if(!path) return Promise.resolve();
  if(typeof FontFace === 'undefined'){
    __arFontsLoaded[key] = true;
    return Promise.resolve();
  }
  try{
    var ff = new FontFace(key, 'url(' + path + ')');
    return ff.load().then(function(loaded){
      document.fonts.add(loaded);
      __arFontsLoaded[key] = true;
    }).catch(function(){
      var ff2 = new FontFace(key, "url('./" + path + "')");
      return ff2.load().then(function(loaded){
        document.fonts.add(loaded);
        __arFontsLoaded[key] = true;
      }).catch(function(){ __arFontsLoaded[key] = true; });
    });
  }catch(e){
    __arFontsLoaded[key] = true;
    return Promise.resolve();
  }
}

function applyArabicFont(id){
  var key = (id && (id in AR_FONT_STACK)) ? id : 'default';
  currentArFont = key;
  var stack = AR_FONT_STACK[key];
  function paint(){
    try{
      var b = document.body;
      if(b){
        (b.className || '').split(/\s+/).forEach(function(cl){
          if(cl.indexOf('ar-font-') === 0) b.classList.remove(cl);
        });
        if(key && key !== 'default') b.classList.add('ar-font-' + key);
      }
    }catch(e){}
    if(stack){
      document.documentElement.style.setProperty('--font-ar', stack);
      document.documentElement.style.setProperty('--font-ar-display', stack);
    } else {
      document.documentElement.style.removeProperty('--font-ar-display');
      try{ if(typeof applyScriptFonts==='function') applyScriptFonts(); }catch(e){}
    }
    try{ localStorage.setItem(AR_FONT_KEY, key); }catch(e){}
    document.querySelectorAll('.ar-font-btn').forEach(function(btn){
      btn.classList.toggle('active', btn.getAttribute('data-arfont') === key);
    });
    var lab = document.getElementById('arFontLabel');
    if(lab) lab.textContent = AR_FONT_LABELS[key] || key;
  }
  if(key !== 'default'){
    loadArFontFile(key).then(paint).catch(paint);
  } else {
    paint();
  }
}

function initArabicFontSelector(){
  Object.keys(AR_FONT_FILES).forEach(function(k){ loadArFontFile(k); });
  var saved = 'default';
  try{ saved = localStorage.getItem(AR_FONT_KEY) || 'default'; }catch(e){}
  applyArabicFont(saved);
  document.querySelectorAll('.ar-font-btn').forEach(function(btn){
    btn.onclick = function(){ applyArabicFont(btn.getAttribute('data-arfont')); };
  });
}

function updateArabicFontUI(){
  applyArabicFont(currentArFont);
}





function updateScriptUI(){
  try{
    document.querySelectorAll('.script-btn').forEach(function(btn){
      btn.classList.toggle('active', btn.dataset.script === currentScript);
    });
    var label = document.getElementById('scriptLabel');
    if(label) label.textContent = currentScript === 'uthmani' ? 'Uthmani (மதீனா)' : 'Indo-Pak (தெற்காசிய)';
  }catch(e){}
  try{ updateTamilFontUI(); }catch(e){}
  try{ updateArabicFontUI(); }catch(e){}
}


(function(){
  var b=document.getElementById('openDuaBtn'); if(!b) b=null; // may be removed from profile
  if(b) b.onclick=function(){ if(typeof switchScreen==='function'){ switchScreen('screenDua'); initDua(); } };
})();
(function(){
  var nb=document.getElementById('openNabiDuaBtn');
  if(nb) nb.onclick=function(){ if(typeof switchScreen==='function'){ switchScreen('screenNabiDua'); initNabiDua(); } };
})();
// Soft staggered boot (folder version — less hang)
(function(){
  var steps = [
    function(){ try{ initMushafButtons(); }catch(e){} },
    function(){ try{ initScriptSelector(); }catch(e){} },
    function(){ try{ initJuzFilterUI(); }catch(e){} },
    function(){ try{ updateHeader(); }catch(e){} },
    function(){ try{ updateDailyUI(); }catch(e){} },
    function(){ try{ renderPlotsGrid(); }catch(e){} },
    function(){
      var s=document.getElementById('bootSplash');
      if(s){ s.style.opacity='0'; setTimeout(function(){ try{s.remove();}catch(e){} }, 300); }
    }
  ];
  var i=0;
  function run(){
    if(i>=steps.length) return;
    try{ steps[i](); }catch(e){ console.warn(e); }
    i++;
    setTimeout(run, 25);
  }
  setTimeout(run, 40);
})();



const PRAYER_PLACES = {"தமிழ்நாடு":[{name:"சென்னை",lat:13.0827,lng:80.2707}]};

/* ===== Prayer times (தொழுகை நேரம்) ===== */
const PRAYER_KEY = 'quran_prayer_loc_v1';
const PRAYER_NAMES = [
  { key: 'Fajr', ta: 'ஃபஜ்ர்' },
  { key: 'Dhuhr', ta: 'ளுஹர்' },
  { key: 'Asr', ta: 'அஸர்' },
  { key: 'Maghrib', ta: 'மக்ரிப்' },
  { key: 'Isha', ta: 'இஷா' }
];

function prayerPad(n){ return String(n).padStart(2,'0'); }

function prayerToMinutes(hhmm){
  if(!hhmm) return null;
  const p = String(hhmm).trim().split(':');
  if(p.length < 2) return null;
  return parseInt(p[0],10)*60 + parseInt(p[1],10);
}

function prayerFormat12(hhmm){
  if(!hhmm) return '—';
  const parts = String(hhmm).split(':');
  let h = parseInt(parts[0],10), m = parseInt(parts[1],10);
  if(isNaN(h)||isNaN(m)) return hhmm;
  const am = h < 12;
  const h12 = h % 12 || 12;
  return h12 + ':' + prayerPad(m) + (am ? ' AM' : ' PM');
}

function loadPrayerLoc(){
  try { return JSON.parse(localStorage.getItem(PRAYER_KEY) || 'null'); } catch(e){ return null; }
}
function savePrayerLoc(loc){
  try { localStorage.setItem(PRAYER_KEY, JSON.stringify(loc)); } catch(e){}
}

function renderPrayerTimes(timings, metaText){
  const list = document.getElementById('prayerList');
  const meta = document.getElementById('prayerMeta');
  const nextEl = document.getElementById('prayerNext');
  if(meta) meta.textContent = metaText || '';
  if(!list || !timings) return;

  const now = new Date();
  const nowMin = now.getHours()*60 + now.getMinutes();
  let nextName = null, nextTime = null;

  list.innerHTML = '';
  PRAYER_NAMES.forEach(function(p){
    const t = timings[p.key];
    const mins = prayerToMinutes(t);
    const row = document.createElement('div');
    row.className = 'prayer-row';
    if(mins != null && mins <= nowMin) row.classList.add('passed');
    if(mins != null && mins > nowMin && !nextName){
      nextName = p.ta;
      nextTime = t;
      row.classList.add('next');
    }
    row.innerHTML = '<span>'+p.ta+'</span><strong>'+prayerFormat12(t)+'</strong>';
    list.appendChild(row);
  });

  if(nextEl){
    if(nextName) nextEl.textContent = 'அடுத்து: ' + nextName + ' · ' + prayerFormat12(nextTime);
    else nextEl.textContent = _('msg_prayers_done');
  }
}

async function fetchPrayerTimes(lat, lng, cityLabel){
  const meta = document.getElementById('prayerMeta');
  if(meta) meta.textContent = _('msg_loading_time');
  // method=1 Muslim World League — good default for many regions
  const url = 'https://api.aladhan.com/v1/timings?latitude='+encodeURIComponent(lat)+
    '&longitude='+encodeURIComponent(lng)+'&method=1&school='+(localStorage.getItem('quran_prayer_madhab_v1')==='hanafi'?1:0);
  try{
    const res = await fetch(url);
    if(!res.ok) throw new Error('network');
    const data = await res.json();
    const timings = data && data.data && data.data.timings;
    if(!timings) throw new Error('empty');
    const date = (data.data.date && data.data.date.readable) || '';
    const label = (cityLabel || (lat.toFixed(2)+', '+lng.toFixed(2))) + (date ? ' · ' + date : '');
    renderPrayerTimes(timings, label);
    try{
      localStorage.setItem('qg_prayer_timings_v1', JSON.stringify({
        at: Date.now(), date: (new Date()).toDateString(), timings: timings, label: label||''
      }));
    }catch(e){}
    try{ if(typeof updateHomePrayerStrip==='function') updateHomePrayerStrip(); }catch(e){}
    return timings;
  } catch(e){
    if(meta) meta.textContent = _('msg_time_fail');
    console.warn('prayer times', e);
    return null;
  }
}

function initPrayerTimes(){
  // Place selects
  try {
    const st = document.getElementById('prayerStateSelect');
    const ct = document.getElementById('prayerCitySelect');
    if(st && ct && typeof PRAYER_PLACES === 'object'){
      const states = Object.keys(PRAYER_PLACES);
      st.innerHTML = '';
      states.forEach(function(s){ const o=document.createElement('option'); o.value=s; o.textContent=s; st.appendChild(o); });
      if(states.indexOf('தமிழ்நாடு')>=0) st.value='தமிழ்நாடு';
      function fillCities(){
        const list = PRAYER_PLACES[st.value]||[];
        ct.innerHTML='';
        list.forEach(function(c,i){ const o=document.createElement('option'); o.value=String(i); o.textContent=c.name; ct.appendChild(o); });
        if(st.value==='தமிழ்நாடு'){ const ix=list.findIndex(function(c){return c.name==='சென்னை';}); if(ix>=0) ct.value=String(ix); }
      }
      st.onchange = fillCities; fillCities();
      const go = document.getElementById('prayerCityGoBtn');
      if(go) go.onclick = function(){
        const list = PRAYER_PLACES[st.value]||[];
        const p = list[parseInt(ct.value,10)||0];
        if(!p) return;
        const label = st.value + ' · ' + p.name;
        savePrayerLoc({lat:p.lat,lng:p.lng,label:label});
        fetchPrayerTimes(p.lat, p.lng, label);
      };
    }
    const sh = document.getElementById('madhabShafi');
    const ha = document.getElementById('madhabHanafi');
    function syncMadhab(){
      const m = localStorage.getItem('quran_prayer_madhab_v1')||'shafi';
      if(sh) sh.classList.toggle('active', m==='shafi');
      if(ha) ha.classList.toggle('active', m==='hanafi');
    }
    syncMadhab();
    if(sh) sh.onclick = function(){ localStorage.setItem('quran_prayer_madhab_v1','shafi'); syncMadhab(); const s=loadPrayerLoc(); if(s&&s.lat!=null) fetchPrayerTimes(s.lat,s.lng,s.label||''); };
    if(ha) ha.onclick = function(){ localStorage.setItem('quran_prayer_madhab_v1','hanafi'); syncMadhab(); const s=loadPrayerLoc(); if(s&&s.lat!=null) fetchPrayerTimes(s.lat,s.lng,s.label||''); };
  } catch(e){ console.warn(e); }
  const locateBtn = document.getElementById('prayerLocateBtn');
  const refreshBtn = document.getElementById('prayerRefreshBtn');
  if(!locateBtn && !refreshBtn) return;

  const saved = loadPrayerLoc();
  if(saved && saved.lat != null && saved.lng != null){
    fetchPrayerTimes(saved.lat, saved.lng, saved.label || '');
  }

  if(locateBtn){
    locateBtn.onclick = function(){
      const meta = document.getElementById('prayerMeta');
      if(!navigator.geolocation){
        if(meta) meta.textContent = _('msg_no_geo');
        return;
      }
      if(meta) meta.textContent = _('msg_finding_loc');
      navigator.geolocation.getCurrentPosition(function(pos){
        const lat = pos.coords.latitude;
        const lng = pos.coords.longitude;
        const label = 'உங்கள் இடம்';
        savePrayerLoc({ lat: lat, lng: lng, label: label });
        fetchPrayerTimes(lat, lng, label);
      }, function(err){
        if(meta) meta.textContent = _('msg_loc_denied');
        console.warn(err);
      }, { enableHighAccuracy: false, timeout: 12000, maximumAge: 600000 });
    };
  }

  if(refreshBtn){
    refreshBtn.onclick = function(){
      const saved2 = loadPrayerLoc();
      if(saved2 && saved2.lat != null){
        fetchPrayerTimes(saved2.lat, saved2.lng, saved2.label || '');
      } else if(locateBtn){
        locateBtn.click();
      }
    };
  }
}


/* SAFETY_INIT_PLOTS */
(function(){
  function safeBoot(){
    try { if(typeof loadAll === 'function') loadAll(); } catch(e){ console.warn('loadAll', e); }
    try {
      // never leave home empty due to bad juz filter
      if(typeof selectedJuz === 'number' && selectedJuz > 0){
        var nums = (typeof getSurahNumsForJuz==='function') ? getSurahNumsForJuz(selectedJuz) : null;
        if(!nums || !nums.length){ selectedJuz = 0; try{ localStorage.setItem('quran_juz_filter_v1','0'); }catch(e){} }
      }
    } catch(e){}
    try { if(typeof initJuzFilterUI === 'function') initJuzFilterUI(); } catch(e){ console.warn('juz', e); }
    try { if(typeof renderPlotsGrid === 'function') renderPlotsGrid(); } catch(e){ console.warn('plots', e); }
    try{ if(typeof renderHomeHadiths==='function') renderHomeHadiths(); }catch(e){}
    try { if(typeof initPrayerTimes === 'function') initPrayerTimes(); } catch(e){}
    try { if(typeof updateHeader === 'function') updateHeader(); } catch(e){}
    try { document.body.classList.add('on-home'); } catch(e){}
    try { if(typeof initHomeHub === 'function') initHomeHub(); } catch(e){ console.warn('homeHub', e); }
    try{ ensureBackIcons(); }catch(e){}
    // second attempt after short delay (fonts/DOM)
    setTimeout(function(){
      try { if(typeof renderPlotsGrid === 'function') renderPlotsGrid(); } catch(e){}
    }, 400);
    var s = document.getElementById('bootSplash');
    if(s){ s.style.opacity = '0'; setTimeout(function(){ try{ s.remove(); }catch(e){} }, 250); }
  }
  if(document.readyState === 'loading') document.addEventListener('DOMContentLoaded', function(){ setTimeout(safeBoot, 50); });
  else setTimeout(safeBoot, 50);
})();

document.addEventListener('DOMContentLoaded', function(){
  var sp = document.getElementById('sidePrayerBtn');
  if(sp){
    sp.addEventListener('click', function(){
      setTimeout(function(){
        var el = document.getElementById('prayerCard');
        if(el) el.scrollIntoView({behavior:'smooth', block:'start'});
      }, 300);
    });
  }
});

(function(){
  function scrollToJuzSettings(){
    setTimeout(function(){
      var el = document.getElementById('juzSettingsList');
      if(el) el.scrollIntoView({ behavior: 'smooth', block: 'start' });
    }, 280);
  }
  document.addEventListener('DOMContentLoaded', function(){
    var b = document.getElementById('sideJuzFilterBtn');
    if(b) b.addEventListener('click', scrollToJuzSettings);
  });
})();

document.addEventListener('DOMContentLoaded', function(){
  function backHome(id){
    var el = document.getElementById(id);
    if(el) el.onclick = function(){ if(typeof switchScreen==='function') switchScreen('screenSelect'); };
  }
  backHome('fontBackBtn');
  backHome('juzBackFilterBtn');
  backHome('prayerScreenBackBtn');
});




/* FORCE_PLOTS_RENDER */
(function(){
  function tryPlots(){
    try{
      if(typeof loadAll==='function') loadAll();
      if(typeof renderPlotsGrid==='function') renderPlotsGrid();
      var g=document.getElementById('plotsGrid');
      if(g && !g.innerHTML.trim()){
        setTimeout(tryPlots, 300);
      }
    }catch(e){ console.warn('force plots', e); }
  }
  setTimeout(tryPlots, 100);
  setTimeout(tryPlots, 600);
  setTimeout(tryPlots, 1500);
})();


/* Player name for leaderboard */
document.addEventListener('click', function(e){
  var t = e.target;
  if(t && t.id === 'editPlayerNameBtn'){
    ensureLevelMeta();
    var name = prompt(_('msg_enter_name'), meta.playerName || _('msg_player'));
    if(name && name.trim()){
      meta.playerName = name.trim().slice(0, 20);
      meta.levelProgress.playerName = meta.playerName;
      saveMeta();
      renderPlotsGrid();
    }
  }
});


/* App splash — Bismillah qira'at ONLY on open (not on other clicks) */
(function(){
  function tryPlayBismillahOnce(){
    if(window.__bismillahPlayed || window.__bismillahPlaying) return;
    try{
      if(typeof AudioFX === 'undefined') return;
      if(AudioFX.init) AudioFX.init();
      AudioFX.playBismillah();
    }catch(e){}
  }
  function hideSplash(){
    var el = document.getElementById('appSplash');
    if(!el) return;
    el.classList.add('hide');
    // mark done so later taps never retrigger Bismillah
    window.__bismillahPlayed = true;
    setTimeout(function(){
      try{ if(typeof AudioFX!=='undefined' && AudioFX.stopBismillah) AudioFX.stopBismillah(); }catch(e){}
      if(el && el.parentNode) el.parentNode.removeChild(el);
    }, 900);
  }
  function startSplash(){
    var el = document.getElementById('appSplash');
    if(!el) return;
    // Play once at open
    tryPlayBismillahOnce();
    // One retry if autoplay was blocked (still only during splash)
    setTimeout(tryPlayBismillahOnce, 400);
    // Mobile: ONLY tapping the splash screen can start qira'at (not menu/icons)
    function splashTap(ev){
      if(window.__bismillahPlayed) return;
      tryPlayBismillahOnce();
    }
    el.addEventListener('click', splashTap, false);
    el.addEventListener('touchstart', splashTap, {passive:true});
    setTimeout(hideSplash, 5500);
  }
  // NO document-level listeners — prevents Bismillah on every icon click
  if(document.readyState === 'loading'){
    document.addEventListener('DOMContentLoaded', startSplash);
  } else {
    startSplash();
  }
})();





/* Global UI sound effects — almost every tap */
(function(){
  if(window.SFX_ALL_BOUND) return;
  window.SFX_ALL_BOUND = true;

  function sfx(name){
    try{
      if(typeof AudioFX === 'undefined' || !AudioFX.enabled) return;
      var fn = AudioFX[name];
      if(typeof fn === 'function') fn.call(AudioFX);
    }catch(e){}
  }

  document.addEventListener('click', function(ev){
    var t = ev.target;
    if(!t || !t.closest) return;

    // Don't double-play on memory cards / options that already fire in game code
    if(t.closest('.memory-card')) return;
    if(t.closest('.opt-btn')) return;
    if(t.closest('.sq-opt')) return;

    if(t.closest('#openMenuBtn') || t.closest('.menu-btn-header')) { sfx('playWhoosh'); return; }
    if(t.closest('.side-nav-item')) { sfx('playNav'); return; }
    if(t.closest('.theme-swatch')) { sfx('playPop'); return; }
    if(t.closest('.game-card')) { sfx('playStart'); return; }
    if(t.closest('.juz-icon-btn') || t.closest('.juz-setting-row')) { sfx('playClick'); return; }
    if(t.closest('.level-tile')) { sfx('playClick'); return; }
    if(t.closest('.back-btn')) { sfx('playSoft'); return; }
    if(t.closest('.submit-btn') || t.closest('.mode-btn') || t.closest('.play-all-btn')) { sfx('playStart'); return; }
    if(t.closest('.dhikr-card') || t.closest('.dhikr-btn') || t.closest('#dhikrTapBtn') || t.closest('.dhikr-tap')) { sfx('playTick'); return; }
    if(t.closest('.dua-card') || t.closest('.nabi-dua-item')) { sfx('playSoft'); return; }
    if(t.closest('.icon-btn') || t.closest('#soundBtn')) { sfx('playToggle'); return; }
    if(t.closest('.ayah-dot') || t.closest('.juz-chip')) { sfx('playTick'); return; }
    if(t.closest('button') || t.closest('[role="button"]')) { sfx('playClick'); return; }
  }, true);

  // Screen switch whoosh
  if(typeof switchScreen === 'function' && !switchScreen.__sfxWrapped){
    var _sw = switchScreen;
    switchScreen = function(id){
      sfx('playWhoosh');
      return _sw.apply(this, arguments);
    };
    switchScreen.__sfxWrapped = true;
  }
})();


/* Unlock WebAudio on first user gesture (mobile) */
(function(){
  if(window.AUDIO_UNLOCK) return;
  window.AUDIO_UNLOCK = true;
  function unlock(){
    try{
      if(typeof AudioFX !== 'undefined'){
        AudioFX.init();
        if(AudioFX.ctx && AudioFX.ctx.state === 'suspended') AudioFX.ctx.resume();
      }
    }catch(e){}
    document.removeEventListener('touchstart', unlock, true);
    document.removeEventListener('click', unlock, true);
  }
  document.addEventListener('touchstart', unlock, true);
  document.addEventListener('click', unlock, true);
})();


/* ===== நபி மீது ஸலவாத் ===== */
const SALAWAT_TYPES = [
  {n:1, name:'ஸலவாத் இப்ராஹீமிய்யா', nameEn:'Salawat Ibrahimiyya', ar:'اللَّهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَعَلَىٰ آلِ مُحَمَّدٍ ٭ كَمَا صَلَّيْتَ عَلَىٰ إِبْرَاهِيمَ وَعَلَىٰ آلِ إِبْرَاهِيمَ ٭ إِنَّكَ حَمِيدٌ مَجِيدٌ ٭ اللَّهُمَّ بَارِكْ عَلَىٰ مُحَمَّدٍ وَعَلَىٰ آلِ مُحَمَّدٍ ٭ كَمَا بَارَكْتَ عَلَىٰ إِبْرَاهِيمَ وَعَلَىٰ آلِ إِبْرَاهِيمَ ٭ إِنَّكَ حَمِيدٌ مَجِيدٌ', ta:'ஸலவாத் இப்ராஹீமிய்யா'},
  {n:2, name:'ஸலவாத்துல் ஃபாத்திஹி', nameEn:'Salawat al-Fatih', ar:'اللَّهُمَّ صَلِّ عَلَىٰ سَيِّدِنَا مُحَمَّدٍ ٭ الْفَاتِحِ لِمَا أُغْلِقَ ٭ وَالْخَاتِمِ لِمَا سَبَقَ ٭ نَاصِرِ الْحَقِّ بِالْحَقِّ ٭ وَالْهَادِي إِلَىٰ صِرَاطِكَ الْمُسْتَقِيمِ ٭ وَعَلَىٰ آلِهِ حَقَّ قَدْرِهِ وَمِقْدَارِهِ الْعَظِيمِ', ta:'ஸலவாத்துல் ஃபாத்திஹி'},
  {n:3, name:'ஸலவாத்துன் நாரியா', nameEn:'Salawat an-Nariya', ar:'اللَّهُمَّ صَلِّ صَلَاةً كَامِلَةً ٭ وَسَلِّمْ سَلَامًا تَامًّا ٭ عَلَىٰ سَيِّدِنَا مُحَمَّدٍ ٭ الَّذِي تَنْحَلُّ بِهِ الْعُقَدُ ٭ وَتَنْفَرِجُ بِهِ الْكُرَبُ ٭ وَتُقْضَىٰ بِهِ الْحَوَائِجُ ٭ وَتُنَالُ بِهِ الرَّغَائِبُ ٭ وَحُسْنُ الْخَوَاتِيمِ ٭ وَيُسْتَسْقَىٰ الْغَمَامُ بِوَجْهِهِ الْكَرِيمِ ٭ وَعَلَىٰ آلِهِ وَصَحْبِهِ ٭ فِي كُلِّ لَمْحَةٍ وَنَفَسٍ بِعَدَدِ كُلِّ مَعْلُومٍ لَكَ', ta:'ஸலவாத்துன் நாரியா'},
  {n:4, name:'ஸலவாத்துல் முன்ஜியா', nameEn:'Salawat al-Munjiya', ar:'اللَّهُمَّ صَلِّ عَلَىٰ سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُنْجِينَا بِهَا مِنْ جَمِيعِ الْأَهْوَالِ وَالْآفَاتِ ٭ وَتَقْضِي لَنَا بِهَا جَمِيعَ الْحَاجَاتِ ٭ وَتُطَهِّرُنَا بِهَا مِنْ جَمِيعِ السَّيِّئَاتِ ٭ وَتَرْفَعُنَا بِهَا عِنْدَكَ أَعْلَى الدَّرَجَاتِ ٭ وَتُبَلِّغُنَا بِهَا أَقْصَى الْغَايَاتِ ٭ مِنْ جَمِيعِ الْخَيْرَاتِ ٭ فِي الْحَيَاةِ وَبَعْدَ الْمَمَاتِ', ta:'ஸலவாத்துல் முன்ஜியா'},
  {n:5, name:'ஸலவாத்துத் தாஜ்', nameEn:'Salawat at-Taj', ar:'اللَّهُمَّ صَلِّ عَلَىٰ سَيِّدِنَا وَمَوْلَانَا مُحَمَّدٍ ٭ صَاحِبِ التَّاجِ وَالْمِعْرَاجِ وَالْبُرَاقِ وَالْعَلَمِ ٭ دَافِعِ الْبَلَاءِ وَالْوَبَاءِ وَالْقَحْطِ وَالْمَرَضِ وَالْأَلَمِ ٭ اسْمُهُ مَكْتُوبٌ مَرْفُوعٌ مَشْفُوعٌ مَنْقُوشٌ فِي اللَّوْحِ وَالْقَلَمِ ٭ سَيِّدِ الْعَرَبِ وَالْعَجَمِ ٭ جِسْمُهُ مُقَدَّسٌ مُعَطَّرٌ مُطَهَّرٌ مُنَوَّرٌ فِي الْبَيْتِ وَالْحَرَمِ ٭ شَمْسِ الضُّحَى ٭ بَدْرِ الدُّجَى ٭ صَدْرِ الْعُلَى ٭ نُورِ الْهُدَى ٭ كَهْفِ الْوَرَى ٭ مِصْبَاحِ الظُّلَمِ ٭ جَمِيلِ الشِّيَمِ ٭ شَفِيعِ الْأُمَمِ ٭ صَاحِبِ الْجُودِ وَالْكَرَمِ ٭ وَاللَّهُ عَاصِمُهُ ٭ وَجِبْرِيلُ خَادِمُهُ ٭ وَالْبُرَاقُ مَرْكَبُهُ ٭ وَالْمِعْرَاجُ سَفَرُهُ ٭ وَسِدْرَةُ الْمُنْتَهَى مَقَامُهُ ٭ وَقَابَ قَوْسَيْنِ مَطْلُوبُهُ ٭ وَالْمَطْلُوبُ مَقْصُودُهُ ٭ وَالْمَقْصُودُ مَوْجُودُهُ ٭ سَيِّدِ الْمُرْسَلِينَ ٭ خَاتَمِ النَّبِيِّينَ ٭ شَفِيعِ الْمُذْنِبِينَ ٭ أَنِيسِ الْغَرِيبِينَ ٭ رَحْمَةٍ لِّلْعَالَمِينَ ٭ رَاحَةِ الْعَاشِقِينَ ٭ مُرَادِ الْمُشْتَاقِينَ ٭ شَمْسِ الْعَارِفِينَ ٭ سِرَاجِ السَّالِكِينَ ٭ مِصْبَاحِ الْمُقَرَّبِينَ ٭ مُحِبِّ الْفُقَرَاءِ وَالْغُرَبَاءِ وَالْمَسَاكِينِ ٭ سَيِّدِ الثَّقَلَيْنِ ٭ نَبِيِّ الْحَرَمَيْنِ ٭ إِمَامِ الْقِبْلَتَيْنِ ٭ وَسِيلَتِنَا فِي الدَّارَيْنِ ٭ صَاحِبِ قَابَ قَوْسَيْنِ ٭ مَحْبُوبِ رَبِّ الْمَشْرِقَيْنِ وَالْمَغْرِبَيْنِ ٭ جَدِّ الْحَسَنِ وَالْحُسَيْنِ ٭ مَوْلَانَا وَمَوْلَى الثَّقَلَيْنِ ٭ أَبِي الْقَاسِمِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ ٭ نُورٍ مِنْ نُورِ اللَّهِ ٭ يَا أَيُّهَا الْمُشْتَاقُونَ بِنُورِ جَمَالِهِ ٭ صَلُّوا عَلَيْهِ وَآلِهِ وَأَصْحَابِهِ وَسَلِّمُوا تَسْلِيمًا', ta:'ஸலவாத்துத் தாஜ்'},
  {n:6, name:'ஸலவாத்துன் நூரி ஸாத்தி', nameEn:'Salawat an-Nur adh-Dhati', ar:'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ النُّورِ الذَّاتِي وَالسِّرِّ السَّارِي فِي سَائِرِ الأَسْمَاءِ وَالصِّفَاتِ.', ta:'ஸலவாத்துன் நூரி ஸாத்தி'},
  {n:7, name:'ஸலவாத்துஷ் ஷாபிய்', nameEn:'Salawat ash-Shafi', ar:'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَدَدَ مَا ذَكَرَهُ الذَّاكِرُونَ وَغَفَلَ عَنْ ذِكْرِهِ الْغَافِلُونَ', ta:'ஸலவாத்துஷ் ஷாபிய்'},
  {n:8, name:'ஸலவாத்து திப்பில் குலூப்', nameEn:'Salawat Tibb al-Qulub', ar:'اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ طِبِّ الْقُلُوبِ وَدَوَائِهَا وَعَافِيَةِ الْأَبْدَانِ وَشِفَائِهَا وَنُورِ الْأَبْصَارِ وَضِيَائِهَا وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ', ta:'ஸலவாத்து திப்பில் குலூப்'},
  {n:9, name:'ஸலவாத்துஸ் ஸஆதா', nameEn:'Salawat as-Saada', ar:'اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَدَدَ مَا فِي عِلْمِ اللَّهِ صَلَاةً دَائِمَةً بِدَوَامِ مُلْكِ اللَّهِ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ', ta:'ஸலவாத்துஸ் ஸஆதா'},
  {n:10, name:'ஸலவாத்துல் உம்மிய்யி', nameEn:'Salawat al-Ummi', ar:'اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَنَبِيِّكَ وَرَسُولِكَ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ', ta:'ஸலவாத்துல் உம்மிய்யி'},
  {n:11, name:'ஸலவாத் ஜும்ஆ', nameEn:'Salawat of Jumuah', ar:'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِهِ وَسَلِّمْ تَسْلِيمًا', ta:'ஸலவாத் ஜும்ஆ'}
];

/* ===== மீலாது நிகழ்வு · ஸலவாத் Leaderboard ===== */

function addQuizToMiladBoard(score, total){
  if(total < 100) return;
  ensureMiladMeta();
  var name = meta.playerName || localStorage.getItem('qg_player_name') || 'வீரர்';
  var found = null;
  for(var i=0;i<meta.miladBoard.length;i++){
    if(meta.miladBoard[i].name === name){ found = meta.miladBoard[i]; break; }
  }
  var entry = {
    name: name,
    total: score,
    today: score,
    quizScore: score,
    quizTotal: total,
    type: 'quiz',
    at: Date.now()
  };
  if(found){
    // keep best quiz score
    if(score >= (found.total||0)){
      found.total = score;
      found.today = score;
      found.quizScore = score;
      found.quizTotal = total;
      found.type = 'quiz';
      found.at = Date.now();
    }
  } else {
    meta.miladBoard.push(entry);
  }
  saveMeta();
  try{ if(typeof renderMiladLeaderboard==='function') renderMiladLeaderboard(); }catch(e){}
}
function ensureMiladMeta(){
  if(!meta.milad){
    meta.milad = { total: 0, today: 0, todayDate: null };
  }
  var today = new Date().toISOString().slice(0,10);
  if(meta.milad.todayDate !== today){
    meta.milad.today = 0;
    meta.milad.todayDate = today;
  }
  if(!meta.miladBoard) meta.miladBoard = [];
}
function addMiladSalawat(n){
  if(n <= 0) return;
  ensureMiladMeta();
  meta.milad.total = (meta.milad.total || 0) + n;
  meta.milad.today = (meta.milad.today || 0) + n;
  try{ localStorage.setItem('qg_salawat_count', String(meta.milad.total)); }catch(e){}
  saveMeta();
  // Salawat no longer joins Milad leaderboard (Quiz 100 does)
}
function triggerSalawat1LakhTelegram(playerName, total){
  // removed — 1 lakh salawat milestone deleted
  return;
}

function seedMiladLeaderboard(){
  ensureMiladMeta();
  if(!meta.miladBoard) meta.miladBoard = [];
  // Fixed showcase places (always top)
  var seeds = [
    { name: 'ha_sena123', total: 96, today: 96, quizScore: 96, quizTotal: 100, at: Date.now(), pinned: 1 },
    { name: 'islamic_post_1704', total: 84, today: 84, quizScore: 84, quizTotal: 100, at: Date.now(), pinned: 2 }
  ];
  seeds.forEach(function(s){
    var found = null;
    for(var i=0;i<meta.miladBoard.length;i++){
      if(meta.miladBoard[i].name === s.name){ found = meta.miladBoard[i]; break; }
    }
    if(found){
      found.total = s.total;
      found.today = s.today;
      found.quizScore = s.quizScore;
      found.quizTotal = s.quizTotal;
      found.pinned = s.pinned;
      found.at = found.at || Date.now();
    } else {
      meta.miladBoard.push(s);
    }
  });
  // Sort: pinned first by pin order, then by total
  meta.miladBoard.sort(function(a,b){
    var pa = a.pinned || 99, pb = b.pinned || 99;
    if(pa !== pb) return pa - pb;
    return (b.total||0) - (a.total||0);
  });
  try{ saveMeta(); }catch(e){}
}

function renderMiladLeaderboard(){
  ensureMiladMeta();
  try{ seedMiladLeaderboard(); }catch(e){}
  var filter = (window.__miladLbFilter || 'all');
  var board = (meta.miladBoard || []).slice();
  var now = Date.now();
  var dayMs = 86400000;
  if(filter === 'daily'){
    board = board.filter(function(e){ return (now - (e.at||0)) < dayMs; });
  } else if(filter === 'weekly'){
    board = board.filter(function(e){ return (now - (e.at||0)) < dayMs * 7; });
  }
  board.sort(function(a,b){
    var pa = a.pinned || 99, pb = b.pinned || 99;
    if(pa !== pb) return pa - pb;
    if(filter === 'daily') return (b.today||0) - (a.today||0);
    return (b.total||0) - (a.total||0);
  });

  var podium = document.getElementById('miladLbPodium');
  var list = document.getElementById('miladLbList');
  var you = document.getElementById('miladLbYou');
  var rankIcons = {1:'icons/rank1.png', 2:'icons/rank2.png', 3:'icons/rank3.png'};

  if(podium){
    var slots = [
      { place: 2, e: board[1] },
      { place: 1, e: board[0] },
      { place: 3, e: board[2] }
    ];
    var ph = '';
    slots.forEach(function(s){
      var name = s.e ? (s.e.name || 'வீரர்') : '—';
      var score;
      if(!s.e) score = '—';
      else if(s.e.quizScore != null) score = (s.e.quizScore||0)+'/'+(s.e.quizTotal||100);
      else score = (filter==='daily' ? (s.e.today||0) : (s.e.total||0));
      var firstCls = s.place === 1 ? ' podium-first' : '';
      ph += '<div class="podium-slot'+firstCls+'">'+
        '<img src="'+rankIcons[s.place]+'" alt="'+s.place+'" class="podium-rank-img">'+
        '<div class="podium-name">'+name+'</div>'+
        '<div class="podium-score">📝 '+score+'</div>'+
      '</div>';
    });
    podium.innerHTML = ph;
  }

  if(list){
    if(!board.length){
      list.innerHTML = '<div style="text-align:center;padding:20px;color:var(--text-dim)">'+_('msg_milad_empty')+'</div>';
    } else {
      var lh = '';
      board.forEach(function(e, i){
        var place = i + 1;
        var score = (e.quizScore != null) ? ((e.quizScore||0)+'/'+(e.quizTotal||100)) : (filter==='daily' ? (e.today||0) : (e.total||0));
        lh += '<div class="plb-row">'+
          '<span class="plb-pos">'+place+'</span>'+
          '<span class="plb-name">'+(e.name||'வீரர்')+'</span>'+
          '<span class="plb-pts">📝 '+score+'</span>'+
        '</div>';
      });
      list.innerHTML = lh;
    }
  }

  if(you){
    var myName = meta.playerName || 'வீரர்';
    var myPlace = '—';
    for(var i=0;i<board.length;i++){
      if(board[i].name === myName){ myPlace = i+1; break; }
    }
    var myEntry = null;
    for(var j=0;j<(meta.miladBoard||[]).length;j++){
      if(meta.miladBoard[j].name === myName){ myEntry = meta.miladBoard[j]; break; }
    }
    var myScore = myEntry ? (myEntry.total||0) : 0;
    var metaLine = myEntry
      ? ('கேள்வி & பதில் · '+(myEntry.quizScore||myEntry.total||0)+'/'+(myEntry.quizTotal||100))
      : '100 கேள்வி முடித்தால் இங்கே சேரும்';
    you.innerHTML =
      '<span class="plb-pos">#'+myPlace+'</span>'+
      '<div class="plb-you-avatar">'+(myName.charAt(0)||'வ')+'</div>'+
      '<div class="plb-you-info">'+
        '<div class="plb-you-name">'+myName+'</div>'+
        '<div class="plb-you-meta">'+metaLine+'</div>'+
      '</div>'+
      '<span class="plb-pts">📝 '+myScore+'</span>';
  }
}
function initMilad(){
  ensureMiladMeta();
  try{ seedMiladLeaderboard(); }catch(e){}
  window.__miladLbFilter = window.__miladLbFilter || 'all';
  var filters = document.getElementById('miladLbFilters');
  if(filters){
    filters.querySelectorAll('.plb-filter').forEach(function(btn){
      btn.classList.toggle('active', btn.getAttribute('data-filter') === window.__miladLbFilter);
      btn.onclick = function(){
        window.__miladLbFilter = btn.getAttribute('data-filter');
        filters.querySelectorAll('.plb-filter').forEach(function(b){ b.classList.toggle('active', b===btn); });
        renderMiladLeaderboard();
      };
    });
  }
  renderMiladLeaderboard();
  var btn = document.getElementById('miladBackBtn');
  if(btn){
    btn.onclick = function(){
      if(typeof switchScreen === 'function') switchScreen('screenSelect');
    };
  }
}

function initSalawat(){
  ensureMiladMeta();
  var count = meta.milad.total || 0;
  try{
    var legacy = parseInt(localStorage.getItem('qg_salawat_count')||'0',10)||0;
    if(legacy > count){
      meta.milad.total = legacy;
      count = legacy;
      saveMeta();
    }
  }catch(e){}

  var countEl = document.getElementById('salawatCount');
  var arEl = document.getElementById('salawatMainAr');
  var types = document.getElementById('salawatTypes');
  if(countEl) countEl.textContent = String(count);

  if(types){
    var activeI = 0;
    try{
      var act = types.querySelector('.salawat-type-card.active');
      if(act) activeI = parseInt(act.getAttribute('data-i'),10)||0;
    }catch(e){}
    types.innerHTML = SALAWAT_TYPES.map(function(t, i){
      return '<button type="button" class="salawat-type-card'+(i===activeI?' active':'')+'" data-i="'+i+'">'+
        '<div class="salawat-type-num">'+t.n+'</div>'+
        '<div class="salawat-type-name">'+(isEnLang()?(t.nameEn||t.name):t.name)+'</div>'+
        '<div class="salawat-type-ar">'+t.ar+'</div></button>';
    }).join('');
    if(!types.dataset.bound){
      types.dataset.bound = '1';
      types.onclick = function(ev){
        var card = ev.target.closest('.salawat-type-card');
        if(!card) return;
        var i = parseInt(card.getAttribute('data-i'),10);
        var t = SALAWAT_TYPES[i];
        if(!t) return;
        types.querySelectorAll('.salawat-type-card').forEach(function(c){ c.classList.remove('active'); });
        card.classList.add('active');
        if(arEl) arEl.textContent = t.ar;
        var sub = document.getElementById('salawatMainTa');
        if(sub) sub.textContent = isEnLang() ? (t.nameEn || t.name) : (t.ta || t.name);
        try{ if(typeof AudioFX!=='undefined'&&AudioFX.playClick) AudioFX.playClick(); }catch(e){}
      };
    }
  }

  var tap = document.getElementById('salawatTapBtn');
  if(tap && !tap.dataset.bound){
    tap.dataset.bound = '1';
    tap.onclick = function(){
      addMiladSalawat(1);
      count = meta.milad.total;
      if(countEl) countEl.textContent = String(count);
      try{ if(typeof AudioFX!=='undefined'&&AudioFX.playTick) AudioFX.playTick(); else if(AudioFX&&AudioFX.playClick) AudioFX.playClick(); }catch(e){}
      tap.style.transform = 'scale(0.97)';
      setTimeout(function(){ tap.style.transform = ''; }, 120);
      var h = document.getElementById('miladSalawatHint');
      if(h) h.innerHTML = '💚 ஸலவாத்: இன்று <b>'+(meta.milad.today||0)+'</b> · மொத்தம் <b>'+(meta.milad.total||0)+'</b>';
    };
  }
  var reset = document.getElementById('salawatResetBtn');
  if(reset && !reset.dataset.bound){
    reset.dataset.bound = '1';
    reset.onclick = function(){
      if(!confirm(_('msg_reset_salawat'))) return;
      ensureMiladMeta();
      meta.milad.total = 0;
      meta.milad.today = 0;
      saveMeta();
      try{ localStorage.setItem('qg_salawat_count', '0'); }catch(e){}
      count = 0;
      if(countEl) countEl.textContent = '0';
    };
  }
  var back = document.getElementById('salawatBackBtn');
  if(back) back.onclick = function(){ if(typeof switchScreen==='function') switchScreen('screenSelect'); };

  var card = document.querySelector('.salawat-counter-card');
  if(card && !document.getElementById('miladSalawatHint')){
    var hint = document.createElement('div');
    hint.id = 'miladSalawatHint';
    hint.style.cssText = 'text-align:center;font-size:11px;color:#ffd54f;margin-top:8px;font-weight:700';
    hint.innerHTML = '💚 ஸலவாத்: இன்று <b>'+(meta.milad.today||0)+'</b> · மொத்தம் <b>'+(meta.milad.total||0)+'</b>';
    card.appendChild(hint);
  } else {
    var h2 = document.getElementById('miladSalawatHint');
    if(h2) h2.innerHTML = '💚 ஸலவாத்: இன்று <b>'+(meta.milad.today||0)+'</b> · மொத்தம் <b>'+(meta.milad.total||0)+'</b>';
  }
  var goBtn = document.getElementById('goMiladFromSalawat');
  if(goBtn) goBtn.onclick = function(){ if(typeof switchScreen==='function') switchScreen('screenMilad'); };
}

// hook switchScreen for Salawat + Milad
(function(){
  var tries = 0;
  function hook(){
    if(typeof switchScreen !== 'function'){
      if(tries++ < 20) setTimeout(hook, 100);
      return;
    }
    if(switchScreen.__salawatHooked) return;
    var orig = switchScreen;
    switchScreen = function(id){
      var r = orig.apply(this, arguments);
      if(id === 'screenSalawat') try{ initSalawat(); }catch(e){}
      if(id === 'screenQuiz') try{ initQuiz(); }catch(e){}
      if(id === 'screenMilad') try{ initMilad(); }catch(e){}
      try{ if(typeof I18N!=='undefined') I18N.apply(); }catch(e){}
      return r;
    };
    switchScreen.__salawatHooked = true;
    if(orig.__sfxWrapped) switchScreen.__sfxWrapped = true;
    if(orig.__gameHistHooked) switchScreen.__gameHistHooked = true;
  }
  hook();
})();


function isEnLang(){ try{ return typeof I18N!=='undefined' && I18N.lang==='en'; }catch(e){ return false; } }
function _(key){
  try{
    if(typeof I18N !== 'undefined' && I18N.t) return I18N.t(key);
  }catch(e){}
  return key;
}

/* ===== i18n · Tamil / English ===== */

/* ===== Nabi ﷺ Quiz (100 MCQ) ===== */
var quizState = { list: [], i: 0, score: 0, answered: false };

function shuffle(arr){
  var a = arr.slice();
  for(var i=a.length-1;i>0;i--){
    var j = Math.floor(Math.random()*(i+1));
    var tmp=a[i]; a[i]=a[j]; a[j]=tmp;
  }
  return a;
}


function isQuizLocked(){
  try{
    if(typeof meta!=='undefined' && meta.quizOnceDone) return true;
    if(localStorage.getItem('qg_quiz_once_done')==='1') return true;
  }catch(e){}
  return false;
}
function lockQuizOnce(score, total){
  try{
    if(total < 100) return;
    if(typeof meta!=='undefined'){
      meta.quizOnceDone = true;
      meta.quizOnceScore = score;
      meta.quizOnceTotal = total;
      meta.quizOnceAt = Date.now();
      if(typeof saveMeta==='function') saveMeta();
    }
    localStorage.setItem('qg_quiz_once_done', '1');
    localStorage.setItem('qg_quiz_once_score', String(score||0));
    localStorage.setItem('qg_quiz_once_total', String(total||100));
  }catch(e){}
}
function applyQuizLockUI(){
  var locked = isQuizLocked();
  var start = document.getElementById('quizStartBtn');
  var retry = document.getElementById('quizRetryBtn');
  var homeCard = document.querySelector('.quiz-intro-card');
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var score = 0, total = 100;
  try{
    if(typeof meta!=='undefined' && meta.quizOnceScore!=null){ score = meta.quizOnceScore; total = meta.quizOnceTotal||100; }
    else {
      score = parseInt(localStorage.getItem('qg_quiz_once_score')||'0',10)||0;
      total = parseInt(localStorage.getItem('qg_quiz_once_total')||'100',10)||100;
    }
  }catch(e){}

  var lockNote = document.getElementById('quizLockNote');
  if(!lockNote && homeCard){
    lockNote = document.createElement('div');
    lockNote.id = 'quizLockNote';
    lockNote.style.cssText = 'margin-top:10px;padding:10px 12px;border-radius:12px;border:1px solid rgba(248,113,113,.45);background:rgba(127,29,29,.35);color:#fecaca;font-size:12px;font-weight:700;line-height:1.45;text-align:center';
    homeCard.appendChild(lockNote);
  }

  if(locked){
    if(start){
      start.disabled = true;
      start.textContent = isEn ? '🔒 Locked — Already played' : '🔒 பூட்டப்பட்டது — ஏற்கனவே விளையாடியுள்ளீர்கள்';
      start.style.opacity = '0.55';
      start.style.cursor = 'not-allowed';
      start.onclick = function(e){
        if(e) e.preventDefault();
        alert(isEn ? 'You can play this 100-question quiz only once.' : '100 கேள்வி வினாடி வினாவை ஒரு முறை மட்டுமே விளையாட முடியும்.');
      };
    }
    if(retry){
      retry.disabled = true;
      retry.style.display = 'none';
    }
    if(lockNote){
      lockNote.style.display = 'block';
      lockNote.innerHTML = isEn
        ? ('🔒 One-time quiz completed<br>Your score: <b>'+score+'/'+total+'</b><br>Cannot play again.')
        : ('🔒 ஒரு முறை மட்டும் — முடித்துவிட்டீர்கள்<br>உங்கள் மதிப்பெண்: <b>'+score+'/'+total+'</b><br>மீண்டும் விளையாட முடியாது.');
    }
  } else {
    if(start){
      start.disabled = false;
      start.style.opacity = '';
      start.style.cursor = '';
      // text restored by i18n if needed
      if(!start.textContent || start.textContent.indexOf('Locked')>=0 || start.textContent.indexOf('பூட்ட')>=0){
        start.textContent = isEn ? 'Start' : 'தொடங்கு / Start';
      }
    }
    if(retry){ retry.disabled = false; retry.style.display = ''; }
    if(lockNote) lockNote.style.display = 'none';
  }
}


function startQuiz(limit){
  if(isQuizLocked()){
    var isEn = (typeof isEnLang==='function' && isEnLang());
    alert(isEn ? 'You can play this 100-question quiz only once. Already completed.' : '100 கேள்வி வினாடி வினாவை ஒரு முறை மட்டுமே விளையாட முடியும். ஏற்கனவே முடித்துவிட்டீர்கள்.');
    try{ applyQuizLockUI(); }catch(e){}
    return;
  }
  var all = (typeof NABI_QUIZ !== 'undefined' && NABI_QUIZ) ? NABI_QUIZ : [];
  if(!all.length){ alert('Quiz data missing'); return; }
  var list = shuffle(all);
  if(limit && limit < list.length) list = list.slice(0, limit);
  quizState = { list: list, i: 0, score: 0, answered: false };
  document.getElementById('quizHome').style.display = 'none';
  document.getElementById('quizResult').style.display = 'none';
  document.getElementById('quizPlay').style.display = 'block';
  document.getElementById('quizTotal').textContent = String(list.length);
  document.getElementById('quizScore').textContent = '0';
  showQuizQuestion();
}

function showQuizQuestion(){
  var st = quizState;
  var q = st.list[st.i];
  if(!q){ endQuiz(); return; }
  st.answered = false;
  document.getElementById('quizNum').textContent = String(st.i+1);
  document.getElementById('quizScore').textContent = String(st.score);
  var pct = ((st.i) / st.list.length) * 100;
  document.getElementById('quizProgressFill').style.width = pct + '%';
  document.getElementById('quizQuestion').textContent = q.q;
  document.getElementById('quizFeedback').style.display = 'none';
  document.getElementById('quizNextBtn').style.display = 'none';
  var box = document.getElementById('quizOpts');
  var labels = ['A','B','C','D'];
  box.innerHTML = q.opts.map(function(opt, idx){
    return '<button type="button" class="quiz-opt" data-i="'+idx+'"><span class="quiz-opt-letter">'+labels[idx]+'</span><span class="quiz-opt-text">'+opt+'</span></button>';
  }).join('');
  box.querySelectorAll('.quiz-opt').forEach(function(btn){
    btn.onclick = function(){
      if(st.answered) return;
      st.answered = true;
      var pick = parseInt(btn.getAttribute('data-i'),10);
      var correct = q.ans;
      box.querySelectorAll('.quiz-opt').forEach(function(b){
        var bi = parseInt(b.getAttribute('data-i'),10);
        b.disabled = true;
        if(bi === correct) b.classList.add('correct');
        if(bi === pick && pick !== correct) b.classList.add('wrong');
      });
      var fb = document.getElementById('quizFeedback');
      var isEn = (typeof isEnLang==='function' && isEnLang());
      if(pick === correct){
        st.score++;
        fb.textContent = isEn ? '✅ Correct!' : '✅ சரி!';
        fb.className = 'quiz-feedback ok';
      } else {
        fb.textContent = (isEn ? '❌ Wrong. Answer: ' : '❌ தவறு. பதில்: ') + labels[correct] + ') ' + q.opts[correct];
        fb.className = 'quiz-feedback bad';
      }
      fb.style.display = 'block';
      document.getElementById('quizScore').textContent = String(st.score);
      document.getElementById('quizNextBtn').style.display = 'block';
      try{ if(typeof AudioFX!=='undefined'){ if(pick===correct && AudioFX.playSuccess) AudioFX.playSuccess(); else if(AudioFX.playClick) AudioFX.playClick(); } }catch(e){}
    };
  });
}

function ensureQuizMeta(){
  if(typeof meta === 'undefined') return;
  if(!meta.quizBoard) meta.quizBoard = [];
}
function saveQuizScore(score, total){
  try{
    ensureQuizMeta();
    var name = (meta.playerName || localStorage.getItem('qg_player_name') || 'வீரர்');
    var pct = total ? Math.round(score/total*100) : 0;
    var entry = { name: name, score: score, total: total, pct: pct, perfect: (score===total && total>=100), at: Date.now() };
    // keep best score per name for full 100-quiz
    var found = null;
    for(var i=0;i<meta.quizBoard.length;i++){
      if(meta.quizBoard[i].name === name && meta.quizBoard[i].total >= 100){ found = meta.quizBoard[i]; break; }
    }
    if(total >= 100){
      if(found){
        if(score > (found.score||0)){ found.score=score; found.pct=pct; found.perfect=(score===total); found.at=Date.now(); found.total=total; }
      } else {
        meta.quizBoard.push(entry);
      }
    } else {
      meta.quizBoard.push(entry);
    }
    // trim
    if(meta.quizBoard.length > 200) meta.quizBoard = meta.quizBoard.slice(-200);
    if(typeof saveMeta==='function') saveMeta();
  }catch(e){}
}
function renderQuizLeaderboard(){
  var box = document.getElementById('quizLeaderboard');
  if(!box) return;
  ensureQuizMeta();
  var isEn = (typeof isEnLang==='function' && isEnLang());
  // prefer full 100-question runs, sorted by score desc
  var board = (meta.quizBoard||[]).filter(function(e){ return (e.total||0) >= 100; });
  board.sort(function(a,b){ return (b.score||0)-(a.score||0) || (b.at||0)-(a.at||0); });
  // unique by name keep best
  var seen = {}, uniq = [];
  board.forEach(function(e){
    if(seen[e.name]) return;
    seen[e.name]=1;
    uniq.push(e);
  });
  board = uniq.slice(0, 20);
  if(!board.length){
    box.innerHTML = '<p class="quiz-lb-empty">'+(isEn?'No scores yet. Complete 100 questions!':'இன்னும் மதிப்பெண் இல்லை. 100 கேள்வி முடியுங்கள்!')+'</p>';
    return;
  }
  var medals = ['🥇','🥈','🥉'];
  var h = '<div class="quiz-lb-title">🏆 '+(isEn?'Quiz Leaderboard':'கேள்வி தரவரிசை')+'</div>';
  h += '<div class="quiz-lb-list">';
  board.forEach(function(e,i){
    var med = medals[i] || ('#'+(i+1));
    var star = e.perfect ? ' ✨' : '';
    h += '<div class="quiz-lb-row'+(e.perfect?' perfect':'')+'"><span class="quiz-lb-rank">'+med+'</span><span class="quiz-lb-name">'+e.name+star+'</span><span class="quiz-lb-score">'+e.score+'/'+e.total+'</span></div>';
  });
  h += '</div>';
  h += '<p class="quiz-lb-note">'+(isEn?'✨ = 100/100 correct · First join Telegram channel, then share your result there':'✨ = 100/100 சரி · முதலில் Telegram சேனலில் join செய்து, பிறகு share செய்யுங்கள்')+'</p>';
  box.innerHTML = h;
}
function buildQuizShareUrl(playerName, score, total){
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var perfect = (score === total && total >= 100);
  var msg;
  if(isEn){
    msg = '🌙 Alhamdulillah!\n\n' +
      (perfect
        ? 'I scored PERFECT '+score+'/'+total+' on the Prophet ﷺ Seerah Quiz!\n\n'
        : 'I completed the Prophet ﷺ Seerah Quiz ('+total+' questions)!\n\n') +
      '👤 Name: ' + (playerName || 'Player') + '\n' +
      '✅ Score: ' + score + ' / ' + total + '\n' +
      '📖 Quran Garden · Q & A\n\n' +
      'Channel: https://t.me/islamic_post_1704';
  } else {
    msg = '🌙 அல்ஹம்துலில்லாஹ்!\n\n' +
      (perfect
        ? 'நான் குர்ஆன் தோட்டம் — கேள்வி & பதில்-ல் '+score+'/'+total+' முழு மதிப்பெண் பெற்றேன்!\n\n'
        : 'நான் குர்ஆன் தோட்டம் — கேள்வி & பதில் '+total+' கேள்விகளை முடித்தேன்!\n\n') +
      '👤 பெயர்: ' + (playerName || 'வீரர்') + '\n' +
      '✅ மதிப்பெண்: ' + score + ' / ' + total + '\n' +
      '📖 Quran Garden · கேள்வி & பதில்\n\n' +
      'சேனல்: https://t.me/islamic_post_1704';
  }
  return 'https://t.me/share/url?url=' + encodeURIComponent('https://t.me/islamic_post_1704') +
    '&text=' + encodeURIComponent(msg);
}

function openTelegramShare(shareUrl){
  // Mobile browsers often block window.open from timeouts — try multiple ways
  try {
    var a = document.createElement('a');
    a.href = shareUrl;
    a.target = '_blank';
    a.rel = 'noopener';
    document.body.appendChild(a);
    a.click();
    setTimeout(function(){ try{ a.remove(); }catch(e){} }, 1000);
  } catch(e1) {
    try { window.open(shareUrl, '_blank'); } catch(e2) {
      try { window.location.href = shareUrl; } catch(e3) {}
    }
  }
}

function triggerQuiz100Telegram(playerName, score, total){
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var perfect = (score === total && total >= 100);
  var shareUrl = buildQuizShareUrl(playerName, score, total);

  var old = document.getElementById('quiz100Overlay');
  if(old) old.remove();
  var ov = document.createElement('div');
  ov.id = 'quiz100Overlay';
  ov.style.cssText = 'position:fixed;inset:0;z-index:99999;background:rgba(0,0,0,.75);display:flex;align-items:center;justify-content:center;padding:16px';
  ov.innerHTML =
    '<div style="background:linear-gradient(160deg,#2a1848,#1a3050);border:2px solid rgba(212,175,55,.55);border-radius:20px;padding:22px 18px;max-width:340px;width:100%;text-align:center;box-shadow:0 12px 40px rgba(0,0,0,.5)">'+
      '<div style="font-size:42px;margin-bottom:6px">'+(perfect?'🏆':'🎉')+'</div>'+
      '<div style="font-size:17px;font-weight:800;color:#ffd54f;margin-bottom:8px">'+(perfect?(isEn?'100/100 Perfect!':'100/100 முழு மதிப்பெண்!'):(isEn?'Quiz Complete!':'கேள்வி முடிந்தது!'))+'</div>'+
      '<div style="font-size:13px;color:#fff8e8;line-height:1.55;margin-bottom:6px">'+(playerName||'')+' · '+score+'/'+total+'</div>'+
      '<div style="font-size:12px;color:#c4b5fd;line-height:1.5;margin-bottom:14px">'+(isEn?'📌 Note: First join our Telegram channel. When asked to share, please share in our channel.':'📌 குறிப்பு: முதலில் Telegram சேனலில் join செய்யுங்கள். Share செய்யச் சொன்னால் என் சேனலில் share செய்யுங்கள்.')+'</div>'+
      '<a id="quiz100TgBtn" href="'+shareUrl+'" target="_blank" rel="noopener" style="display:block;padding:14px;border-radius:14px;background:linear-gradient(180deg,#2AABEE,#229ED9);color:#fff;font-weight:800;text-decoration:none;margin-bottom:8px">✈️ Telegram-ல் பகிர் / Share</a>'+
      '<button type="button" id="quiz100Close" style="width:100%;padding:10px;border-radius:12px;border:1px solid rgba(255,255,255,.2);background:rgba(255,255,255,.08);color:#e2e8f0;font-weight:700;cursor:pointer">'+(isEn?'Close':'மூடு')+'</button>'+
    '</div>';
  document.body.appendChild(ov);

  // Auto-open once (user gesture chain may still allow on some browsers)
  setTimeout(function(){ openTelegramShare(shareUrl); }, 400);

  var tgBtn = document.getElementById('quiz100TgBtn');
  if(tgBtn){
    tgBtn.addEventListener('click', function(e){
      // let default <a> work; also force open
      openTelegramShare(shareUrl);
    });
  }
  var closeBtn = document.getElementById('quiz100Close');
  if(closeBtn) closeBtn.onclick = function(){ ov.remove(); };
  ov.onclick = function(e){ if(e.target === ov) ov.remove(); };
}

function endQuiz(){
  document.getElementById('quizPlay').style.display = 'none';
  document.getElementById('quizResult').style.display = 'block';
  var total = quizState.list.length;
  var score = quizState.score;
  document.getElementById('quizFinalScore').textContent = String(score);
  document.getElementById('quizFinalTotal').textContent = String(total);
  var pct = total ? Math.round(score/total*100) : 0;
  document.getElementById('quizProgressFill').style.width = '100%';
  var isEn = (typeof isEnLang==='function' && isEnLang());
  var msg = '';
  if(score === total && total >= 100) msg = isEn ? 'Perfect 100/100! MashaAllah 🌟' : 'முழு 100/100! மாஷாஅல்லாஹ் 🌟';
  else if(pct >= 90) msg = isEn ? 'Excellent! MashaAllah 🌟' : 'அருமை! மாஷாஅல்லாஹ் 🌟';
  else if(pct >= 70) msg = isEn ? 'Very good! Keep learning 💪' : 'மிக நன்று! தொடர்ந்து கற்றுக்கொள்ளுங்கள் 💪';
  else if(pct >= 50) msg = isEn ? 'Good effort. Review and try again.' : 'நல்ல முயற்சி. மீண்டும் முயலுங்கள்.';
  else msg = isEn ? 'Keep studying the Seerah. Try again!' : 'சீராவைப் படியுங்கள். மீண்டும் முயலுங்கள்!';
  document.getElementById('quizResultMsg').textContent = msg + ' ('+pct+'%)';

  saveQuizScore(score, total);
  renderQuizLeaderboard();
  if(total >= 100){
    try{ lockQuizOnce(score, total); }catch(e){}
    try{ addQuizToMiladBoard(score, total); }catch(e){}
  }
  try{ applyQuizLockUI(); }catch(e){}

  var name = (typeof meta!=='undefined' && meta.playerName) ? meta.playerName : (localStorage.getItem('qg_player_name')||'வீரர்');

  // Result screen share button (always for full 100 quiz)
  var shareBtn = document.getElementById('quizShareTgBtn');
  if(shareBtn){
    if(total >= 100){
      shareBtn.style.display = 'block';
      var su = buildQuizShareUrl(name, score, total);
      shareBtn.href = su;
      shareBtn.onclick = function(e){ e.preventDefault(); openTelegramShare(su); };
    } else {
      shareBtn.style.display = 'none';
    }
  }

  // 10+ question run → Telegram popup (easy test with 10-question mode)
  if(total >= 100){
    try{ triggerQuiz100Telegram(name, score, total); }catch(e){ console.warn('tg', e); }
  }
}


function initQuiz(){
  var start = document.getElementById('quizStartBtn');
  var next = document.getElementById('quizNextBtn');
  var retry = document.getElementById('quizRetryBtn');
  var home = document.getElementById('quizHomeBtn');
  var back = document.getElementById('quizBackBtn');
  if(start && !start._bound){
    start._bound = true;
    start.onclick = function(){
      if(isQuizLocked()){ applyQuizLockUI(); alert((typeof isEnLang==='function' && isEnLang()) ? 'Already played once.' : 'ஏற்கனவே ஒரு முறை விளையாடியுள்ளீர்கள்.'); return; }
      startQuiz(0);
    };
  }
  if(next && !next._bound){
    next._bound = true;
    next.onclick = function(){
      quizState.i++;
      if(quizState.i >= quizState.list.length) endQuiz();
      else showQuizQuestion();
    };
  }
  if(retry && !retry._bound){
    retry._bound = true;
    retry.onclick = function(){
      if(isQuizLocked()){ applyQuizLockUI(); alert((typeof isEnLang==='function' && isEnLang()) ? 'Already played once. Locked.' : 'ஏற்கனவே விளையாடியுள்ளீர்கள். பூட்டப்பட்டது.'); return; }
      startQuiz(0);
    };
  }
  if(home && !home._bound){
    home._bound = true;
    home.onclick = function(){
      document.getElementById('quizResult').style.display = 'none';
      document.getElementById('quizPlay').style.display = 'none';
      document.getElementById('quizHome').style.display = 'block';
      try{ renderQuizLeaderboard(); }catch(e){}
    };
  }
  if(back && !back._bound){
    back._bound = true;
    back.onclick = function(){
      if(typeof switchScreen==='function') switchScreen('screenSelect');
    };
  }
  try{ renderQuizLeaderboard(); }catch(e){}
  try{ applyQuizLockUI(); }catch(e){}
}

var I18N = {
  lang: 'ta',
  dict: {
    ta: {
      nav_garden: 'தோட்டம்',
      nav_milad: 'மீலாது நிகழ்வு',
      nav_surahs: 'சூராக்கள்',
      nav_juz: 'ஜுஸ்வு',
      nav_games: 'விளையாட்டு',
      nav_badges: 'சாதனைகள்',
      nav_dhikr: 'திக்ர்',
      nav_rabbana: 'ரப்பனா துஆ',
      nav_nabi_dua: 'நபி துஆக்கள்',
      nav_salawat: 'நபி மீது ஸலவாத்',
      nav_prayer: 'தொழுகை நேரம்',
      nav_hadees: 'ஹதீஸ்',
      nav_font: 'எழுத்து வடிவம்',
      nav_themes: 'தீம்கள்',
      nav_about: 'என்னை பற்றி',
      nav_sound: 'சப்தம்',
      nav_lang: 'Language · மொழி',
      bn_home: 'முகப்பு',
      bn_settings: 'அமைப்புகள்',
      home_daily: '🔥 தினசரி சவால் 🔥',
      title_games: 'விளையாட்டுகள்',
      title_badges: '🏆 சாதனைகள்',
      title_leaderboard: '🏆 தரவரிசை',
      title_themes: '🎨 தீம்கள்',
      title_font: '✍️ எழுத்து வடிவம்',
      title_juz: '30 ஜுஸ்வு',
      title_prayer: '🕌 தொழுகை நேரம்',
      title_dhikr: 'திக்ர்',
      title_rabbana: '🤲 40 ரப்பனா துஆ',
      title_hadees: '📖 ஸஹீஹ் புகாரி',
      hadees_sub: 'முழு ஸஹீஹ் புகாரி · 97 புத்தகங்கள் · 7500+ ஹதீஸ்',
      title_salawat: 'ﷺ நபி மீது ஸலவாத் ஓதுவோம்',
      salawat_sub: 'ஸலவாத்தின் வகைகள் · சிறப்புகள் · எண்ணிக்கை',
      salawat_tap: 'ஸலவாத் ஓது (தொடுங்கள்)',
      btn_reset: 'மீட்டமை',
      btn_back_garden: '⬅ தோட்டம்',
      title_milad: '🌙 மீலாது நிகழ்வு',
      title_about: '💚 என்னை பற்றி',

      msg_daily_goal: '🎯 இன்றைய இலக்கு! +25 coins',
      msg_surah_load_fail: 'சூரா ஏற்ற முடியவில்லை. Internet தேவை.',
      msg_audio_fail: 'Audio load ஆகலை (Internet தேவை)',
      msg_no_audio: 'Audio இல்லை',
      msg_no_audio_surah: 'Audio இல்லை (surahNum தேவை)',
      msg_confirm_reset: 'ரீசெட் செய்யவா?',
      msg_import_ok: 'Import வெற்றி!',
      msg_bad_file: 'தவறான file',
      msg_copied: 'Copy ஆனது!',
      msg_order_wrong: '❌ வரிசை தவறு — மீண்டும் முயற்சிக்கவும்',
      msg_enter_name: 'உங்கள் பெயர் (Leaderboard-க்கு):',
      msg_copy_num: 'Number copy பண்ணுங்க:',
      msg_reset_salawat: 'எண்ணிக்கையை மீட்டமைக்கவா? (மீலாது லீடர்போர்டும் ரீசெட் ஆகும்)',
      msg_pause: '⏸ நிறுத்து',
      msg_listen_ayah: '🔊 ஆயத்து கேளுங்கள்',
      msg_listen_surah: '🔊 சூரா முழுவதும் கேளுங்கள்',
      msg_tap_surah_listen: 'சூராவைத் தொட்டுக் கேளுங்கள்',
      msg_juz_audio_title: '🎧 30 ஜுஸ்வு · ஆடியோ',
      msg_pick_juz: 'ஜுஸைத் தேர்ந்தெடுக்கவும் (1-30)',
      msg_fill_blank: 'காலியிடத்தை நிரப்புங்கள்',
      msg_pick_ayah_meaning: 'பொருளுக்கு ஏற்ற ஆயத்தைத் தேர்ந்தெடுக்கவும்',
      msg_level_done: '🎉 Level முடிந்தது! தொடர Next Level-ஐ அழுத்தவும்',
      msg_copied_short: '✅ Copy ஆனது',
      msg_memory_title: '🃏 Memory · அஸ்மாஉல் ஹுஸ்னா',
      msg_check: '✅ சரிபார்',
      msg_prayers_done: 'இன்றைய தொழுகைகள் முடிந்தது',
      msg_loading_time: 'நேரம் ஏற்றுகிறது…',
      msg_time_fail: 'நேரம் கிடைக்கவில்லை (இணையம் தேவை)',
      msg_no_geo: 'இந்த சாதனத்தில் இடம் ஆதரவு இல்லை',
      msg_finding_loc: 'இடம் தேடுகிறது…',
      msg_loc_denied: 'இடம் கிடைக்கவில்லை — அனுமதி கொடுங்கள்',
      msg_juz_list: '⬅ ஜுஸ்வு பட்டியல்',
      msg_juz_open_fail: 'ஜுஸ் திறக்க முடியவில்லை',
      msg_juz_ayat_fail: 'ஜுஸ் ஆயத்துகள் ஏற்ற முடியவில்லை (Internet தேவை)',
      msg_all_juz: 'எல்லா ஜுஸ்வு',
      msg_stopped: 'நிறுத்தப்பட்டது',
      msg_not_started: 'தொடங்கவில்லை',
      msg_chrome_needed: 'Chrome தேவை · அல்லது தேடல் Mode பயன்படுத்துங்கள்',
      msg_no_surah_data: 'சூரா data இல்லை — முதலில் ஒரு சூரா load செய்யுங்கள்',
      msg_listening: '🔴 கேட்கிறது — ஓதுங்கள்… நின்றால் நிற்கும்',
      msg_paused_silence: '⏹ நின்றது (அமைதி) · மீண்டும் 🎤 அழுத்தித் தொடரலாம்',
      msg_conn_ended: '⏹ இணைப்பு முடிந்தது',
      msg_press_mic: '🎤 அழுத்தி ஓதுங்கள் · நின்றால் தானே நிற்கும்',
      msg_prev: '◀ முன்',
      msg_next: 'பின் ▶',
      msg_player: 'வீரர்',
      msg_finish_prev_level: 'முதலில் Level {n}-இல் உள்ள {c} சூராக்களை முடிக்கவும்!',
      msg_juz_no_data: 'ஜுஸ் {j} தரவு இல்லை',
      msg_milad_empty: '🌙 மீலாது ஸலவாத் இன்னும் தொடங்கவில்லை<br><small>நபி மீது ஸலவாத் → ஓதி எண்ணுங்கள்!</small>',
      msg_lb_empty: 'இன்னும் யாரும் இந்த Level-ஐ முடிக்கவில்லை<br><small>நீங்களே முதல் இடம்! 🚀</small>',

      app_title: 'குர்ஆன் தோட்டம்',
      app_title_h1: '🌸 குர்ஆன் தோட்டம் 🌸',
      loading: 'ஏற்றுகிறது…',
      levels_label: '🎮 Levels (10 சூரா / Level)',
      btn_name: '👤 பெயர்',
      search_surah: 'சூரா தேடுங்கள்...',
      btn_gardens: '⬅ தோட்டங்கள்',
      btn_reset_full: '🔄 ரீசெட்',
      daily_goal_label: 'இன்றைய இலக்கு',
      done_label: 'முடிந்தது',
      surah_complete: '🎉 சூரா முடிந்தது!',
      btn_quit: '✖ வெளியேறு',
      plb_who: 'யார் முன்னிலையில்?',
      badges_title: '🎖️ பதக்கங்கள்',
      btn_back: '⬅ பின்',
      theme_section: '🎨 தீம்',
      search_dua: 'துஆ / பொருள் தேடுங்கள்...',
      search_nabi_dua: 'துஆ / வகை தேடுங்கள்...',
      you_label: 'நீங்கள்',
      btn_close_x: '✖ மூடு',
      btn_tajweed: '🎨 தஜ்வீத்',
      btn_meaning: 'பொருள்',
      pick_ayah: 'ஆயத்தைத் தேர்ந்தெடுக்கவும்',
      dhikr_daily: 'அன்றாட திக்ர்கள்',
      dhikr_salah: 'தொழுகைக்குப் பின் திக்ர்',
      title_nabi_dua: '🌙 நபி துஆக்கள்',
      font_script: 'குர்ஆன் எழுத்து முறை',
      font_desc: 'தெற்காசிய · தாஜ் முஷாஃப்',
      madinah_desc: 'மதீனா · King Fahd',
      themes_hint: 'நிறம் மட்டும் · மரபு UI மாறாது',
      prayer_hint: 'தமிழ்நாடு · மாநிலங்களின் தலைநகரம் / பெரிய நகரம்',
      madhab_label: 'மத்ஹப்',
      dhikr_salah_btn: '🕌 தொழுகை பின்',
      lbl_surah: 'சூரா',
      lbl_ayah: 'ஆயத்து',
      lbl_ayahs: 'ஆயத்துகள்',
      lbl_locked: 'பூட்டப்பட்டது',
      msg_done_short: 'முடிந்தது',
      lbl_loading: 'ஏற்றுகிறது',
      msg_next_ayah: 'அடுத்த ஆயத்தைத் தேர்ந்தெடுக்கவும்',
      msg_which_surah: 'இந்த ஆயத்து எந்த சூரா?',
      msg_not_enough_ayahs: 'போதிய ஆயத்துகள் இல்லை',
      msg_ayah_correct: 'இந்த ஆயத்து இந்த சூராவிற்கு சரியானதா?',
      dhikr_sub: 'தொட்டு எண்ணுங்கள் · அல்லாஹ்வை நினைவுகூருங்கள்',
      dhikr_hint: 'மேலே உள்ள திக்ரைத் தேர்ந்தெடுங்கள் · பெட்டியைத் தொட்டு எண்ணுங்கள்',
      btn_reset_dhikr: '↺ மீள்',
      dhikr_sequence: 'வரிசை: சுப்ஹானல்லாஹ் 33 → அல்ஹம்து 33 → அல்லாஹு அக்பர் 33 → தஹ்லீல் (100)',
      rabbana_sub: 'குர்ஆனில் வரும் ரப்பனா துஆக்கள் · தமிழ் பொருள்',
      nabi_sub: 'நபி (ஸல்) கற்றுத்தந்த மஸ்னூன் துஆக்கள் · தமிழ் பொருள்',
      juz_sub: 'ஜுஸ் மட்டும் · ஆயத்து வரம்பு · சூரா / ஆடியோ menu அல்ல',
      nav_quiz: 'கேள்வி & பதில்',
      title_quiz: '🕌 கேள்வி & பதில்',
      quiz_sub: 'நபி முஹம்மது ﷺ — 100 கேள்விகள்',
      quiz_intro: 'நபி ﷺ அவர்களைப் பற்றிய 100 Multiple Choice கேள்விகள். ஒவ்வொன்றிலும் 4 விருப்பங்கள் — சரியானதைத் தேர்ந்தெடுங்கள்.',
      quiz_start: 'தொடங்கு',
      quiz_start10: '10 கேள்வி மட்டும்',
      quiz_score: 'மதிப்பெண்',
      quiz_next: 'அடுத்து →',
      quiz_done: 'முடிந்தது!',
      quiz_retry: 'மீண்டும்',
      quiz_home: 'முகப்பு',
      bn_home: 'முகப்பு',
      bn_settings: 'அமைப்புகள்',
      home_daily: '🔥 தினசரி சவால் 🔥',
      lang_switched: 'மொழி: தமிழ்',
      games_sub: 'ஹிஃப்ஸ் பயிற்சி · coins சம்பாதிக்கவும்',
      game_memory_title: 'Memory Match',
      game_memory_desc: 'அஸ்மாஉல் ஹுஸ்னா · அரபி ↔ தமிழ் பெயர் · +15 coins',
      game_speed_title: 'Speed Quiz',
      game_speed_desc: '30 வினாடி · ஆயத்து எந்த சூரா? · +20 coins',
      game_order_title: 'Ayah Order',
      game_order_desc: 'ஆயத்துகளை சரியான வரிசையில் அடுக்குங்கள் · +25 coins',
      game_blank_title: 'Missing Word',
      game_blank_desc: 'ஆயத்தில் மறைந்த சொல்லை கண்டுபிடியுங்கள் · +20 coins',
      game_surah_title: 'Which Surah?',
      game_surah_desc: 'ஆயத்தைப் பார்த்து சூராவை அடையாளம் காணுங்கள் · +20 coins',
      game_tf_title: 'True / False',
      game_tf_desc: 'ஆயத்து + சூரா சரியா தவறா · +15 coins',
      salawat_types: 'ஸலவாத்தின் வகைகள்',
      salawat_virtues_title: 'ஸலவாத்தின் சிறப்புகள்',
      salawat_benefits_title: 'ஸலவாத் ஓதுவதால் கிடைக்கும் நன்மைகள்',
      salawat_how_title: 'ஸலவாத் ஓதுவது எப்படி?',
      milad_note_title: '📌 குறிப்பு',
      milad_note_body: 'நீங்கள் இதில் முதல் இடம் வர வேண்டும் என்றால் டெலிகிராம் சேனலில் சேர வேண்டும். லிங்க் கீழே உள்ளது.',
      milad_tg_btn: '✈️ டெலிகிராம் சேனல் சேர',
      about_help_title: '🤲 உதவி கோரிக்கை',
      about_help_body: 'உங்களால் முடிந்த உதவி செய்யுங்கள். அல்லாஹ் பரக்கத் செய்வானாக ஆமீன்.',
      about_bug_title: '⚠️ தவறுகள் தெரியப்படுத்த',
      about_bug_body: 'இந்த website-ல் தவறுகள் இருந்தால் தெரியப்படுத்த வேண்டும்',
      about_dua1: 'இதை உருவாக்க யோசனை கொடுத்த அல்லாஹ்வுக்கு எல்லா புகழும்.',
      about_dua2: 'நபி (ஸல்) அவர்கள் பரக்கத்தால் அல்லாஹ் இதை பரவ செய்வானாக ஆமீன்.',
      about_dua3: 'அன்பானவர்களே, என் குடும்பத்திற்கு நோய், நெடி இல்லாத வாழ்க்கைக்காக அனைவரும் துஆ செய்யுங்கள் 🤲',
      about_name_sub: '📍 ராம்நாடு',
      about_future: '✨ வருங்கால 2027 உஸ்மானி',
      filter_daily: 'தினசரி',
      filter_weekly: 'வாராந்திர',
      filter_all: 'மொத்தம்',
      milad_sub: 'நபிகள் நாயகம் (ஸல்) அவர்களின் பிறந்த நாள் கொண்டாட்டம்',
      plb_sub_milad: 'கேள்வி & பதில் · 100 கேள்வி மதிப்பெண்',
      close: 'மூடு',
      wa_open: '💬 WhatsApp திற',
      num_copy: '📋 Number Copy'
    },
    en: {
      nav_garden: 'Garden',
      nav_milad: 'Milad Event',
      nav_surahs: 'Surahs',
      nav_juz: 'Juz',
      nav_games: 'Games',
      nav_badges: 'Achievements',
      nav_dhikr: 'Dhikr',
      nav_rabbana: 'Rabbana Duas',
      nav_nabi_dua: 'Prophet\'s Duas',
      nav_salawat: 'Salawat on Nabi',
      nav_prayer: 'Prayer Times',
      nav_hadees: 'Hadith',
      nav_font: 'Font Style',
      nav_themes: 'Themes',
      nav_about: 'About Me',
      nav_sound: 'Sound',
      nav_lang: 'Language · மொழி',
      title_games: 'Games',
      title_badges: '🏆 Achievements',
      title_leaderboard: '🏆 Leaderboard',
      title_themes: '🎨 Themes',
      title_font: '✍️ Font Style',
      title_juz: '30 Juz',
      title_prayer: '🕌 Prayer Times',
      title_dhikr: 'Dhikr',
      title_rabbana: '🤲 40 Rabbana Duas',
      title_hadees: '📖 Sahih al-Bukhari',
      hadees_sub: 'Complete Sahih Bukhari · 97 books · 7500+ hadiths',
      title_salawat: 'ﷺ Send Salawat on the Prophet',
      salawat_sub: 'Types · Virtues · Counter',
      salawat_tap: 'Recite Salawat (Tap)',
      btn_reset: 'Reset',
      btn_back_garden: '⬅ Garden',
      title_milad: '🌙 Milad Event',
      title_about: '💚 About Me',

      msg_daily_goal: '🎯 Daily goal! +25 coins',
      msg_surah_load_fail: 'Could not load surah. Internet required.',
      msg_audio_fail: 'Audio failed to load (Internet required)',
      msg_no_audio: 'No audio available',
      msg_no_audio_surah: 'No audio (surah number needed)',
      msg_confirm_reset: 'Reset?',
      msg_import_ok: 'Import successful!',
      msg_bad_file: 'Invalid file',
      msg_copied: 'Copied!',
      msg_order_wrong: '❌ Wrong order — try again',
      msg_enter_name: 'Your name (for Leaderboard):',
      msg_copy_num: 'Copy this number:',
      msg_reset_salawat: 'Reset the count? (Milad leaderboard will also reset)',
      msg_pause: '⏸ Pause',
      msg_listen_ayah: '🔊 Listen to ayah',
      msg_listen_surah: '🔊 Listen to full surah',
      msg_tap_surah_listen: 'Tap a surah to listen',
      msg_juz_audio_title: '🎧 30 Juz · Audio',
      msg_pick_juz: 'Select a Juz (1-30)',
      msg_fill_blank: 'Fill in the blank',
      msg_pick_ayah_meaning: 'Pick the ayah that matches the meaning',
      msg_level_done: '🎉 Level complete! Press Next Level to continue',
      msg_copied_short: '✅ Copied',
      msg_memory_title: '🃏 Memory · Asmaul Husna',
      msg_check: '✅ Check',
      msg_prayers_done: 'Today\'s prayers are done',
      msg_loading_time: 'Loading times…',
      msg_time_fail: 'Could not get times (Internet required)',
      msg_no_geo: 'Location not supported on this device',
      msg_finding_loc: 'Finding location…',
      msg_loc_denied: 'Location unavailable — please allow permission',
      msg_juz_list: '⬅ Juz list',
      msg_juz_open_fail: 'Could not open Juz',
      msg_juz_ayat_fail: 'Could not load Juz ayahs (Internet required)',
      msg_all_juz: 'All Juz',
      msg_stopped: 'Stopped',
      msg_not_started: 'Not started',
      msg_chrome_needed: 'Chrome required · or use Search mode',
      msg_no_surah_data: 'No surah data — load a surah first',
      msg_listening: '🔴 Listening — recite… stops when you pause',
      msg_paused_silence: '⏹ Paused (silence) · press 🎤 again to continue',
      msg_conn_ended: '⏹ Connection ended',
      msg_press_mic: '🎤 Press and recite · stops automatically when silent',
      msg_prev: '◀ Prev',
      msg_next: 'Next ▶',
      msg_player: 'Player',
      msg_finish_prev_level: 'First complete the {c} surahs in Level {n}!',
      msg_juz_no_data: 'No data for Juz {j}',
      msg_milad_empty: '🌙 Milad Salawat has not started yet<br><small>Go to Salawat on Nabi → recite and count!</small>',
      msg_lb_empty: 'No one has finished this Level yet<br><small>You can be first! 🚀</small>',

      app_title: 'Quran Garden',
      app_title_h1: '🌸 Quran Garden 🌸',
      loading: 'Loading…',
      levels_label: '🎮 Levels (10 surahs / Level)',
      btn_name: '👤 Name',
      search_surah: 'Search surah...',
      btn_gardens: '⬅ Gardens',
      btn_reset_full: '🔄 Reset',
      daily_goal_label: 'Daily goal',
      done_label: 'Done',
      surah_complete: '🎉 Surah complete!',
      btn_quit: '✖ Quit',
      plb_who: 'Who is leading?',
      badges_title: '🎖️ Badges',
      btn_back: '⬅ Back',
      theme_section: '🎨 Theme',
      search_dua: 'Search dua / meaning...',
      search_nabi_dua: 'Search dua / category...',
      you_label: 'You',
      btn_close_x: '✖ Close',
      btn_tajweed: '🎨 Tajweed',
      btn_meaning: 'Meaning',
      pick_ayah: 'Select an ayah',
      dhikr_daily: 'Daily dhikr',
      dhikr_salah: 'After-prayer dhikr',
      title_nabi_dua: '🌙 Prophet\'s Duas',
      font_script: 'Quran script style',
      font_desc: 'South Asian · Taj Mushaf',
      madinah_desc: 'Madinah · King Fahd',
      themes_hint: 'Colors only · classic UI unchanged',
      prayer_hint: 'Tamil Nadu · state capitals / major cities',
      madhab_label: 'Madhab',
      dhikr_salah_btn: '🕌 After prayer',
      lbl_surah: 'Surah',
      lbl_ayah: 'Ayah',
      lbl_ayahs: 'ayahs',
      lbl_locked: 'Locked',
      msg_done_short: 'Done',
      lbl_loading: 'Loading',
      msg_next_ayah: 'Select the next ayah',
      msg_which_surah: 'Which surah is this ayah from?',
      msg_not_enough_ayahs: 'Not enough ayahs',
      msg_ayah_correct: 'Does this ayah belong to this surah?',
      dhikr_sub: 'Tap to count · Remember Allah',
      dhikr_hint: 'Select a dhikr above · tap the box to count',
      btn_reset_dhikr: '↺ Reset',
      dhikr_sequence: 'Sequence: Subhanallah 33 → Alhamdulillah 33 → Allahu Akbar 33 → Tahlil (100)',
      rabbana_sub: 'Rabbana duas from the Quran · English meaning',
      nabi_sub: 'Masnoon duas taught by the Prophet (ﷺ) · English meaning',
      juz_sub: 'Juz only · ayah range · not surah / audio menu',
      nav_quiz: 'Q & A',
      title_quiz: '🕌 Q & A',
      quiz_sub: 'Prophet Muhammad ﷺ — 100 Questions',
      quiz_intro: '100 multiple-choice questions about the Prophet ﷺ. Four options each — pick the correct answer.',
      quiz_start: 'Start',
      quiz_start10: '10 questions only',
      quiz_score: 'Score',
      quiz_next: 'Next →',
      quiz_done: 'Finished!',
      quiz_retry: 'Try again',
      quiz_home: 'Home',
      bn_home: 'Home',
      bn_settings: 'Settings',
      home_daily: '🔥 Daily Challenge 🔥',
      lang_switched: 'Language: English',
      games_sub: 'Hifz practice · earn coins',
      game_memory_title: 'Memory Match',
      game_memory_desc: 'Asmaul Husna · Arabic ↔ Tamil names · +15 coins',
      game_speed_title: 'Speed Quiz',
      game_speed_desc: '30 seconds · Which surah is this ayah? · +20 coins',
      game_order_title: 'Ayah Order',
      game_order_desc: 'Arrange ayahs in the correct order · +25 coins',
      game_blank_title: 'Missing Word',
      game_blank_desc: 'Find the missing word in the ayah · +20 coins',
      game_surah_title: 'Which Surah?',
      game_surah_desc: 'Identify the surah from the ayah · +20 coins',
      game_tf_title: 'True / False',
      game_tf_desc: 'Is this ayah + surah pair correct? · +15 coins',
      salawat_types: 'Types of Salawat',
      salawat_virtues_title: 'Virtues of Salawat',
      salawat_benefits_title: 'Benefits of Reciting Salawat',
      salawat_how_title: 'How to Recite Salawat?',
      milad_note_title: '📌 Note',
      milad_note_body: 'To reach 1st place in this ranking, please join our Telegram channel. Link below.',
      milad_tg_btn: '✈️ Join Telegram Channel',
      about_help_title: '🤲 Request for Help',
      about_help_body: 'Please help if you can. May Allah bless you. Ameen.',
      about_bug_title: '⚠️ Report Errors',
      about_bug_body: 'If you find any errors on this website, please let us know.',
      about_dua1: 'All praise is for Allah who inspired the idea to create this.',
      about_dua2: 'By the barakah of the Prophet (ﷺ), may Allah spread this. Ameen.',
      about_dua3: 'Dear friends, please make dua for my family — a life free from illness and hardship 🤲',
      about_name_sub: '📍 Ramanathapuram',
      about_future: '✨ Future 2027 Uthmani',
      filter_daily: 'Daily',
      filter_weekly: 'Weekly',
      filter_all: 'All-time',
      milad_sub: 'Celebration of the birth of Prophet Muhammad (ﷺ)',
      plb_sub_milad: 'Q & A · 100-question scores',
      close: 'Close',
      wa_open: '💬 Open WhatsApp',
      num_copy: '📋 Copy Number'
    }
  },
  t: function(key){
    var d = this.dict[this.lang] || this.dict.ta;
    return (d && d[key]) != null ? d[key] : ((this.dict.ta[key] != null) ? this.dict.ta[key] : key);
  },
  apply: function(){
    var self = this;
    document.querySelectorAll('[data-i18n]').forEach(function(el){
      var key = el.getAttribute('data-i18n');
      if(!key) return;
      var val = self.t(key);
      if(el.tagName === 'INPUT' || el.tagName === 'TEXTAREA'){
        el.placeholder = val;
      } else if(el.getAttribute('data-i18n-html') === '1' || (val && val.indexOf('<') >= 0)){
        el.innerHTML = val;
      } else {
        el.textContent = val;
      }
    });
    document.querySelectorAll('[data-i18n-placeholder]').forEach(function(el){
      var key = el.getAttribute('data-i18n-placeholder');
      if(key) el.placeholder = self.t(key);
    });
    document.querySelectorAll('[data-i18n-title]').forEach(function(el){
      var key = el.getAttribute('data-i18n-title');
      if(key) el.title = self.t(key);
    });
    document.querySelectorAll('[data-lang]').forEach(function(el){
      var L = el.getAttribute('data-lang');
      el.style.display = (L === self.lang) ? '' : 'none';
    });
    try{ document.documentElement.lang = self.lang === 'en' ? 'en' : 'ta'; }catch(e){}
    try{ document.title = self.t('app_title'); }catch(e){}
  },
  setLang: function(lang){
    this.lang = (lang === 'en') ? 'en' : 'ta';
    try{ localStorage.setItem('qg_lang', this.lang); }catch(e){}
    this.apply();
  },
  toggle: function(){
    this.setLang(this.lang === 'en' ? 'ta' : 'en');
  },
  init: function(){
    try{
      var saved = localStorage.getItem('qg_lang');
      if(saved === 'en' || saved === 'ta') this.lang = saved;
    }catch(e){}
    this.apply();
    function bindLangBtn(btn){
      if(!btn || btn.dataset.i18nBound) return;
      btn.dataset.i18nBound = '1';
      btn.onclick = function(e){
        e.preventDefault();
        e.stopPropagation();
        I18N.toggle();
        I18N.syncLangButtons();
        try{ if(typeof renderPlotsGrid==='function') renderPlotsGrid(); }catch(e){}
        try{ if(typeof renderDhikrList==='function') renderDhikrList(); }catch(e){}
        try{ if(typeof renderDuaList==='function') renderDuaList((document.getElementById('duaSearch')||{}).value||''); }catch(e){}
        try{ if(typeof renderNabiDuaList==='function') renderNabiDuaList(); }catch(e){}
        try{ if(typeof renderJuzSettingsList==='function') renderJuzSettingsList(); }catch(e){}
        try{ if(typeof renderHomeHadiths==='function') renderHomeHadiths(); }catch(e){}
        try{ if(typeof renderHadeesScreen==='function') renderHadeesScreen(); }catch(e){}
        try{ if(typeof initSalawat==='function') initSalawat(); }catch(e){}
    try{ if(typeof initQuiz==='function') initQuiz(); }catch(e){}
        try{ if(typeof updateSalahDhikrUI==='function') updateSalahDhikrUI(); }catch(e){}
        try{ if(typeof updateHeader==='function') updateHeader(); }catch(e){}
      };
    }
    bindLangBtn(document.getElementById('sideLangBtn'));
    bindLangBtn(document.getElementById('headerLangBtn'));
    this.syncLangButtons();
  },
  syncLangButtons: function(){
    var hb = document.getElementById('headerLangBtn');
    if(hb){
      var badge = document.getElementById('headerLangBadge');
      var label = (this.lang === 'en') ? 'TA' : 'EN';
      if(badge) badge.textContent = label;
      else {
        // keep icon; only update title
      }
      hb.title = (this.lang === 'en') ? 'Switch to Tamil / தமிழ்' : 'Switch to English';
    }
    try{
      var label = document.querySelector('#sideLangBtn .side-nav-label');
      if(label) label.textContent = this.t('nav_lang');
    }catch(e){}
  }
};
(function(){
  function bootI18n(){
    try{ I18N.init(); }catch(e){}
  }
  if(document.readyState === 'loading') document.addEventListener('DOMContentLoaded', bootI18n);
  else bootI18n();
  setTimeout(bootI18n, 300);
})();


/* Bind all back buttons → Home hub */
(function(){
  function goHome(){
    try{
      if(typeof switchScreen==='function') switchScreen('screenSelect');
      if(typeof showHomeHub==='function') showHomeHub(true);
    }catch(e){}
  }
  var ids = ['badgesBackBtn','profileBackBtn','dhikrBackBtn','duaBackBtn','nabiDuaBackBtn','hadeesBackBtn','quizBackBtn','gamesBackBtn','fontBackBtn','juzBackFilterBtn','prayerScreenBackBtn','salawatBackBtn','miladBackBtn','homeBackHub'];
  function bind(){
    ids.forEach(function(id){
      var el = document.getElementById(id);
      if(el && !el.dataset.homeBackBound){
        el.dataset.homeBackBound = '1';
        el.addEventListener('click', function(e){
          e.preventDefault();
          e.stopPropagation();
          goHome();
        });
      }
    });
  }
  if(document.readyState==='loading') document.addEventListener('DOMContentLoaded', bind);
  else bind();
  setTimeout(bind, 500);
  setTimeout(bind, 1500);
  setTimeout(ensureBackIcons, 100);
  setTimeout(ensureBackIcons, 800);
  setTimeout(ensureBackIcons, 2000);
})();


/* ===== Home prayer countdown strip ===== */
function prayerParseHM(t){
  if(!t) return null;
  var m = String(t).match(/(\d{1,2}):(\d{2})/);
  if(!m) return null;
  return parseInt(m[1],10)*60 + parseInt(m[2],10);
}
function updateHomePrayerStrip(){
  var nameEl = document.getElementById('hpsName');
  var countEl = document.getElementById('hpsCount');
  if(!nameEl || !countEl) return;

  var names = [
    {key:'Fajr', ta:'ஃபஜ்ர்'},
    {key:'Dhuhr', ta:'லுஹர்'},
    {key:'Asr', ta:'அஸ்ர்'},
    {key:'Maghrib', ta:'மஃக்ரிப்'},
    {key:'Isha', ta:'இஷா'}
  ];
  if(new Date().getDay()===5) names[1]={key:'Dhuhr', ta:'ஜும்ஆ'};

  var timings = null;
  try{
    var raw = localStorage.getItem('qg_prayer_timings_v1');
    if(raw){
      var o = JSON.parse(raw);
      if(o && o.timings && o.date === (new Date()).toDateString()) timings = o.timings;
    }
  }catch(e){}

  function applyNext(timingsObj){
    var now = new Date();
    var nowSec = now.getHours()*3600 + now.getMinutes()*60 + now.getSeconds();
    var next = null;
    for(var i=0;i<names.length;i++){
      var mins = prayerParseHM(timingsObj[names[i].key]);
      if(mins==null) continue;
      var sec = mins*60;
      if(sec > nowSec){ next = {ta:names[i].ta, sec:sec}; break; }
    }
    if(!next){
      nameEl.textContent = 'இன்று முடிந்தது';
      countEl.textContent = '✓';
      countEl.classList.add('done');
      return;
    }
    countEl.classList.remove('done');
    nameEl.textContent = next.ta;
    var left = next.sec - nowSec;
    if(left < 0) left = 0;
    var hh = Math.floor(left/3600);
    var mm = Math.floor((left%3600)/60);
    var ss = left%60;
    countEl.textContent = String(hh).padStart(2,'0')+':'+String(mm).padStart(2,'0')+':'+String(ss).padStart(2,'0');
  }

  if(timings){
    applyNext(timings);
    return;
  }

  nameEl.textContent = 'நேரம் ஏற்றுகிறது…';
  countEl.textContent = '--:--:--';
  var loc = null;
  try{ loc = JSON.parse(localStorage.getItem('quran_prayer_loc_v1')||'null'); }catch(e){}
  var lat = (loc && loc.lat!=null) ? loc.lat : 13.0827;
  var lng = (loc && loc.lng!=null) ? loc.lng : 80.2707;
  var school = localStorage.getItem('quran_prayer_madhab_v1')==='hanafi' ? 1 : 0;
  var url = 'https://api.aladhan.com/v1/timings?latitude='+encodeURIComponent(lat)+
    '&longitude='+encodeURIComponent(lng)+'&method=1&school='+school;
  fetch(url).then(function(r){ return r.json(); }).then(function(data){
    var tm = data && data.data && data.data.timings;
    if(!tm) throw new Error('no');
    try{
      localStorage.setItem('qg_prayer_timings_v1', JSON.stringify({
        at: Date.now(), date: (new Date()).toDateString(), timings: tm, label: 'auto'
      }));
    }catch(e){}
    applyNext(tm);
  }).catch(function(){
    nameEl.textContent = 'தொழுகை நேரம்';
    countEl.textContent = '· · ·';
  });
}

(function initHomePrayerStrip(){
  function tick(){ try{ updateHomePrayerStrip(); }catch(e){} }
  tick();
  setInterval(tick, 1000);
  var strip = document.getElementById('homePrayerStrip');
  if(strip){
    strip.onclick = function(){
      try{
        if(typeof switchScreen==='function') switchScreen('screenPrayer');
        if(typeof initPrayerTimes==='function') initPrayerTimes();
      }catch(e){}
    };
  }
})();
